{"id":"25JnLB7bCaiYJ","title":"Tech News","displayTitle":"Tech News","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":83,"items":[{"title":"Ubuntu Maker Canonical Generated Nearly $300M In Revenue Last Year","url":"https://www.phoronix.com/news/Canonical-2024-Annual-Report","date":1750962120,"author":"Michael Larabel","guid":721,"unread":true,"content":"<article>A decade ago Canonical did around $81 million in revenue (2014) with a head count of around 337 at the company behind Ubuntu Linux while their Linux desktop efforts were still gaining a footing with OEMs/ODMs pre-loads, within enterprise desktop environments, and the lucrative server/cloud space. Canonical recently filed their 2024 annual report and they are now up to almost $300 million USD in revenue and a headcount of more than 1,100...</article>","contentLength":443,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"In just 3 months, CoreWeave CEO, once a crypto-mining bro, becomes a deca-billionaire","url":"https://techcrunch.com/2025/06/26/in-just-3-months-coreweave-ceo-once-a-crypto-mining-bro-becomes-a-deca-billionaire/","date":1750961538,"author":"Julie Bort","guid":153,"unread":true,"content":"<article>CoreWeave remains a symbol of the AI industry in 2025: Massive revenue, investor enthusiasm built on an insatiable need for more. </article>","contentLength":130,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Windows is Getting Rid of the Blue Screen of Death After 40 Years","url":"https://tech.slashdot.org/story/25/06/26/1737218/windows-is-getting-rid-of-the-blue-screen-of-death-after-40-years?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1750961400,"author":"msmash","guid":284,"unread":true,"content":"The Blue Screen of Death (BSOD) has held strong in Windows for nearly 40 years, but that's about to change. From a report: Microsoft revealed earlier this year that it was overhauling its BSOD error message in Windows 11, and the company has now confirmed that it will soon be known as the Black Screen of Death. The new design drops the traditional blue color, frowning face, and QR code in favor of a simplified black screen. \n\nThe simplified BSOD looks a lot more like the black screen you'd see during a Windows update. But it will list the stop code and faulty system driver that you wouldn't always see during a crash dump. IT admins shouldn't need to pull crash dumps off PCs and analyze them with tools like WinDbg just to find out what could be causing issues. The company will roll out this new BSOD design in an update to Windows 11 \"later this summer.\"","contentLength":864,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Threads now lets you manage Hidden Words separately from Instagram, set time limits","url":"https://techcrunch.com/2025/06/26/threads-now-lets-you-manage-hidden-words-separately-from-instagram-set-time-limits/","date":1750960666,"author":"Aisha Malik","guid":152,"unread":true,"content":"<article>Threads, Meta’s competitor to X, now has its own Hidden Words settings that operates separately from Instagram.</article>","contentLength":113,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Google Photos merges classic search with AI to speed up results","url":"https://techcrunch.com/2025/06/26/google-photos-merges-classic-search-with-ai-to-speed-up-results/","date":1750960505,"author":"Sarah Perez","guid":151,"unread":true,"content":"<article>The AI feature, first introduced at Google's I/O developer conference last year, allows users to search across their collection of digital photos using natural language queries.</article>","contentLength":177,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Malaysia Will Stop Accepting US Plastic Waste","url":"https://news.slashdot.org/story/25/06/26/1726216/malaysia-will-stop-accepting-us-plastic-waste?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1750959000,"author":"msmash","guid":283,"unread":true,"content":"An anonymous reader shares a report: Malaysia will ban plastic waste imports from the U.S. starting Tuesday because of America's failure to abide by the Basel Convention treaty on international waste transfers, in a move that could have significant consequences for California. \n\nMalaysia emerged as a major destination for U.S. waste after China banned American waste imports in 2018. California shipped 864 shipping containers, or more than 10 million pounds of plastic waste, to Malaysia in 2024, according to the Basel Action Network, an advocacy group. That was second only to Georgia among U.S. states. \n\nUnder Malaysian waste guidelines announced last month, the country will no longer accept plastic waste and hazardous waste from nations that didn't ratify the Basel Convention, the international treaty designed to reduce the international movement of hazardous and other waste. The U.S. is one of just a handful of countries, including Fiji and Haiti, that hasn't signed the pact.","contentLength":991,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Uber has Atlanta’s autonomous ride-hailing and delivery market on lock","url":"https://techcrunch.com/2025/06/26/uber-has-atlantas-autonomous-ride-hailing-and-delivery-market-on-lock/","date":1750957826,"author":"Rebecca Bellan","guid":150,"unread":true,"content":"<article>Uber Eats customers in Atlanta can now opt in to have their food delivered via sidewalk delivery robots, following partner Serve Robotics’s launch on Thursday. The move comes just two days after Uber and Waymo launched a commercial robotaxi service in the city.&nbsp;</article>","contentLength":265,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Mesa 25.2 RADV Driver Merges Support For AV1 Vulkan Video Encode","url":"https://www.phoronix.com/news/RADV-Merges-AV1-Encode","date":1750957267,"author":"Michael Larabel","guid":720,"unread":true,"content":"<article>Published last November as part of Vulkan 1.3.302 was the VK_KHR_video_encode_av1 extension for adding AV1 video encoding to the Vulkan Video API. Ahead of next quarter's Mesa 25.2 release, the open-source Radeon Vulkan driver \"RADV\" has merged its AV1 encode support...</article>","contentLength":270,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Rivian cuts dozens on manufacturing team ahead of R2 launch","url":"https://techcrunch.com/2025/06/26/rivian-cuts-dozens-on-manufacturing-team-ahead-of-r2-launch/","date":1750957109,"author":"Sean O'Kane","guid":149,"unread":true,"content":"<article>The company laid off around 1% of its total workforce, or around 140 employees. It's the third round of cuts since the start of 2024. </article>","contentLength":134,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Elon Musk reportedly fires Tesla’s top sales exec","url":"https://techcrunch.com/2025/06/26/elon-musk-reportedly-fires-teslas-top-sales-exec/","date":1750956621,"author":"Sean O'Kane","guid":148,"unread":true,"content":"<article>Omead Afshar, one of Musk's top lieutenants, is out after more than seven years at the company. He was recently elevated to a VP role in late 2024.</article>","contentLength":147,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Microsoft Moves Antivirus Software Out of Windows Kernel To Prevent CrowdStrike-Style Crashes","url":"https://tech.slashdot.org/story/25/06/26/1650259/microsoft-moves-antivirus-software-out-of-windows-kernel-to-prevent-crowdstrike-style-crashes?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1750956600,"author":"msmash","guid":282,"unread":true,"content":"Microsoft is preparing to release a private preview of Windows changes that will move antivirus and endpoint detection and response apps out of the Windows kernel, nearly a year after a faulty CrowdStrike update crashed 8.5 million Windows-based machines worldwide. \n\nThe new Windows endpoint security platform is being developed in cooperation with CrowdStrike, Bitdefender, ESET, Trend Micro, and other security vendors. David Weston, Microsoft's vice president of enterprise and OS security, said dozens of partners have submitted papers detailing design requirements, some hundreds of pages long. The private preview will allow security vendors to request changes before the platform is finalized.","contentLength":701,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"US, French authorities confirm arrest of BreachForums hackers","url":"https://techcrunch.com/2025/06/26/us-french-authorities-confirm-arrest-of-breachforums-hackers/","date":1750955334,"author":"Lorenzo Franceschi-Bicchierai","guid":147,"unread":true,"content":"<article>Kai West was arrested in France, along with four other hackers, all suspected of being part of the well-known hacking forum, BreachForums.</article>","contentLength":138,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Europe’s First Exascale Supercomputer Powers Up","url":"https://spectrum.ieee.org/jupiter-exascale-supercomputer-europe","date":1750955260,"author":"Michael Dumiak","guid":174,"unread":true,"content":"<p>Debuting at number 4 on the TOP500, JUPITER could open vast scientific vistas</p>","contentLength":77,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy82MTEwNjA1MS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc3ODY2NzYyNX0.GYXAvGElUm_42AAuEc4HzE1Lsb-lbH1UjyW-5jEb2QU/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"Homeland Security warns of Iran-backed cyberattacks targeting US networks","url":"https://techcrunch.com/2025/06/26/homeland-security-warns-of-iran-backed-cyberattacks-targeting-us-networks/","date":1750954800,"author":"Zack Whittaker","guid":146,"unread":true,"content":"<article>DHS said low-level cyberattacks targeting U.S. networks are \"likely\" in the wake of military conflict between the U.S. and Israel and Iran.</article>","contentLength":139,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Meta hires key OpenAI researcher to work on AI reasoning models","url":"https://techcrunch.com/2025/06/26/meta-hires-key-openai-researcher-to-work-on-ai-reasoning-models/","date":1750954439,"author":"Maxwell Zeff","guid":145,"unread":true,"content":"<article>In recent months, Mark Zuckerberg has been on a hiring spree to build out Meta's new AI team, offering $100 million compensation packages to top researchers who join his company. </article>","contentLength":179,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"As AI kills search traffic, Google launches Offerwall to boost publisher revenue","url":"https://techcrunch.com/2025/06/26/as-ai-kills-search-traffic-google-launches-offerwall-to-boost-publisher-revenue/","date":1750953850,"author":"Sarah Perez","guid":144,"unread":true,"content":"<article>Offerwall lets publishers give their sites' readers a variety of ways to access their content, including through options like micropayments, taking surveys, watching ads, and more.</article>","contentLength":180,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Who Needs Accenture in the Age of AI?","url":"https://slashdot.org/story/25/06/26/165227/who-needs-accenture-in-the-age-of-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1750953720,"author":"msmash","guid":281,"unread":true,"content":"Accenture is facing mounting challenges as AI threatens to disrupt the consulting industry the company helped build. The Dublin-based firm, which made its fortune advising clients on adapting to new technologies from the internet to cloud computing, now confronts the same predicament as generative AI reshapes business operations. \n\nThe company's new generative AI contracts slowed to $100 million in the most recent quarter, down from $200 million per quarter last year. Technology partners including Microsoft and SAP are increasingly integrating AI directly into their offerings, allowing systems to work immediately without extensive consulting support. Newcomers like Palantir are embedding their own engineers with customers, enabling clients to bypass traditional consultants. \n\nBetween 2015 and 2024, Accenture generated a 370% total return by helping companies navigate technological transitions. The firm reached a $250 billion valuation in February before losing $60 billion in market value. CEO Julie Sweet insists that the company is reorganizing around \"reinvention services.\" A recent survey found 42% of companies abandoned most AI initiatives, up from 17% a year ago.","contentLength":1185,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Suno snaps up WavTool for its AI music editing tools amid ongoing dispute with music labels","url":"https://techcrunch.com/2025/06/26/suno-snaps-up-wavtool-for-its-ai-music-editing-tools-amid-ongoing-dispute-with-music-labels/","date":1750951800,"author":"Lauren Forristal","guid":143,"unread":true,"content":"<article>AI music company Suno acquired WavTool, a browser-based AI DAW. This aims to improve editing capabilities for musicians.</article>","contentLength":120,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Why World's New 'Priority Lane' for Humans on the Blockchain Could Change Everything","url":"https://hackernoon.com/why-worlds-new-priority-lane-for-humans-on-the-blockchain-could-change-everything?source=rss","date":1750951737,"author":"Ishan Pandey","guid":194,"unread":true,"content":"<h2>Can a Blockchain Truly Be for Humans First? World Is Betting on It.</h2><p>What if there were an internet where you, as a human, were always in the fast lane, never stuck in traffic behind armies of automated bots? This isn't a hypothetical question for World, the ambitious project formerly known as Worldcoin. With the launch of its blockchain, <a href=\"https://world.org/\">World Chain</a>, the company has introduced a radical new concept: Priority Blockspace for Humans (PBH). It is a direct attempt to solve one of the most persistent problems in the crypto world, network congestion caused by bots, and to create a digital world where human users are the top priority. For its 13 million verified users, this could mean a fundamentally fairer and more reliable online experience.</p><p>\\\nThe core idea of blockchain technology was to create decentralized and open networks. However, anyone who has tried to make a transaction on popular blockchains like Ethereum during peak times knows the frustration. Transaction fees, known as gas fees, can skyrocket as users compete to have their transactions processed. This system often favors those with the most capital, including automated bots designed to snatch up limited digital goods or manipulate markets, pushing out regular users. <a href=\"https://world.org/\">World’</a>s new system aims to flip this model on its head. Instead of a bidding war, it uses a person's verified humanity as the ultimate pass to the front of the line, ensuring that during high traffic, it is the human users who are served first, not the bots.</p><p>\\\nThis is made possible through <a href=\"https://world.org/\">World ID</a>, the project's controversial yet core component. To get a World ID, a user must have their iris scanned by a physical device called an Orb. This process is designed to create a \"proof of personhood,\" a digital verification that a user is a unique human being and not a bot or a duplicate account. With the launch of World Chain, this proof of personhood is now being used to grant privileged access. During periods of heavy network traffic, a specific portion of each block, the digital bundles of data that make up a blockchain, is reserved exclusively for transactions coming from these Orb-verified humans. This ensures that essential activities, from verifying one's identity to using applications on the network, remain smooth and inexpensive for people.</p><h3>A New Set of Rules for the Digital Economy</h3><p>The introduction of Priority Blockspace for Humans represents a significant technical and philosophical shift for blockchain infrastructure. It moves away from a purely economic model, where network priority is bought, to a model based on identity. \"By granting real human transactions built-in priority during block production, Priority Blockspace for Humans effectively makes World Chain fairer and more efficient,\" said Steven Smith, Vice President of Engineering and Protocol at Tools for Humanity, a key contributor to the World project. This baked-in priority means that verified users are shielded from the wild fee swings that plague other networks, creating a more predictable and user-friendly environment.</p><p>\\\nTo understand the impact, consider the example of claiming a digital grant or purchasing a popular, limited-edition item on a traditional blockchain. In such a scenario, bots can be programmed to flood the network with transactions, driving up fees and making it nearly impossible for a human user to succeed without paying an exorbitant price. World Chain’s PBH system is designed to neutralize this threat. The reserved blockspace acts as a dedicated lane for humans, allowing their transactions to be processed quickly and without the extra cost, regardless of bot activity. \"We firmly believe that humans and AI can coexist harmoniously,\" Smith added, \"and this development reflects our commitment to building user-friendly systems that benefit humanity while also making the most of bleeding-edge technology.”</p><p>\\\nThe technology behind this was not built in a vacuum. It was tested on an incentivized testnet, a trial environment that rewards participants for stress-testing the system, with input from leading blockchain research and development firms like Flashbots and Alchemy. The core components, including PBH and Rollup Boost, a tool that allows for this custom ordering of transactions, have been made open-source. This means anyone can inspect the code, a move intended to build trust and encourage wider adoption. Furthermore, the entire system underwent an independent security audit by Nethermind, a respected blockchain auditing firm, to ensure its integrity and security.</p><h3>Building on a Foundation for a Billion Users</h3><p>World Chain itself is what is known as a Layer-2 network. In simple terms, think of it as a highway built on top of a more secure, but slower, main road. The main road, in this case, is Ethereum, one of the largest and most secure blockchains. By processing transactions on its own \"layer\" and then bundling them to be secured by Ethereum, World Chain can offer significantly faster and cheaper transactions than Ethereum itself could handle alone. This architecture is built using the OP Stack, a standardized and open-source framework that is part of a larger vision for a \"Superchain\" ecosystem, an interconnected network of many Layer-2 blockchains that can communicate with each other.</p><p>\\\nThe ultimate goal for World is ambitious, to build a network that serves over a billion people. To achieve this, the platform is designed to support applications with real-world utility, focusing on areas like stablecoin-based finance, international remittances, and commerce. The integration with World ID's proof of personhood is central to this vision, as it aims to create a system where developers can build applications for a network of verified humans, reducing the risks of fraud and spam that are common in the digital world. Anyone with a compatible digital wallet can start exploring and using these applications, with the project’s own World App serving as the primary gateway.</p><p>World's launch of Priority Blockspace for Humans is a genuinely novel experiment in the ongoing effort to make blockchain technology more equitable and accessible. The project addresses a real and frustrating problem for everyday users who are often outmaneuvered and outspent by bots. By creating a system where human identity, not economic power, dictates network priority, World is making a bold statement about the kind of digital future it wants to build. The focus on a fairer system is a commendable goal that could, if successful, set a new standard for how public blockchains operate.</p><p>\\\nHowever, the project is not without its controversies, primarily centered around the privacy implications of its iris-scanning World ID system. While the Worldcoin Foundation maintains that the biometric data is handled securely and used only to generate a unique, anonymous verification, concerns about the centralization of such sensitive personal data persist. The success of World Chain is therefore intrinsically linked to its ability to earn and maintain public trust, not just in its technology but also in its stewardship of user data. The decision to make its core technology open-source and subject it to independent audits is a positive step in this direction.</p><p>\\\nUltimately, World is forcing a necessary conversation about who our digital infrastructure should serve. Is it for the highest bidder, or is it for the individual human user? While the road to a billion users is long and fraught with challenges, the launch of World Chain and its human-first priority system is a significant and fascinating step. It's an attempt to technically enforce a more level playing field, and the entire technology world will be watching to see if this radical idea can deliver on its promise of a fairer internet for all.</p><p>Don’t forget to like and share the story! </p>","contentLength":7838,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Study Finds LLM Users Have Weaker Understanding After Research","url":"https://slashdot.org/story/25/06/26/1526210/study-finds-llm-users-have-weaker-understanding-after-research?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1750951500,"author":"msmash","guid":280,"unread":true,"content":"Researchers at the University of Pennsylvania's Wharton School found that people who used large language models to research topics demonstrated weaker understanding and produced less original insights compared to those using Google searches. \n\nThe study, involving more than 4,500 participants across four experiments, showed LLM users spent less time researching, exerted less effort, and wrote shorter, less detailed responses. In the first experiment, over 1,100 participants researched vegetable gardening using either Google or ChatGPT. Google users wrote longer responses with more unique phrasing and factual references. A second experiment with nearly 2,000 participants presented identical gardening information either as an AI summary or across mock webpages, with Google users again engaging more deeply and retaining more information.","contentLength":846,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Mir 2.21 Released With Cursor Scaling & Mouse Keys Support","url":"https://www.phoronix.com/news/Mir-2.21-Released","date":1750951092,"author":"Michael Larabel","guid":719,"unread":true,"content":"<article>Mir 2.21 is out today for this Ubuntu/Canonical project to serve as a set of libraries used to simplify the development of Wayland-based shells/environments...</article>","contentLength":159,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Deribit And SignalPlus Launch “The Summer Chase” Trading Competition With a $300,000 USDC Prize Pool","url":"https://hackernoon.com/deribit-and-signalplus-launch-the-summer-chase-trading-competition-with-a-$300000-usdc-prize-pool?source=rss","date":1750950339,"author":"Chainwire","guid":193,"unread":true,"content":"<p>\"\" is a five-week trading contest offering a total prize pool of over $300,000 in USDC, with additional prizes including a Tesla, a Rolex, a Hawaii vacation, and more. From leaderboard battles to referral contests and daily reward events, the campaign aims to bring together a combination of skill, strategy, and summer fun for traders around the world.</p><ul><li>Users who  by June 30th will receive 3 free Deribit options.</li><li>By  a trader, users will have a chance to win a Tesla.</li></ul><blockquote><p>Luuk Strijers, Chief Executive Officer at Deribit, shared: \"We’re excited to launch the third edition of our Options Competition in partnership with SignalPlus. Following last year’s massive success and incredible momentum, we knew we had to take things to the next level. This year, we’re raising the stakes with bigger rewards, fresh challenges, and even more opportunities for traders to showcase their skills.\"</p><p>Chris Yu, Co-Founder of SignalPlus, added: “We're proud to partner with Deribit to welcome traders into the next exciting iteration of our summer trading competition. At SignalPlus, we are firm believers of crypto options being at the forefront of the next innovation wave, granting users ever expanding control of their digital asset portfolios. Together with Deribit's leading platform, we're delivering an experience that rewards skill, fosters learning, and energizes derivatives trading for the betterment of the community. As with our past collaboration successes, we are excited to see what this round of seasoned professionals and newcomers will achieve in the hot summer months, and look forward to interacting with all participants in the very near future.”</p></blockquote><ul><li>Attractive Prize Pool: Compete on both individual and team leaderboards for a chance to win USDC cash rewards and additional prizes. From Tesla to Rolex to Hawaii travel to physical gold, 'The Summer Chase' should have something in store for everyone!</li><li>Palm Throne Tournament: Climb the rankings each week by trading options and futures on Deribit with SignalPlus. Top traders earn weekly rewards with a twist - 1st place &amp; odd-numbered rankers will receive bonus rewards!</li><li>Island League Showdown - Team Competition: Team up and compete to win up to 1,000 USDC weekly, with 20% going to team leaders. All team members must meet the individual minimum trading volume for overall qualification.</li><li>Big Referral Prizes: Invite and refer top-performing traders to the competition for a chance to win a Tesla or the equivalent of 30,000 in USDC.Upsize your referral bonuses by inviting additional registered users to earn up to 3,500 USDC, as well as jackpot prizes including a Rolex Submariner, Skydive Dubai entry, F1 Grand Prix tickets, and more.</li><li>Participation Rewards &amp; Daily Lucky Draws: Activity-based rewards will be granted to participants for making your 1st trade, social media contests, weekend boosts, and other challenges. Earn participation rewards without worrying about your rankings! Furthermore, daily events will be held to incentivize active traders with guaranteed USDC awards, while qualified teams will have a chance to win a trip to Hawaii through regular lucky draws.</li><li>Cassette Rewards &amp; Symbol Game: Daily trading activity unlocks cassette tokens for guaranteed and limited USDC rewards. Special symbol-based mechanics offer the chance to win a Hawaii trip and extra bonuses for teams.</li><li>Lifestyle Prizes: From designer sunglasses and Apple Watches to travel giveaways and high-end electronics, The Summer Chase offers something for everyone.</li><li>Learning &amp; Engagement: Traders will have the opportunity to upskill their trading knowledge through weekly engagement events, prediction challenges, and social activities. Learn while you earn!</li></ul><p> invites participants into a dynamic trading competition that combines strategic trading with seasonal celebration. With every trade, contenders edge closer to exclusive summer rewards. The event begins today.</p><p> is a centralized, institutional-grade provider of crypto derivatives ecosystem, specializing in Bitcoin and Ethereum options and futures. With state-of-the-art infrastructure, Deribit offers instantaneous price discovery, low-latency execution, advanced risk mitigation tools, and deep liquidity through a network of top-tier market makers. Deribit facilitates the majority of global crypto options volume and upholds rigorous proof-of-reserves practices to maintain the highest standards of integrity and transparency.</p><p> delivers a comprehensive options trading suite tailored for crypto derivatives traders. Access an advanced suite of tools to perform delta hedging, risk analysis, P&amp;L attribution, and multi-leg execution with minimal slippage via our dashboard. Tap into exchange liquidity via listed order books or bilateral block-trade requests with institutional counterparties. Users can manage portfolio risk through an integrated suite of scenario-based risk simulations, supported by automated hedging functions and real-time Telegram alerts to help monitor exposures.</p><p>Deribit FZE is licensed by the VARA to provide Virtual Asset Exchange Services and does not accept or service retail clients. DRB Panama Inc. is not regulated and services both retail and non-retail clients. Virtual Assets are subject to extreme market volatility, involve a high degree of risk, and can lose value, in part or in full. Investing in Virtual Assets may result in you losing your entire investment.</p><p>Virtual Assets are not insured against potential losses and are not protected by any form of financial protection whatsoever. Participants onboarded as clients under Deribit FZE (Qualified Investors) are eligible to win up to 5,000 USD in total throughout the competition period. They are not eligible for high-value rewards such as the Tesla or Rolex prizes. Clients registered via DRB Panama Inc. are eligible for the full prize pool, including the Tesla, Rolex, and all other promotional rewards.</p><p>:::tip\nThis story was published as a press release by Chainwire under HackerNoon’s Business Blogging&nbsp;.</p>","contentLength":6004,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"PepeDollar: GameFi and Real Use Rewards","url":"https://hackernoon.com/pepedollar-gamefi-and-real-use-rewards?source=rss","date":1750950003,"author":"Flash PR","guid":192,"unread":true,"content":"<p>Here’s why  stands out as the meme coin that blends real use cases with community trust and scalable tech.</p><h2>GameFi and Real Use Rewards: Pepe Dollar (PEPD) Steps Ahead</h2><p>Pepe Dollar (PEPD)’s GameFi rewards system incentivizes holding and active participation, driving token velocity and user engagement. Brettcoin (BRETT) lacks such robust incentives, while Pepecoin (PEPE) offers limited utility beyond speculation. Explore the growing ecosystem and GameFi rewards at .</p><p>Whale investors have started migrating from Brettcoin (BRETT) to Pepe Dollar (PEPD), seeking projects with clearer long-term value. Pepe Dollar (PEPD) presale gains have seen stronger community support and strategic partnerships, reinforcing investor trust. Secure your position now by joining the Pepe Dollar (PEPD) presale.</p><p>Market experts forecast Pepe Dollar (PEPD) to reach $5 or more as its ecosystem expands, driven by game-changing technology and sound tokenomics. Brettcoin (BRETT) and Pepecoin (PEPE) may deliver short-term rallies but lack Pepe Dollar (PEPD)’s growth engine. Stay updated with the latest developments at the Pepe Dollar (PEPD) blog.</p><p>While Brett coin (BRETT) exploded onto the scene with impressive rallies and a strong Base blockchain backing, its inflated token supply and speculative volatility have put long-term growth in question. Brettcoin (BRETT) has yet to deliver on mechanisms like token burns or meaningful GameFi rewards to sustain momentum.</p><p>Pepecoin (PEPE) remains a beloved meme but struggles with its unlimited token supply and lack of integration with DeFi or payment infrastructure. This limits Pepecoin’s (PEPE) ability to convert hype into sustained investor profits.</p><h2>Pepe Dollar (PEPD): The Meme Coin Built for the Future</h2><p>Unlike Brettcoin (BRETT) and Pepecoin (PEPE), Pepe Dollar (PEPD) incorporates a capped supply, a 29% federal burn to increase scarcity, and a Layer-2 Ethereum (ETH) base that offers scalability and low fees. These fundamentals attract profit-focused investors who value sustainability. Learn more about Pepe Dollar (PEPD) and its tokenomics on the official .</p><p>For investors weighing their options in the meme coin space, Pepe Dollar (PEPD) offers a smarter balance of scarcity, utility, and community-driven growth. </p>","contentLength":2251,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Sia x HackerNoon: Inviting Developers to Build the Future of Decentralized Cloud Storage","url":"https://hackernoon.com/sia-x-hackernoon-inviting-developers-to-build-the-future-of-decentralized-cloud-storage?source=rss","date":1750949517,"author":"Sia Foundation","guid":191,"unread":true,"content":"<article>Through this collaboration, Sia becomes the decentralized storage backbone for over 100,000 HackerNoon stories—and counting.\n\nBy backing up every existing and future HackerNoon article on the Sia network, we’re helping ensure that tech journalism remains permanently accessible, censorship-resistant, and free from centralized control. Over 2,000 new stories will be added to Sia each month, showcasing just how scalable and reliable decentralized infrastructure can be.</article>","contentLength":474,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"D’CENT Wallet Launches Third ‘Tap That Drop’ Campaign With Taiko","url":"https://hackernoon.com/dcent-wallet-launches-third-tap-that-drop-campaign-with-taiko?source=rss","date":1750949444,"author":"BTCWire","guid":190,"unread":true,"content":"<p>has announced the launch of the third campaign in its seasonal Web3 initiative, Tap That Drop, featuring Taiko, an Ethereum Layer 2 protocol known for its based sequencing approach. The campaign began on May 27 and has already seen participation from tens of thousands of users across its first two rounds.</p><p>Developed by Korean blockchain security company IoTrust, D’CENT is widely recognized as a pioneer in the hardware wallet space. It introduced biometric authentication to the market in 2018 and has since expanded its global user base to more than 200 countries. The wallet supports more than 85 blockchain networks and 4,500 tokens. Now, D’CENT is evolving beyond secure storage, aiming to become a full-featured and intuitive Web3 platform that integrates portfolio tools, ecosystem discovery, and reward-based participation.</p><p>To support this shift,  launched Tap That Drop — the first seasonal quest campaign of its kind embedded in a wallet. Over several months, twelve blockchain projects will each run a two-week campaign featuring interactive quests, project-specific NFTs, and token-based rewards. Users who collect all twelve NFTs will qualify for a Mega Airdrop after season 1 ends. The 2024 edition received strong engagement from the Web3 community, with many participants highlighting the value of the rewards.The campaign has also served as a way for participating projects to introduce their ecosystems to new users and drive deeper interaction.</p><p>The format has already proven effective. The first round with Skate attracted more than 20,000 participants, with rewards fully claimed within few hours of launch. The second round with MAP Protocol saw even faster response, with all rewards claimed in less than two hours. Across both campaigns, biometric hardware wallet users received higher-tier rewards, and completing a quest unlocked access to wallet discounts — creating additional value for both new and existing users.</p><p><img src=\"https://cdn.hackernoon.com/images/FS1PiuQb1sWxoW2ESuJpZswu0xk2-2025-06-26T14:50:23.615Z-x4xl94fme3ya83u0ol4gkkgy\" alt=\"\">The third partner in the campaign is Taiko, an Ethereum-equivalent Layer 2 rollup focused on scalability without compromising decentralization. The protocol uses based sequencing for community-centric block production. Since its mainnet launch, where Ethereum co-founder Vitalik Buterin proposed the first block, Taiko has been listed on Binance Alpha as one of the platform’s top ten traded tokens and has kicked off Trailblazers Season 5 with 10,000 TAIKO in liquidity rewards.</p><blockquote><p>“We believe wallets are no longer just for holding crypto. They’re evolving into platforms for exploration and rewards,” said Sangsu Baek, CEO of IoTrust. “Through Tap That Drop and upcoming features like real-time portfolio tools, we’re building a new kind of user experience, where security and participation go hand in hand. That’s what sets D’CENT apart from other wallets in the space.”</p></blockquote><p>The Taiko campaign within Tap That Drop begins on June 25 in the D’CENT app. Participants can complete quests, mint a Taiko-themed NFT from the Star Collection, and claim token-based rewards. Hardware wallet users will continue to receive higher reward tiers and access to exclusive discounts.</p><p><strong>👉 Download D’CENT App and join the quest: </strong></p><strong><p> isn’t just a wallet—it’s where security meets opportunity.</p><p>Developed by IoTrust, D’CENT is the world’s first biometric hardware wallet, built with SE (Secure Element) &amp; TEE (Trusted Execution Environment) technology to ensure bank-grade security for your digital assets.</p><p>But D’CENT goes beyond security. Unlike traditional wallets that simply store crypto, D’CENT empowers users to do more—unlocking rewards, accessing exclusive benefits, and seamlessly interacting with Web3 services. As the only wallet offering both hardware and software solutions, D’CENT provides the flexibility to secure, earn, and engage, all in one place.</p><p>:::tip\nThis story was published as a press release by Btcwire under HackerNoon’s Business Blogging&nbsp;.</p></strong>","contentLength":3928,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Why is edwin Betting on Chat to Solve DeFi's Biggest Problem?","url":"https://hackernoon.com/why-is-edwin-betting-on-chat-to-solve-defis-biggest-problem?source=rss","date":1750949236,"author":"Ishan Pandey","guid":189,"unread":true,"content":"<h3>Can a Simple Conversation Unlock the Future of Decentralized Finance?</h3><p>What if interacting with the complex world of decentralized finance was as simple as sending a text message? For years, the promise of DeFi, a parallel financial system built on blockchain technology, has been available to a select few who could navigate its steep learning curve. Now, an emerging web3 startup <a href=\"https://edwin.finance/\">edwin</a> has publicly launched an <a href=\"https://terminal.edwin.finance/\">AI terminal</a>, a move that signals a potential shift in how people interact with this emerging financial landscape. The release aims to transform complex financial transactions into simple conversations, potentially opening the doors of DeFi to a much broader audience.</p><p>The traditional gateway to DeFi has been the crypto wallet. While essential for holding assets, these wallets often present users with a daunting array of options for swapping tokens or earning yield, with interfaces that can be unintuitive for newcomers. This complexity has created a significant barrier to entry. AI is now being introduced as a new layer to simplify this experience. By integrating artificial intelligence, the goal is to translate human language into machine-executable commands on the blockchain. The <a href=\"https://terminal.edwin.finance/\">edwin terminal</a> is designed to be this bridge, giving users a conversational way to manage their investments through intelligent agents.</p><h3>A New Gateway for the Next Wave of Users</h3><p>The <a href=\"https://terminal.edwin.finance/\">edwin AI terminal</a> provides a user interface that connects to various DeFi applications through a chat window. After a user connects their existing web wallet, they can begin typing commands in natural language to a smart AI agent. This agent then interprets these commands to access a wide range of on-chain protocols for trading, lending, or generating yield. The process is designed to remove the multiple, often confusing steps typically required to perform such actions, replacing them with a single instruction.</p><p>This approach is tailored for both beginner and intermediate users who understand the basic premise of DeFi but are often deterred by the intricate user experience. A key aspect of the design is that users retain full control over their digital assets. The AI agent acts as an intermediary that can only execute actions based on direct and explicit user commands. This is a crucial distinction in an industry where security and ownership are paramount. This model is often referred to as \"non-custodial,\" meaning the user, and only the user, holds the cryptographic keys to their funds. <a href=\"https://edwin.finance/\">edwin</a> does not take possession of user assets at any point.</p><p>Liran Markin, the Chief Executive Officer of <a href=\"https://edwin.finance/\">edwin</a>, articulated the vision behind the launch. \"We believe that DeFi should be as easy as chatting,\" Markin stated. \"The new edwin terminal is our way of making onchain finance finally accessible to the average user. It’s secure, powerful, and highly intuitive.\" This sentiment points to a broader industry challenge. Research indicates that a significant number of new users, approximately 65 percent, abandon decentralized applications after their first interaction. This high rate of disengagement is largely attributed to poor onboarding experiences and confusing interfaces, which has stalled mainstream adoption of DeFi.</p><h3>The Technology Behind the Conversation</h3><p>To function, the terminal's AI agent utilizes a combination of technologies. It integrates LangChain, a framework for developing applications powered by language models, and Anthropic, an AI safety and research company. These are coupled with edwin’s proprietary MCP tooling, which is specifically designed for executing DeFi transactions. This technological stack allows the AI to understand user requests and interact with a curated list of established DeFi services. It aggregates fundamental financial activities like trading, lending, and yield farming into one unified interface.</p><p>Gal Wiernik, the Chief Technology Officer at edwin, explained the technical goal. \"We’ve built this terminal for the next wave of crypto users,\" Wiernik said. \"It combines wallet security, AI reasoning, and real DeFi tools, all from your browser.\" The intention is to abstract away the complexity without sacrificing functionality. Instead of needing to visit multiple websites, understand different user interfaces, and manually connect a wallet to each one, a user could theoretically ask the edwin agent to find the best yield for a specific asset, and the agent would then present and execute the optimal strategy upon approval.</p><p>The core value proposition is the simplification of a fragmented and often intimidating ecosystem. By creating a single point of interaction that speaks a user's language, the terminal aims to empower individuals to explore financial opportunities across different blockchains, a concept known as omnichain, with greater clarity. The AI is not just a chatbot, but an execution tool that leverages large language models to reason and act on financial instructions within the secure environment of the user's own wallet.</p><p>The launch of the edwin AI terminal represents a logical and perhaps necessary evolution in the DeFi space. The technology's core promise has always been one of democratization, yet its practical application has been anything but democratic. The user experience has been the single greatest impediment to widespread adoption. While early adopters were willing to tolerate clunky interfaces and a high degree of technical knowledge, the next hundred million users will not.</p><p>Edwin's approach of using a conversational AI interface is a compelling solution. It leans into a user behavior that is already universal: chatting. If the execution is as seamless as the concept, it could significantly lower the barrier to entry. The non-custodial design is critical; without it, the product would be a non-starter for the security-conscious crypto community. The true test will be in the AI's reliability and the breadth of its integrations. Can it truly understand the nuances of a user's intent and execute transactions flawlessly and optimally across a wide range of protocols? The potential for error, misunderstanding, or exploitation in an AI-mediated financial transaction must be infinitesimally small.</p><p>Ultimately, the success of edwin and similar platforms will depend on building trust. Users must trust not only the security of the underlying code but also the reasoning capabilities of the AI. The company's challenge will be to prove its robustness and safety over time. If it succeeds, the concept of a DeFi \"agent\" could become the standard, moving the industry away from manual clicks and toward goal-oriented instructions. This is a meaningful step toward fulfilling DeFi's original mission of creating a more open and accessible financial system. The journey is far from over, but this is a significant development to watch.</p><p>:::tip\n<strong><em>Vested Interest Disclosure:</em></strong><em>This author is an independent contributor publishing via our&nbsp;. HackerNoon has reviewed the report for quality, but the claims herein belong to the author. #DYO</em></p>","contentLength":7020,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CareerBuilder + Monster, Which Once Dominated Online Job Boards, File For Bankruptcy","url":"https://slashdot.org/story/25/06/26/1356207/careerbuilder--monster-which-once-dominated-online-job-boards-file-for-bankruptcy?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1750948800,"author":"msmash","guid":279,"unread":true,"content":"CareerBuilder + Monster, which once dominated the online recruitment industry, filed for Chapter 11 bankruptcy protection this week and said it plans to sell its businesses. From a report: Created through the September merger of CareerBuilder and Monster, the Chicago-based company said it agreed to sell its job board operations, its most recognizable business, to JobGet, which has an app for so-called gig workers.","contentLength":417,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Oracle Linux 10 Reaches GA, Available With Unbreakable Enterprise Kernel 8.1","url":"https://www.phoronix.com/news/Oracle-Linux-10-GA","date":1750948747,"author":"Michael Larabel","guid":718,"unread":true,"content":"<article>Building off the release of Red Hat Enterprise Linux 10 (RHEL 10.0) just over one month ago, Oracle today announced the general availability of Oracle Linux 10.0...</article>","contentLength":164,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Jeff Bezos is reportedly courting Trump after public spat with Musk","url":"https://techcrunch.com/2025/06/26/jeff-bezos-is-reportedly-courting-trump-after-public-spat-with-musk/","date":1750948521,"author":"Sean O'Kane","guid":142,"unread":true,"content":"<article>Bezos allegedly sees an opening for his space company, Blue Origin, now that Musk has been diminished in the eyes of the president.</article>","contentLength":131,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"People use AI for companionship much less than we’re led to believe","url":"https://techcrunch.com/2025/06/26/people-use-ai-for-companionship-much-less-than-were-led-to-believe/","date":1750947688,"author":"Ram Iyer","guid":141,"unread":true,"content":"<article>A report by Anthropic reveals that people rarely seek companionship from AI, and turn to AI for emotional support or advice only 2.9% of the time. </article>","contentLength":147,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"YouTube adds an AI Overviews-like search results carousel","url":"https://techcrunch.com/2025/06/26/youtube-adds-an-ai-overviews-like-search-results-carousel/","date":1750946918,"author":"Aisha Malik","guid":140,"unread":true,"content":"<article>YouTube is rolling out new AI-powered features to help users find content and information more easily, the company announced on Thursday. </article>","contentLength":138,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"5 Ways to Automate Security and Compliance in a Cloud-First World","url":"https://hackernoon.com/5-ways-to-automate-security-and-compliance-in-a-cloud-first-world?source=rss","date":1750946774,"author":"","guid":188,"unread":true,"content":"<article>Most breaches happen due to delayed response. This article outlines 5 essential ways to automate security and compliance to protect your business continuously.</article>","contentLength":159,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Violinist Who Fell in Love With Machine Learning","url":"https://spectrum.ieee.org/violinist-to-software-engineer","date":1750946404,"author":"Edd Gent","guid":173,"unread":true,"content":"<p>Those with nontechnical backgrounds can succeed in software</p>","contentLength":59,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy82MTEwNjI1NS9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTgxMTE5NDgxOH0.CRr1Ii2b4e1LshGhO8SZqQBKhjyqTfDKxiuBJfamzJo/image.png?width=600","enclosureMime":"","commentsUrl":null},{"title":"Meet Pepe Dollar: DeFi Integration and Institutional Appeal","url":"https://hackernoon.com/meet-pepe-dollar-defi-integration-and-institutional-appeal?source=rss","date":1750946403,"author":"Flash PR","guid":187,"unread":true,"content":"<p>Ethereum (ETH) remains the backbone of the decentralized finance revolution, hosting everything from lending protocols to NFTs. Yet, the network faces a fundamental challenge—token inflation and scalability—impacting the potential for meme coins to gain serious institutional traction. </p><p>Enter , a Layer-2 meme coin designed to solve these issues with a fixed supply and real DeFi utilities, offering what even Ethereum struggles to provide.</p><h2>The Inflation Problem Ethereum and Meme Coins Face</h2><p>Ethereum’s growing ecosystem has brought explosive innovation but also growing pains. Native ETH inflation, coupled with meme coins like Pepecoin (PEPE) having uncapped supplies, dilutes value and raises concerns among institutional investors who prioritize economic discipline and long-term stability.</p><p> directly addresses this by imposing a fixed max supply of 3.695 billion tokens—mirroring a satirical critique of the $36.95 trillion US debt. This hard cap makes PEPD a deflationary asset, appealing to institutions wary of inflationary risk prevalent in both ETH and most meme coins, including Pepecoin (PEPE).</p><h2>DeFi Integration and Institutional Appeal</h2><p>Beyond tokenomics,  integrates real DeFi functionality and payment solutions:</p><ul><li>Staking and Yield: Token holders can stake PEPD for rewards, aligning incentives with ecosystem growth and investor returns.</li><li>PayFi Payments: Combining decentralized finance with user-friendly payment infrastructure, Pepe Dollar enables real-world, censorship-resistant transactions.</li><li>On-Chain Governance: Institutions favor projects where governance is transparent and community-driven, and PEPD’s roadmap includes voting mechanisms empowering holders.</li></ul><p>These utilities set Pepe Dollar apart from meme coins like Pepecoin (PEPE), which remain largely speculative without layered financial products.</p><h2>Layer-2 Scaling and Cross-Chain Readiness</h2><p>Ethereum’s congestion and gas fees are notable barriers for institutional adoption.  operates as a Layer-2 payment infrastructure, drastically lowering transaction costs and improving speed—critical factors for high-volume trading and institutional participation.</p><p>Additionally,  is designed for cross-chain expansion across EVM-compatible chains such as Arbitrum and Polygon, enhancing liquidity and accessibility in a multi-chain DeFi landscape.</p><p>Why Institutions Are Eyeing Pepe Dollar Over Pepecoin and Ethereum</p><ul><li>Fixed Supply vs. Inflation: Institutions prize predictable supply economics. PEPD’s capped supply contrasts with Ethereum’s native inflation and Pepecoin’s (PEPE) uncapped tokens.</li><li>Real Use Cases vs. Hype: Pepe Dollar combines meme culture with payment infrastructure and DeFi tools, making it a practical asset rather than just a viral token.</li><li>Community &amp; Transparency: Robust tokenomics and audited contracts elevate trust, crucial for institutional capital.</li></ul><h2>Get Involved with Pepe Dollar Today</h2><p>Investors seeking exposure to the future of meme-driven institutional DeFi should act now. The  is open, offering early access and rewards. Joining the official website and Telegram community ensures timely information on ecosystem developments.</p>","contentLength":3121,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Salesforce CEO Says 30% of Internal Work Is Being Handled by AI","url":"https://slashdot.org/story/25/06/26/1316242/salesforce-ceo-says-30-of-internal-work-is-being-handled-by-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1750946400,"author":"msmash","guid":278,"unread":true,"content":"Salesforce chief executive Marc Benioff said Thursday his company has automated a significant chunk of work with AI, another example of a firm touting labor-replacing potential of the emerging technology. From a report: \"AI is doing 30% to 50% of the work at Salesforce now,\" Benioff said in an interview, pointing at job functions including software engineering and customer service. \n\n[...] Salesforce has said that use of AI internally has allowed it to hire fewer people. The San Francisco-based software company is focused on selling an AI product that promises to handle tasks such as customer service without human supervision. Benioff said that tool has reached about 93% accuracy, including for large customers such as Walt Disney.","contentLength":740,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Jon McNeill brings the operator’s playbook to TechCrunch All Stage","url":"https://techcrunch.com/2025/06/26/jon-mcneill-brings-the-operators-playbook-to-techcrunch-all-stage/","date":1750946400,"author":"TechCrunch Events","guid":139,"unread":true,"content":"<article>At TechCrunch All Stage 2025, Jon McNeill, CEO and co-founder of DVx Ventures, will take the Scale Stage to flip the script on conventional startup growth advice.</article>","contentLength":162,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI Improves at Improving Itself Using an Evolutionary Trick","url":"https://spectrum.ieee.org/evolutionary-ai-coding-agents","date":1750942803,"author":"Matthew Hutson","guid":172,"unread":true,"content":"<p>Researchers use evolutionary algorithms to enhance AI coding skills</p>","contentLength":67,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy82MTA5ODI3OC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc4NTc2MzU3NH0.vGFSx4mspqLVTKLAyJIpHbXbsXx1MeIkCl8Bk2qfEnE/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"Fannie Mae, Freddie Mac Ordered To Consider Crypto As an Asset When Buying Mortgages","url":"https://slashdot.org/story/25/06/26/0048249/fannie-mae-freddie-mac-ordered-to-consider-crypto-as-an-asset-when-buying-mortgages?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1750942800,"author":"BeauHD","guid":277,"unread":true,"content":"An anonymous reader quotes a report from the Associated Press: The head of the federal government agency that oversees Fannie Mae and Freddie Mac wants the mortgage giants to consider accepting a homebuyer's cryptocurrency holdings in their criteria for buying mortgages from banks. William Pulte, director of the Federal Housing Finance Agency, which oversees Fannie and Freddie, ordered the agencies Wednesday to prepare a proposal for consideration of crypto as an asset for reserves when they assess risks in single-family home loans.\n \nPulte also instructed the agencies that their mortgage risk assessments should not require cryptocurrency assets to be converted to U.S. dollars. And only crypto assets that \"can be evidenced and stored on a U.S.-regulated centralized exchange subject to all applicable laws\" are to be considered by the agencies in their proposal, Pulte wrote in a written order, effective immediately. Pulte was sworn in as the head of FHFA in March. Public records show that as of January 2025, Pulte's spouse owned between $500,000 and $1 million of bitcoin and a similar amount of Solana's SOL token. [...]\n \nThe policy change is meant to encourage banks to expand how they gauge borrowers' creditworthiness, in hopes that more aspiring homebuyers can qualify for a home loan. It also recognizes that cryptocurrencies have grown in popularity as an alternative to traditional investments, such as bonds and stocks. The agencies have to come up with their proposals \"as soon as reasonably practical,\" according to the order. \"This is a big win for advocates of cryptocurrencies who want crypto to be treated the same way as other assets are,\" said Daryl Fairweather, chief economist at Redfin.\n \nCurrently, stock investments are treated as qualifying assets that count toward reserves that banks want borrowers to have. But assets that are more volatile, like individual stocks or crypto, may be discounted by lenders, Fairweather noted. \"As long as lenders are appropriately discounting crypto based on volatility, it's fine that crypto investments count toward reserves,\" she said.\n \nDanielle Hale, chief economist at Realtor.com, added: \"If Fannie and Freddie are going to accept cryptocurrency as collateral, that's a strong incentive for banks to shift their practices. Because people who might otherwise have to sell cryptocurrency to qualify -- and maybe that's a deal-breaker for them now -- under this new policy, they can qualify. It sort of expands the potential pool of eligible buyers.\"","contentLength":2527,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Firefox 141 Beta Lowering RAM Use On Linux But Still Benchmarking Behind Chrome","url":"https://www.phoronix.com/review/firefox-141-linux-ram","date":1750941691,"author":"Michael Larabel","guid":717,"unread":true,"content":"<article>Following this week's release of Firefox 140, Firefox 141 was promoted to beta. Most exciting for Linux users with next month's Firefox 141 release is finally lowering system RAM use! I've been running some benchmarks looking at the impact.</article>","contentLength":240,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Superconducting Motor Could Propel Electric Aircraft","url":"https://spectrum.ieee.org/electric-aircraft-motor-hinetics","date":1750939203,"author":"Glenn Zorpette","guid":171,"unread":true,"content":"<p>Prototype unit from startup Hinetics uses a high-temperature superconductor</p>","contentLength":75,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy82MTA5MDc1OS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc4NDM2ODY5Nn0.jSv_WVuS4E1S5V0iq1xXRsMDALvP4U3fksuBmU_awlY/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"Ubuntu 25.10 Snapshot 2 Released","url":"https://www.phoronix.com/news/Ubuntu-25.10-Snapshot-2","date":1750938432,"author":"Michael Larabel","guid":716,"unread":true,"content":"<article>Last month Canonical announced plans for releasing monthly Ubuntu Linux development snapshots and was followed by the Questing Snapshot 1 release in the road toward Ubuntu 25.10. Out today is the Questing Snapshot 2 release for incorporating the latest Ubuntu 25.10 development changes...</article>","contentLength":288,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"An AI Agent That Interprets Papers So You Don’t Have To: Full Build Guide","url":"https://hackernoon.com/an-ai-agent-that-interprets-papers-so-you-dont-have-to-full-build-guide?source=rss","date":1750938325,"author":"Superlinked","guid":186,"unread":true,"content":"<blockquote><p>Learn how to build an AI agent for Research Paper Retrieval, Search, and Summarization</p></blockquote><p><em>For researchers, staying updated with the latest findings is akin to finding a needle in a haystack. Imagine an AI-powered assistant that not only retrieves the most relevant papers but also summarizes key insights and answers your specific questions, all in real-time.</em></p><p><strong><em>This article delves into constructing such an AI research agent using Superlinked's complex document embedding capabilities. By integrating semantic and temporal relevance, we eliminate the need for complex reranking, ensuring efficient and accurate retrieval of information.</em></strong></p><p>Build a real-time AI research agent using Superlinked's vector search. It skips complex RAG pipelines by embedding and querying documents directly—making research faster, simpler, and smarter.</p><p><em>(Want to jump straight to the code? <strong>Check out the open source on GitHub .</strong> Ready to try semantic search for your own agentic use case? )</em></p><p>This article shows how to build an agent system using a Kernel agent to handle queries. If you want to follow along and run the code in-browser, </p><p>Where to start building a research assistant system?</p><p>Traditionally, building such a system involves complexity and considerable resource investment. Search systems typically retrieve an initial broad set of documents based on relevance and subsequently apply a secondary reranking process to refine and reorder results. While reranking enhances accuracy, it significantly increases computational complexity, latency, and overhead due to the extensive data retrieval initially required. Superlinked addresses this complexity by combining structured numeric and categorical embeddings with semantic text embeddings, providing comprehensive multimodal vectors. This method significantly enhances search accuracy by preserving attribute-specific information within each embedding.</p><h2>Build an agentic system with Superlinked</h2><p>This AI agent can do three main things:</p><ol><li>Find Papers: Search for research papers by topic (e.g. “quantum computing”) and then rank them by relevance and recency.</li><li>Summarize papers: Condense the retrieved papers into bite-sized insights.</li><li>Answer questions: Extract answers directly from the specific research papers based on targeted user queries.</li></ol><p>Superlinked eliminates the need for re-ranking methods as it improves the vector search relevance. Superlinked's RecencySpace will be used which specifically encodes temporal metadata, prioritizing recent documents during retrieval, and eliminating the need for computationally expensive reranking. For example, if two papers have the same relevance - the one that is most recent will rank higher.</p><p>To make things easier and more modular, I created an Abstract Tool class. This will simplify the process of building and adding tools</p><pre><code>import pandas as pd\nimport superlinked.framework as sl\nfrom datetime import timedelta\nfrom sentence_transformers import SentenceTransformer\nfrom openai import OpenAI\nimport os\nfrom abc import ABC, abstractmethod\nfrom typing import Any, Optional, Dict\nfrom tqdm import tqdm\nfrom google.colab import userdata\n\n# Abstract Tool Class\nclass Tool(ABC):\n    @abstractmethod\n    def name(self) -&gt; str:\n        pass\n\n    @abstractmethod\n    def description(self) -&gt; str:\n        pass\n\n    @abstractmethod\n    def use(self, *args, **kwargs) -&gt; Any:\n        pass\n\n\n# Get API key from Google Colab secrets\ntry:\n    api_key = userdata.get('OPENAI_API_KEY')\nexcept KeyError:\n    raise ValueError(\"OPENAI_API_KEY not found in user secrets. Please add it using Tools &gt; User secrets.\")\n\n# Initialize OpenAI Client\napi_key = os.environ.get(\"OPENAI_API_KEY\", \"your-openai-key\")  # Replace with your OpenAI API key\nif not api_key:\n    raise ValueError(\"Please set the OPENAI_API_KEY environment variable.\")\n\nclient = OpenAI(api_key=api_key)\nmodel = \"gpt-4\"\n</code></pre><h3>Step 2 : Understanding the Dataset</h3><p>This example uses a dataset containing approximately 10,000 AI research papers available on <a href=\"https://www.kaggle.com/datasets/yasirabdaali/arxivorg-ai-research-papers-dataset\">Kaggle</a>. To make it easy, simply run the cell below, and it will automatically download the dataset to your working directory. You may also use your own data sources, such as research papers or other academic content. If you decide to do so, all you need to do is adjust the schema design slightly and update the column names.</p><pre><code>import pandas as pd\n\n!wget --no-check-certificate 'https://drive.google.com/uc?export=download&amp;id=1FCR3TW5yLjGhEmm-Uclw0_5PWVEaLk1j' -O arxiv_ai_data.csv\n</code></pre><p>\\\nFor now, to make things run a bit quicker, we will use a smaller subset of the papers just to speed things up but feel free to try the example using the full dataset. An important technical detail here is that the timestamps from the dataset will be converted from string timestamps (like '1993-08-01 00:00:00+00:00') into pandas datetime objects. This conversion is necessary because it allows us to perform date/time operations.</p><pre><code>df = pd.read_csv('arxiv_ai_data.csv').head(100)\n\n# Convert to datetime but keep it as datetime (more readable and usable)\ndf['published'] = pd.to_datetime(df['published'])\n\n# Ensure summary is a string\ndf['summary'] = df['summary'].astype(str)\n\n# Add 'text' column for similarity search\ndf['text'] = df['title'] + \" \" + df['summary']\n</code></pre><pre><code>Debug: Columns in original DataFrame: ['authors', 'categories', 'comment', 'doi', 'entry_id', 'journal_ref' 'pdf_url', 'primary_category', 'published', 'summary', 'title', 'updated']\n</code></pre><h3>Understanding the Dataset Columns</h3><p>Below is a brief overview of the key columns in our dataset, which will be important in the upcoming steps:</p><ol><li>: The publication date of the research paper.</li><li>: The abstract of the paper, providing a concise overview.</li><li>: The unique identifier for each paper from arXiv.</li></ol><p>For this demonstration, we specifically focus on four columns: , , , and . To optimize retrieval quality, the title and summary are combined into a single, comprehensive text column, which forms the core of our embedding and search process.</p><p>A Note on Superlinked’s In-Memory Indexer : Superlinked’s in-memory indexing stores our dataset directly in RAM, making retrieval exceptionally fast which is ideal for real-time searches and rapid prototyping. For this proof-of-concept with 1,000 research papers, leveraging an in-memory approach significantly enhances query performance, eliminating delays associated with disk access.</p><h3>Step 3 : Defining the Superlinked Schema</h3><p>To move ahead, there is a need for schema to map our data. We have set up  with key fields:</p><pre><code>lass PaperSchema(sl.Schema):\n    text: sl.String\n    published: sl.Timestamp  # This will handle datetime objects properly\n    entry_id: sl.IdField\n    title: sl.String\n    summary: sl.String\n\npaper = PaperSchema()\n</code></pre><h3>Defining Superlinked Spaces for Effective Retrieval</h3><p>An essential step in organizing and effectively querying our dataset involves defining two specialized vector spaces: TextSimilaritySpace and RecencySpace.</p><p>The  is designed to encode textual information—such as the titles and abstracts of research papers into vectors. By converting text into embeddings, this space significantly enhances the ease and accuracy of semantic searches. It is optimized specifically to handle longer text sequences efficiently, enabling precise similarity comparisons across documents.</p><pre><code>text_space = sl.TextSimilaritySpace(\n    text=sl.chunk(paper.text, chunk_size=200, chunk_overlap=50),\n    model=\"sentence-transformers/all-mpnet-base-v2\"\n)\n</code></pre><p>The  captures temporal metadata, emphasizing the recency of research publications. By encoding timestamps, this space assigns greater significance to newer documents. As a result, retrieval results naturally balance content relevance with publication dates, favoring recent insights.</p><pre><code>recency_space = sl.RecencySpace(\n    timestamp=paper.published,\n    period_time_list=[\n        sl.PeriodTime(timedelta(days=365)),      # papers within 1 year\n        sl.PeriodTime(timedelta(days=2*365)),    # papers within 2 years\n        sl.PeriodTime(timedelta(days=3*365)),    # papers within 3 years\n    ],\n    negative_filter=-0.25\n)\n</code></pre><p>\\\nThink of RecencySpace as a time-based filter, similar to sorting your emails by date or viewing Instagram posts with the newest ones first. It helps answer the question, 'How fresh is this paper?'</p><ul><li>Smaller timedeltas (like 365 days) allow for more granular, yearly time-based rankings.</li><li>Larger timedeltas (like 1095 days) create broader time periods.</li></ul><p>The  penalizes very old papers. To explain it more clearly, consider the following example where two papers have identical content relevance, but their rankings will depend on their publication dates.</p><pre><code>Paper A: Published in 1996 \nPaper B: Published in 1993\n\nScoring example:\n- Text similarity score: Both papers get 0.8\n- Recency score:\n  - Paper A: Receives the full recency boost (1.0)\n  - Paper B: Gets penalized (-0.25 due to negative_filter)\n\nFinal combined scores:\n- Paper A: Higher final rank\n- Paper B: Lower final rank\n</code></pre><p>\\\nThese spaces are key to making the dataset more accessible and effective. They allow for both content-based and time-based searches, and really helpful in understanding the relevance and recency of research papers. This provides a powerful way to organize and search through the dataset based on both the content and the publication time.</p><h3>Step 4 : Building the index</h3><p>Next, the spaces are fused into an index which is the search engine's core:</p><p><code>paper_index = sl.Index([text_space, recency_space])</code></p><p>Then the DataFrame is mapped to the schema and loaded in batches (10 papers at a time) into an in-memory store:</p><pre><code># Parser to map DataFrame columns to schema fields\nparser = sl.DataFrameParser(\n    paper,\n    mapping={\n        paper.entry_id: \"entry_id\",\n        paper.published: \"published\",\n        paper.text: \"text\",\n        paper.title: \"title\",\n        paper.summary: \"summary\",\n    }\n)\n\n# Set up in-memory source and executor\nsource = sl.InMemorySource(paper, parser=parser)\nexecutor = sl.InMemoryExecutor(sources=[source], indices=[paper_index])\napp = executor.run()\n\n# Load the DataFrame with a progress bar using batches\nbatch_size = 10\ndata_batches = [df[i:i + batch_size] for i in range(0, len(df), batch_size)]\nfor batch in tqdm(data_batches, total=len(data_batches), desc=\"Loading Data into Source\"):\n    source.put([batch])\n</code></pre><p>\\\nThe in-memory executor is why Superlinked shines here—1,000 papers fit snugly in RAM, and queries fly without disk I/O bottlenecks.</p><h3>Step 5 : Crafting the query</h3><p>Next is the query creation. This is where the template for crafting queries is created. To manage this, we need a query template that can balance both relevance and recency. Here’s what that would look like:</p><pre><code># Define the query\nknowledgebase_query = (\n    sl.Query(\n        paper_index,\n        weights={\n            text_space: sl.Param(\"relevance_weight\"),\n            recency_space: sl.Param(\"recency_weight\"),\n        }\n    )\n    .find(paper)\n    .similar(text_space, sl.Param(\"search_query\"))\n    .select(paper.entry_id, paper.published, paper.text, paper.title, paper.summary)\n    .limit(sl.Param(\"limit\"))\n)\n</code></pre><p>\\\nThis allows us to pick whether to prioritize the content (relevance<em>weight) or the recency (recency</em>weight) - a very useful combo for our agent's needs.</p><p>Now comes the tooling part.</p><p>We will be creating three tools …</p><ol><li> : This tool is crafted by plugging into Superlinked’s index, letting it pull the top 5 papers based on a query. It balances relevance (1.0 weight) and recency (0.5 weight) to accomplish the “find papers” goal. What we want is to find the papers which are relevant to the query. So, if the query is: “What quantum computing papers were published between 1993 and 1994?”, then the retrieval tool will retrieve those papers, summarize them one by one, and return the results.</li></ol><pre><code>class RetrievalTool(Tool):\n    def __init__(self, df, app, knowledgebase_query, client, model):\n        self.df = df\n        self.app = app\n        self.knowledgebase_query = knowledgebase_query\n        self.client = client\n        self.model = model\n\n    def name(self) -&gt; str:\n        return \"RetrievalTool\"\n\n    def description(self) -&gt; str:\n        return \"Retrieves a list of relevant papers based on a query using Superlinked.\"\n\n    def use(self, query: str) -&gt; pd.DataFrame:\n        result = self.app.query(\n            self.knowledgebase_query,\n            relevance_weight=1.0,\n            recency_weight=0.5,\n            search_query=query,\n            limit=5\n        )\n        df_result = sl.PandasConverter.to_pandas(result)\n        # Ensure summary is a string\n        if 'summary' in df_result.columns:\n            df_result['summary'] = df_result['summary'].astype(str)\n        else:\n            print(\"Warning: 'summary' column not found in retrieved DataFrame.\")\n        return df_result\n</code></pre><p>\\\nNext up is the . This tool is designed for cases where a concise summary of a paper is needed. In order to use it, it will be provided with , which is the ID of the paper that needs to be summarized. If a  is not provided, the tool will not work as these IDs are a requirement in order to find the corresponding papers in the dataset.</p><pre><code>class SummarizationTool(Tool):\n    def __init__(self, df, client, model):\n        self.df = df\n        self.client = client\n        self.model = model\n\n    def name(self) -&gt; str:\n        return \"SummarizationTool\"\n\n    def description(self) -&gt; str:\n        return \"Generates a concise summary of specified papers using an LLM.\"\n\n    def use(self, query: str, paper_ids: list) -&gt; str:\n        papers = self.df[self.df['entry_id'].isin(paper_ids)]\n        if papers.empty:\n            return \"No papers found with the given IDs.\"\n        summaries = papers['summary'].tolist()\n        summary_str = \"\\n\\n\".join(summaries)\n        prompt = f\"\"\"\n        Summarize the following paper summaries:\\n\\n{summary_str}\\n\\nProvide a concise summary.\n        \"\"\"\n        response = self.client.chat.completions.create(\n            model=self.model,\n            messages=[{\"role\": \"user\", \"content\": prompt}],\n            temperature=0.7,\n            max_tokens=500\n        )\n        return response.choices[0].message.content.strip()\n</code></pre><p>\\\nFinally, we have the . This tool chains the  to fetch the relevant papers and then uses them to answer the questions. If no relevant papers are found to answer the questions, it will provide an answer based on general knowledge</p><pre><code>class QuestionAnsweringTool(Tool):\n    def __init__(self, retrieval_tool, client, model):\n        self.retrieval_tool = retrieval_tool\n        self.client = client\n        self.model = model\n\n    def name(self) -&gt; str:\n        return \"QuestionAnsweringTool\"\n\n    def description(self) -&gt; str:\n        return \"Answers questions about research topics using retrieved paper summaries or general knowledge if no specific context is available.\"\n\n    def use(self, query: str) -&gt; str:\n        df_result = self.retrieval_tool.use(query)\n        if 'summary' not in df_result.columns:\n            # Tag as a general question if summary is missing\n            prompt = f\"\"\"\n            You are a knowledgeable research assistant. This is a general question tagged as [GENERAL]. Answer based on your broad knowledge, not limited to specific paper summaries. If you don't know the answer, provide a brief explanation of why.\n\n            User's question: {query}\n            \"\"\"\n        else:\n            # Use paper summaries for specific context\n            contexts = df_result['summary'].tolist()\n            context_str = \"\\n\\n\".join(contexts)\n            prompt = f\"\"\"\n            You are a research assistant. Use the following paper summaries to answer the user's question. If you don't know the answer based on the summaries, say 'I don't know.'\n\n            Paper summaries:\n            {context_str}\n\n            User's question: {query}\n            \"\"\"\n        response = self.client.chat.completions.create(\n            model=self.model,\n            messages=[{\"role\": \"user\", \"content\": prompt}],\n            temperature=0.7,\n            max_tokens=500\n        )\n        return response.choices[0].message.content.strip()\n</code></pre><h3>Step 7 : Building the Kernel Agent</h3><p>Next is the Kernel Agent. It functions as the central controller, ensuring smooth and efficient operation. Acting as the core component of the system, the Kernel Agent coordinates communication by routing queries according to their intent when multiple agents operate concurrently. In single-agent systems, such as this one, the Kernel Agent directly uses the relevant tools to manage tasks effectively.</p><pre><code>class KernelAgent:\n    def __init__(self, retrieval_tool: RetrievalTool, summarization_tool: SummarizationTool, question_answering_tool: QuestionAnsweringTool, client, model):\n        self.retrieval_tool = retrieval_tool\n        self.summarization_tool = summarization_tool\n        self.question_answering_tool = question_answering_tool\n        self.client = client\n        self.model = model\n\n    def classify_query(self, query: str) -&gt; str:\n        prompt = f\"\"\"\n        Classify the following user prompt into one of the three categories:\n        - retrieval: The user wants to find a list of papers based on some criteria (e.g., 'Find papers on AI ethics from 2020').\n        - summarization: The user wants to summarize a list of papers (e.g., 'Summarize papers with entry_id 123, 456, 789').\n        - question_answering: The user wants to ask a question about research topics and get an answer (e.g., 'What is the latest development in AI ethics?').\n\n        User prompt: {query}\n\n        Respond with only the category name (retrieval, summarization, question_answering).\n        If unsure, respond with 'unknown'.\n        \"\"\"\n        response = self.client.chat.completions.create(\n            model=self.model,\n            messages=[{\"role\": \"user\", \"content\": prompt}],\n            temperature=0.7,\n            max_tokens=10\n        )\n        classification = response.choices[0].message.content.strip().lower()\n        print(f\"Query type: {classification}\")\n        return classification\n\n    def process_query(self, query: str, params: Optional[Dict] = None) -&gt; str:\n        query_type = self.classify_query(query)\n        if query_type == 'retrieval':\n            df_result = self.retrieval_tool.use(query)\n            response = \"Here are the top papers:\\n\"\n            for i, row in df_result.iterrows():\n                # Ensure summary is a string and handle empty cases\n                summary = str(row['summary']) if pd.notna(row['summary']) else \"\"\n                response += f\"{i+1}. {row['title']} \\nSummary: {summary[:200]}...\\n\\n\"\n            return response\n        elif query_type == 'summarization':\n            if not params or 'paper_ids' not in params:\n                return \"Error: Summarization query requires a 'paper_ids' parameter with a list of entry_ids.\"\n            return self.summarization_tool.use(query, params['paper_ids'])\n        elif query_type == 'question_answering':\n            return self.question_answering_tool.use(query)\n        else:\n            return \"Error: Unable to classify query as 'retrieval', 'summarization', or 'question_answering'.\"\n</code></pre><p>\\\nAt this stage, all components of the Research Agent System have been configured. The system can now be initialized by providing the Kernel Agent with the appropriate tools, after which the Research Agent System will be fully operational.</p><pre><code>retrieval_tool = RetrievalTool(df, app, knowledgebase_query, client, model)\nsummarization_tool = SummarizationTool(df, client, model)\nquestion_answering_tool = QuestionAnsweringTool(retrieval_tool, client, model)\n\n# Initialize KernelAgent\nkernel_agent = KernelAgent(retrieval_tool, summarization_tool, question_answering_tool, client, model)\n</code></pre><p>\\\nNow let's test the system..</p><p><code># Test query print(kernel_agent.process_query(\"Find papers on quantum computing in last 10 years\"))</code></p><p>Running this activates the . It will fetch the relevant papers based on both relevance and recency, and return the relevant columns. If the returned result includes the summary column (indicating the papers were retrieved from the dataset), it will use those summaries and return them to us.</p><pre><code>Query type: retrieval\nHere are the top papers:\n1. Quantum Computing and Phase Transitions in Combinatorial Search \nSummary: We introduce an algorithm for combinatorial search on quantum computers that\nis capable of significantly concentrating amplitude into solutions for some NP\nsearch problems, on average. This is done by...\n\n1. The Road to Quantum Artificial Intelligence \nSummary: This paper overviews the basic principles and recent advances in the emerging\nfield of Quantum Computation (QC), highlighting its potential application to\nArtificial Intelligence (AI). The paper provi...\n\n1. Solving Highly Constrained Search Problems with Quantum Computers \nSummary: A previously developed quantum search algorithm for solving 1-SAT problems in\na single step is generalized to apply to a range of highly constrained k-SAT\nproblems. We identify a bound on the number o...\n\n1. The model of quantum evolution \nSummary: This paper has been withdrawn by the author due to extremely unscientific\nerrors....\n\n1. Artificial and Biological Intelligence \nSummary: This article considers evidence from physical and biological sciences to show\nmachines are deficient compared to biological systems at incorporating\nintelligence. Machines fall short on two counts: fi...\n</code></pre><p>\\\nLet's try one more query, this time, let's do a summarization one..</p><p><code>print(kernel_agent.process_query(\"Summarize this paper\", params={\"paper_ids\": [\"http://arxiv.org/abs/cs/9311101v1\"]}))</code></p><pre><code>Query type: summarization\nThis paper discusses the challenges of learning logic programs that contain the cut predicate (!). Traditional learning methods cannot handle clauses with cut because it has a procedural meaning. The proposed approach is to first generate a candidate base program that covers positive examples, and then make it consistent by inserting cut where needed. Learning programs with cut is difficult due to the need for intensional evaluation, and current induction techniques may need to be limited to purely declarative logic languages.\n</code></pre><p>\\\nI hope this example has been helpful for developing AI agents and agent-based systems. Much of the retrieval functionality demonstrated here was made possible by Superlinked, so please consider starring the <a href=\"https://hackernoon.com/links.superlinked.com/research_ai_agent_repo\">repository</a> for future reference when accurate retrieval capabilities are needed for your AI agents!</p><ul><li>Combining semantic and temporal relevance eliminates complex reranking while maintaining search accuracy for research papers.</li><li>Time-based penalties (negative_filter=-0.25) prioritize recent research when papers have similar content relevance.</li><li>Modular tool-based architecture allows specialized components to handle distinct tasks (retrieval, summarization, question-answering) while maintaining system cohesion.</li><li>Loading data in small batches (batch_size=10) with progress tracking improves system stability when processing large research datasets.</li><li>Adjustable query weights let users balance relevance (1.0) and recency (0.5) based on specific research needs.</li><li>The question-answering component gracefully degrades to general knowledge when paper-specific context is unavailable, preventing dead-end user experiences.</li></ul><p>Keeping up-to-date with the vast number of research papers published regularly can be challenging and time-consuming. An agentic AI assistant workflow capable of efficiently locating relevant research, summarizing key insights, and answering specific questions from these papers could significantly streamline this process.</p>","contentLength":23480,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Your Digital Self Is Not Your Own: How Moca Foundation's New Chain Plans to Give You Back Control","url":"https://hackernoon.com/your-digital-self-is-not-your-own-how-moca-foundations-new-chain-plans-to-give-you-back-control?source=rss","date":1750934620,"author":"Ishan Pandey","guid":185,"unread":true,"content":"<p>Is your online identity truly yours? Every click, every login, and every piece of data you generate across countless apps and platforms are collected and controlled by centralised entities. Now, the <a href=\"https://www.moca.foundation/\">Moca Foundation</a> is launching a direct challenge to this status quo with the announcement of Moca Chain, a new blockchain built from the ground up to restore ownership of your digital life to its rightful owner: you.</p><p>\\\nThe <a href=\"https://www.moca.foundation/\">Moca Foundation</a> unveiled its plans for a Layer 1 blockchain dedicated entirely to identity and user data. The Moca Chain, with its testnet and mainnet slated for launch in the third and fourth quarters of 2025 respectively, aims to create a new infrastructure where individuals, devices, and even AI agents can manage their digital credentials without relying on the corporate platforms that dominate the web today. This initiative is not just about privacy; it is about establishing a new paradigm for how user data is verified, shared, and valued in the digital economy.</p><p>\\\nThe core of the Moca Chain's design is to provide a secure and interoperable foundation for digital identity. It will function as a modular, EVM-compatible chain, which means it is designed to work seamlessly with the vast ecosystem of applications built on Ethereum and other compatible networks. At the heart of this new ecosystem will be the MOCA Coin, which will be used for all network activities, including transaction fees, staking by validators, and payments for data storage and verification services. This creates a self-sustaining economy around the management of digital identity.</p><h3>The Problem with a Centralized Digital World</h3><p>In the current web landscape, convenience often comes at the cost of control. Services like single sign-on (SSO), which allow you to use one account (like Google or Facebook) to log into multiple applications, have become ubiquitous. While they simplify the user experience, they also create a significant vulnerability. As Yat Siu, the co-founder and executive chairman of Animoca Brands, points out, this model has deep-seated flaws. \"Billions of users today go online using single sign-on (SSO), which contains the keys to a user’s data, services, and digital lives,\" Siu stated. \"While convenient, SSO represents a centralized point of failure that compromises security while also allowing operators to aggressively extract value from users’ digital selves.\"</p><p>\\\nThis centralization means that large technology companies hold the keys to our digital kingdoms. Our data is siloed within their \"walled gardens,\" where it is monetized for their benefit. This model not only exposes users to massive-scale data breaches but also prevents them from having a unified, portable identity that they can use across different services without compromising their privacy. The fragmentation of our digital identities across numerous platforms also makes it difficult to build a comprehensive and verifiable reputation that can be leveraged in various contexts, from professional networking to accessing financial services.</p><p>\\\nMoca Chain directly confronts this issue by proposing a decentralized alternative. \"Moca Chain seeks to solve this problem by giving users decentralized true ownership of their data, ensuring the sovereignty of users’ digital identity without a single point of failure,\" Siu explained. This vision aligns with the broader mission of Animoca Brands to champion digital property rights, empowering individuals to not only control their online activities and personal data but also to share more equitably in the value they generate.</p><h3>A New Infrastructure for Trust</h3><p>\\\nSo, how does Moca Chain propose to solve these complex issues? The project is building a multi-faceted infrastructure designed for what it calls \"self-sovereign identity.\" This concept revolves around the idea that individuals should have ultimate control over their own digital identities, just as they do with their physical identification documents. To achieve this, Moca Chain will allow both on-chain (data stored on a blockchain) and off-chain (data stored elsewhere) user data to be verified by any application on any blockchain. This is made possible through a combination of decentralized data storage, a cross-chain identity oracle, and advanced cryptographic methods.</p><p>\\\nOne of the key technologies Moca Chain will employ is web proof data generation, specifically through a method known as zkTLS. In simple terms, this allows for the verification of data from a web session without revealing the data itself, a powerful application of zero-knowledge proofs. For example, you could prove that you have a certain educational credential from a university's portal without actually sharing the certificate itself with a third-party application. This has profound implications for privacy across numerous industries, from healthcare, where patient data could be verified without being exposed, to finance, where know-your-customer (KYC) requirements could be met without sensitive documents being shared repeatedly.</p><p>\\\nThis technological stack will work in conjunction with the AIR Kit, a software development kit (SDK) from Moca Network, the identity ecosystem of Animoca Brands. The AIR Kit is already being integrated into a host of consumer applications, including those with massive user bases like SK Planet’s OK Cashbag, with its 28 million verified users, and One Football, which has over 200 million users. Kenneth Shek, the project lead of Moca Network, sees this as a pivotal move to disrupt the current model of data ownership. “Moca Chain and AIR Kit are a one-of-a-kind infrastructure for verified identity data to empower consumer apps and their users,\" Shek said. \"By adopting Moca Chain and MOCA Coin, we believe we can disrupt current models of data ownership and break down the dominance of walled garden ecosystems, returning value to the users who generate it and making ecosystem growth more scalable.”</p><p>\\\nThe launch of Moca Chain represents a significant and ambitious step toward solving one of the most persistent problems of the digital age: the ownership and control of our personal data. The vision articulated by the Moca Foundation and its partners at Animoca Brands is not merely a technological one, it is fundamentally about rebalancing power in the digital world. The idea of a user-centric identity layer that is both private and interoperable has been a long-held goal for many in the Web3 space, but the practical implementation has always been the primary hurdle.</p><p>\\\nWhat makes Moca Chain a particularly noteworthy project is its pragmatic approach to adoption. By integrating its AIR Kit into established Web2 platforms with hundreds of millions of users, it is building a bridge for mainstream adoption rather than expecting users to jump headfirst into a completely new and unfamiliar ecosystem. This strategy of meeting users where they are could be the key to achieving the network effects necessary for a new identity standard to take hold.</p><p>\\\nHowever, the path ahead will not be without its challenges. The project will need to navigate a complex regulatory landscape, particularly in sensitive areas like finance and healthcare. Furthermore, it will have to convince both developers and end-users that its solution is not only more secure and equitable but also just as convenient as the centralized systems they are accustomed to. The success of Moca Chain will ultimately depend on its ability to deliver a seamless user experience that makes the benefits of self-sovereign identity tangible to the average person. If it succeeds, it could indeed lay the groundwork for a more equitable and user-empowered internet.</p><p>\\\nDon’t forget to like and share the story!</p>","contentLength":7721,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AMD CPUID Faulting Support Looks To Be Coming For Linux 6.17","url":"https://www.phoronix.com/news/AMD-CPUID-Faulting-Linux-6.17","date":1750933833,"author":"Michael Larabel","guid":715,"unread":true,"content":"<article>As a follow-up to the article a few weeks ago about AMD enabling User CPUID Faulting support for Linux, that code looks like it's ready to go for being introduced in the upcoming Linux 6.17 kernel...</article>","contentLength":199,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Bochs DRM Panic Support, Panfrost Adds Mediatek MT8370 SoC For Linux 6.17","url":"https://www.phoronix.com/news/Linux-6.17-Bochs-Panic-MT8370","date":1750933080,"author":"Michael Larabel","guid":714,"unread":true,"content":"<article>Maxime Ripard at Red Hat sent out the latest weekly pull of \"drm-misc-next\" changes to DRM-Next for queuing of these kernel graphics/display driver changes ahead of the Linux 6.17 merge window opening up in about one month's time...</article>","contentLength":232,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"New Datacenter In Italy Captures Heat Waste","url":"https://hardware.slashdot.org/story/25/06/26/0032258/new-datacenter-in-italy-captures-heat-waste?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1750932000,"author":"BeauHD","guid":276,"unread":true,"content":"Italian utility A2A and French tech firm Qarnot have launched a data center in Brescia, Italy, that captures waste heat from servers and redirects it to a local district heating system. \"The Brescia project is expected to meet the heating needs of more than 1,350 apartments and cut carbon dioxide emissions by 3,500 tons annually -- equivalent to the absorption capacity of over 22,000 trees,\" reports Reuters. From the report: \"The rapid spread of data centers and the growing electrification of consumption require major investments in power grids. But data centers also offer a remarkable opportunity for cities with district heating networks,\" A2A CEO Renato Mazzoncini said at the inauguration. \"In (the Italian region of) Lombardy alone, with projects already in the pipeline, we estimate that 150,000 apartments could be heated this way,\" Mazzoncini added.","contentLength":864,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Blender 5.0 Introducing HDR Support On Linux With Vulkan + Wayland","url":"https://www.phoronix.com/news/Blender-5.0-HDR-Linux-Wayland","date":1750931706,"author":"Michael Larabel","guid":713,"unread":true,"content":"<article>The upcoming Blender 5.0 3D modeling software application is introducing High Dynamic Range (HDR) display support on Linux when making use of Wayland -- no X11 support for HDR -- and Vulkan graphics accelerator...</article>","contentLength":213,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Neo Pepe $NEOP Presale Passes $2M Raised With Stellar CertiK Audit","url":"https://hackernoon.com/neo-pepe-$neop-presale-passes-$2m-raised-with-stellar-certik-audit?source=rss","date":1750930971,"author":"Chainwire","guid":184,"unread":true,"content":"<p>Road Town, Tortola, June 25th, 2025/Chainwire/-- ($NEOP) has crossed past the $2 million milestone in record-breaking speed, propelling it toward Stage Four of its anticipated presale. Launching less than a week ago, the project’s early growth reflects strong interest, with investors rallying behind its revolutionary approach to decentralization, governance, and liquidity.</p><p>Within days, Neo Pepe has hit a notable $2 million raised and strong participation in the project’s presale.</p><p>This achievement not only underscores investor confidence but highlights the project's compelling narrative—a serious, thematic rebellion against traditional financial centralization, aptly branded as the Memetrix.</p><p>Neo Pepe Coin recently achieved a 71.96 score on its , validating its credibility as a legitimate and secure project.</p><p>Neo Pepe’s presale is meticulously structured across 16 dynamic stages, progressively increasing the token price to reward early supporters. Now, as it rapidly approaches Stage Four, the window to secure tokens at advantageous pricing is narrowing swiftly.</p><p>Further differentiating Neo Pepe Coin is its innovative 2.5% auto-liquidity mechanism. Each transaction enhances liquidity pools, with LP tokens permanently burned, creating sustained price stability and growth potential.</p><p>Complementing this powerful feature is a fully decentralized governance model, empowering token holders with real decision-making power on strategic listings and treasury allocations.</p><p>Neo Pepe Coin’s early performance has been marked by steady presale participation and a structured rollout strategy. With its ongoing stage-based pricing model, thematic framing, and auto-liquidity mechanics, $NEOP continues to progress through its planned presale phases.</p><p>With Stage Four approaching, Neo Pepe Coin continues through its presale schedule, supported by consistent participation and structured pricing mechanics. The project’s distinctive theme and token model remain central to its current phase of growth.</p><p>Users can secure a spot now and discover why Neo Pepe Coin is setting new standards in crypto innovation.</p><p>For more information, users can join the Neo Pepe community on socials or visit the official website today.</p><p> ($NEOP) is a decentralized cryptocurrency designed to challenge centralization, regulatory overreach, and market manipulation. Leveraging the thematic narrative of the Memetrix, Neo Pepe Coin symbolizes a bold movement towards financial democratization and innovation.</p><p>The project features a structured 16-stage presale, robust community-driven governance, and an auto-liquidity mechanism ensuring sustainable growth and stability.</p><p>To Get Started with $NEOP</p><p>:::tip\nThis story was published as a press release by Chainwire under HackerNoon’s Business Blogging&nbsp;.</p>","contentLength":2780,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Deadly Risks: 5 Crypto Entrepreneurs and Investors Who Paid the Ultimate Price","url":"https://hackernoon.com/deadly-risks-5-crypto-entrepreneurs-and-investors-who-paid-the-ultimate-price?source=rss","date":1750926976,"author":"Michael Jerlis","guid":183,"unread":true,"content":"<blockquote><p><strong>Crypto promises wealth and freedom. But sometimes, it costs people their lives…</strong></p><p><strong>These are five real stories where being involved in crypto wasn’t just financially risky — it was fatal. Not because of bad trades, but because of kidnappings, threats, and murder</strong></p></blockquote><p>Since 2018, there have been over 150 documented cases of crypto-related kidnappings, “wrench attacks,” and violent extortion attempts across North America, Europe, and Asia. In 2025 alone, 7 high-profile abductions were reported in France, including cases involving physical mutilation and ransom demands of up to €10 million.</p><p>Financially, the numbers tell an alarming story. In 2023, total crypto ransom payments reached , nearly double the $567 million paid the year before. In 2024, the figure dropped to $814 million, but still reflects a massive sum of money used to fund coercion, violence, and organized crime.</p><p>Let’s take a closer look at five high-profile tragedies that expose the deadly intersection of money, privacy, and risk in the crypto world.</p><h2><strong>Kidnapped and Killed for Bitcoin in Kyiv (July 2024)</strong></h2><p>In July 2024, news broke that a 29-year-old crypto investor had been kidnapped and murdered in Kyiv. According to BeInCrypto Russia, the victim was lured through social engineering — a fake meeting involving a car rental, where attackers posed as clients or partners. Once inside the vehicle, he was taken to an unknown location.</p><p>His captors demanded access to his crypto holdings — about 3 BTC. That’s not a fortune by crypto standards, but in Ukraine, it’s well above the average yearly salary. The attackers were prepared. When the victim refused to give up access to his wallet, he was killed.</p><p>The killers were arrested within a few days. But what stands out is the method: premeditated, organized, and directly targeting a crypto user. This wasn't a random mugging. It’s a reminder that once someone knows you're holding crypto, especially self-custodied assets, you're exposed — not digitally, but physically.</p><h2><strong>Murder of Antonio Vinicius Lopes Gritzbach (Brazil, November 2024)</strong></h2><p>Antonio Lopes Gritzbach was a Brazilian entrepreneur working with Bitcoin and reportedly linked to over-the-counter crypto operations. These kinds of OTC businesses are often used to convert large amounts of crypto into fiat discreetly. And in Brazil, the line between OTC and money laundering is often razor-thin.</p><p>According to The Guardian, Gritzbach had been cooperating with prosecutors on a high-profile money laundering case. His death wasn’t random. He was shot multiple times in broad daylight, near the Guarulhos International Airport in São Paulo. Surveillance footage showed a car slowly trailing him before someone opened fire.</p><p>Some local sources suggested Gritzbach had inside knowledge of crypto flows used by drug cartels and political interests. While these claims were never confirmed, it’s clear he wasn’t just an average Bitcoiner. His death shows the dangerous overlap between crypto and organized crime, especially in regions where the legal framework is still catching up.</p><h2><strong>Death of Nikolai Mushegian — DeFi Pioneer or Target? (Puerto Rico, October 2022)</strong></h2><p>Nikolai Mushegian was no stranger to crypto insiders. He co-founded , one of the biggest decentralized finance protocols. He also contributed to Balancer Labs and early stablecoin designs. A deeply technical person, Nikolai was also known for his paranoia — and for good reason.</p><p>In the months leading up to his death, Mushegian had been tweeting erratically about being followed, bugged, and targeted by intelligence agencies. The tweet that shocked everyone came just hours before his death: he claimed the CIA, Mossad, and others were running blackmail operations and were planning to torture him. A few hours later, he drowned near Condado Beach, Puerto Rico. No foul play was found — but the beach was known for strong rip currents, and he was a strong swimmer.</p><p>BeInCrypto and others covered the story, sparking endless speculation. Was it suicide? Was it paranoia turned real? Mushegian had been working on privacy-preserving tools and alternative financial systems — things that do challenge state power. Whether or not there’s more to the story, the crypto world lost one of its most brilliant and troubled minds.</p><h2><strong>Tiantian Kullander — Young Billionaire, Sudden Death (Hong Kong, November 2022)</strong></h2><p>Tiantian “TT” Kullander was just 30 years old when he passed away in his sleep, with no clear medical explanation. He co-founded , a major crypto trading and infrastructure company based in Hong Kong. Valued at over $3 billion at one point, the firm handled institutional trades, offered yield products, and had ties to major players like Temasek.</p><p>TT was also a former trader at Morgan Stanley and a rising star in global finance. His death shocked the industry. Changelly reported the cause as “unexpected” with no further details.</p><p>What spooked many wasn’t just the timing, but the pattern: his death followed the collapse of FTX by just days. Several other crypto executives died within the same 12-month window — including Nikolai Mushegian and Vyacheslav Taran. Online forums and Telegram groups exploded with theories, though no link has ever been confirmed.</p><p>This case shows how little we know about what happens at the top of crypto finance — where money moves at speed and under intense pressure. Whether TT died of natural causes or something more complex, it left a massive hole in one of Asia’s biggest Web3 firms.</p><h2><strong>The Stabbing of Bob Lee — Tech Icon with Crypto Ties (San Francisco, April 2023)</strong></h2><p>Bob Lee was a Silicon Valley legend. He helped build Android at Google, launched Square’s Cash App, and was an early backer of many startups. In recent years, he got deep into crypto, joining the MobileCoin project — a privacy-focused coin aimed at messaging apps like Signal.</p><p>In April 2023, Bob was stabbed to death in downtown San Francisco. The case made headlines because of who he was — not just a tech guy, but a powerful connector in both crypto and finance. Initial theories included robbery or a possible crypto deal gone wrong. But police later arrested a suspect known to Bob personally.</p><p>Even though the motive turned out to be personal, the crypto world didn’t ignore the context. BeInCrypto and others noted how the killing fueled wider concerns: if someone like Bob Lee isn’t safe, how safe is anyone building cutting-edge tech that challenges traditional systems?</p><h2><strong>How to Stay Safe in Crypto</strong></h2><p>Crypto puts you in control, but that control comes with visibility — and visibility attracts risk. Criminals, extortionists, even governments are watching the space more closely than ever. If you hold significant assets or work on high-profile projects, you need to think about your security the way a public figure or whistleblower would.</p><p>Don’t talk publicly about your holdings, not even in passing on Telegram or Twitter. Avoid connecting your real name to wallets or exchanges. Use aliases where possible, and treat your online identity as something separate from your real life. Store most of your assets in cold wallets, and never in one place. Use techniques like splitting keys or multisig to limit exposure. Backups should be offline, encrypted, and stored in more than one secure location.</p><p>Be cautious with who you meet in the crypto space. Some attacks have started with what looked like harmless business conversations. Assume your messages could be read and your devices compromised. Use end-to-end encrypted tools like Signal or Session, and stay alert in both physical and digital environments.</p><p>==Most importantly, remember this: blockchain isn’t anonymous==. Even if you’re operating legally, once you're in the public eye — as a developer, founder, or even a well-known trader — the risk of being targeted increases dramatically.</p><h2><strong>Is Crypto Worth the Risk?</strong></h2><p>The five stories mentioned earlier aren’t rare exceptions. They’re warning signs. In crypto, people have been extorted, abducted, and in some cases, killed — not because they ran scams, but simply because they were visible and valuable.</p><p>This space offers freedom, but that freedom comes with real-world threats. As crypto becomes more traceable and more mainstream, your personal security needs to evolve just as fast.</p>","contentLength":8292,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Offline-First JavaScript for Space Missions: How JS Thrives in Low-Connectivity Environments","url":"https://hackernoon.com/offline-first-javascript-for-space-missions-how-js-thrives-in-low-connectivity-environments?source=rss","date":1750926913,"author":"Raju Dandigam","guid":182,"unread":true,"content":"<p>Whenever we think about javascript we imagine websites, web applications, browser based games but javascript has quietly evolved beyond the web.Today, it's even orbiting our planet—and in some cases, headed to Mars. In environments where internet connectivity is a luxury, JavaScript is proving its worth as an offline-first language.</p><p>This article explores how JavaScript is used in space missions, the challenges it solves in remote environments, and how developers can draw inspiration from these high-stakes use cases to build more resilient apps.</p><p><strong>Now, let’s understand why offline-first is important in Space?</strong></p><p>There are Spacecraft, satellites, and interplanetary rovers operate in extreme conditions:</p><ul><li> (up to 40 minutes delay betweenEarth and Mars)</li><li><strong>Power and memory constraints</strong></li></ul><p>Now, any of the software running in these systems must be</p><ul><li><p>Resilient to connection drops</p></li><li><p>Capable of local decision-making</p></li><li><p>Able to sync data when possible</p><p>In such a scenario, JavaScript’s lightweight nature, ecosystem, and offline-capable design patterns make it surprisingly useful.</p><p>Let’s talk about some real use case of the space flow,</p><p><strong>Real Use Case: NASA's Open MCT</strong></p><p>One of the most prominent JavaScript-based tools in space exploration is<a href=\"https://github.com/nasa/openmct\"></a> (Mission Control Technologies), developed by NASA.</p><p>Now let’s understand what is that?</p></li><li><p>A web-based platform for mission planning, telemetry visualization, and data monitoring.</p></li><li><p>Built with JavaScript, HTML, and CSS.</p></li><li><p>Designed to work offline, allowing ground operators to continue monitoring spacecraft without internet access.</p></li><li><p>NASA's Ames Research Center</p></li><li><p>ESA (European Space Agency)</p></li><li><p>Commercial space startups</p><p>Its modular design allows teams to customize the interface and logic for specific missions—whether you're watching a Mars orbiter or a CubeSat in low Earth orbit.</p><p>Now, let’s understand why we are using JS in space?</p><p><strong>Why Use JavaScript in Space?</strong></p><p>We all have wondered why they chose JS instead of C/C++ in the tech space?</p></li></ul><ol><li><ul><li>Fast prototyping for dashboards and tooling.</li></ul></li><li><ul><li>Runs in browsers and Node.js environments.</li></ul></li><li><ul><li>Use existing libraries to handle logs, charts, caching, etc.</li></ul></li><li><ul><li>Service workers, IndexedDB, and localStorage**.**</li></ul><p>While low-level systems in spacecraft often use C or Ada, mission control tools, simulators, and dashboards are increasingly JS-powered.</p><p>Here is the quick comparison with C with JS:</p></li></ol><p>|  |  |  |\n|----|----|----|\n|  |  |  |\n|  |  | <strong>Slower, requires more setup</strong> |\n|  |  |  |\n|  |  |  |\n|  |  |  |</p><p>Can you tell me what techniques can be use in space?</p><p>So, there are many techniques they can use in space but we will mainly focus on 5 techniques.</p><h3>Offline-First JS Techniques for Space</h3><ol><li><p><strong>Service Workers for Caching</strong></p><p>Let’s understand what is that?</p><p>Service workers allow caching files and API responses for offline access.</p></li></ol><pre><code>self.addEventListener(\"fetch\", (event) =&gt; {\n  event.respondWith(\n    caches.match(event.request).then((response) =&gt; {\n      return response || fetch(event.request);\n    })\n  );\n});\n</code></pre><p>Perfect for telemetry dashboards where continuous internet isn’t guaranteed.</p><p>\\\nNow, let’s see how offline data logging is doing in JS.</p><ol start=\"2\"><li><p><strong>Intermittent Sync Strategies</strong></p><p>Hey What’s this Intermittent sync strategy?</p><p>let me explain to you about it so we all know that Space has very limited communication ways correct? Now in this case there are some strategies which can help here so that delta sync, data compression, and edge caching can reduce the time spent transferring data once a connection is re-established and it’s very crucial for high-latency environments like deep space.</p></li></ol><p><strong>3. Fault Tolerance and Redundancy</strong></p><pre><code>Space systems must anticipate failures. JavaScript applications can:\n</code></pre><ul><li>Use  for failed API calls.</li><li>Implement  to prevent system overloads.</li><li>Use  to maintain a record of all changes, allowing recovery after failures.</li></ul><p><strong>4. Data Prioritization and Compression</strong></p><p>Not all data is equally important. JS systems can prioritize critical telemetry and compress non-essential data to ensure the most important information reaches mission control.</p><pre><code>// Example: Compressing JSON data before sending\nconst data = { status: 'OK', battery: '85%', signal: 'strong' };\nconst compressed = JSON.stringify(data).replace(/\\s+/g, '');\n</code></pre><p>This approach minimizes data size, reducing transmission costs and time.</p><p>When bandwidth is limited, not all data is equal. Systems tag and queue data by priority:</p><ul><li><p>Life-support &gt; scientific readings &gt; diagnostics</p></li><li><p>High-priority packets are synced first</p><h2><strong>Javascript on Edge Devices in Space</strong></h2><p>In Space missions often include sensors or edge devices with low computing power. Surprisingly, JS fits here too:</p></li><li><p><strong>Node.js on Raspberry Pi Zero</strong> (used in CubeSats)</p></li><li><p><strong>JavaScript runtimes on microcontrollers</strong> (e.g., Espruino, Moddable)</p></li><li><p>Buffering telemetry for future sync</p><p> A Raspberry Pi in a weather balloon logs atmospheric data with a Node.js app, stores readings in IndexedDB, and dumps to SD card for later analysis.</p><p><strong>Lessons Earth Developers Can Learn</strong></p><p>Offline-first JS isn't just for space—it benefits any environment with unreliable internet:</p></li><li><p>Games with offline progress tracking</p></li></ul><blockquote><p>If it works on Mars, it'll work anywhere.</p><ul><li>Progressive Web Apps (PWAs)</li><li>Caching and sync patterns</li></ul></blockquote><pre><code>These ideas improve reliability, performance, and UX—whether you're in orbit or on a bus\n</code></pre><p>The development of JavaScript from web page scripting to space mission technology represents an impressive transformation. The language demonstrates its growth and adaptability through this development. The study of JS operations in space enables us to develop applications that handle unpredictable conditions while delivering user satisfaction and creating a more resilient web and beyond.</p>","contentLength":5558,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Educational Byte: How to Buy Crypto for the First Time","url":"https://hackernoon.com/educational-byte-how-to-buy-crypto-for-the-first-time?source=rss","date":1750926875,"author":"Obyte","guid":181,"unread":true,"content":"<p>New to crypto? Want to know what the fuss is about? Well, it’s easier than you think. If you barely know a thing about the industry, buying cryptocurrency for the first time might feel a bit like learning a new language or stepping into a sci-fi movie, but don’t worry, you’re not alone. In fact, over 400 million people around the world now own crypto, and that number keeps growing.</p><p><strong>Crypto is digital money that doesn’t need banks or governments and works 24/7 from a simple app on your device (desktop, mobile, or other hardware).</strong> You can send it worldwide, without limits, and, depending on the decentralization level of the coin involved, no one, not even your government, can stop your transactions or seize your funds. Let’s see some other things you should know to start.</p><p>Before you buy your first crypto, there are a few things you need to consider. Not to scare you, but to help you avoid headaches later. First off, yes,  in most countries, and yes, it’s real money with real market value. People all over the world use it for trading, sending money abroad, and even saving. But it’s not like putting cash under your mattress or buying a stock and forgetting about it. Depending on the coin, prices can jump or crash in hours. You should never invest more than you’re willing to lose.</p><p>And please, don’t just trust anyone who talks a good game. Your favorite influencer? They might be getting paid to promote something shady. That random message on Telegram promising a 200% return? Probably . Even friends can get tricked and drag you into it without meaning to. If something sounds too good to be true, it probably is. Always double-check, read reviews, and compare sources.</p><p><strong>Also, think about why you’re doing this. Are you curious? Want to invest a bit? Planning to send money abroad? Different goals might lead you to different coins.</strong> Bitcoin, Ethereum, , stablecoins, , DeFi tokens —they all work differently and offer different things.&nbsp;</p><p>Bitcoin and stablecoins mainly work for payments (stablecoins being more, well, stable in price). Ethereum and Obyte have smart contracts and other advanced features. Privacy tokens like Monero or  will obscure your transactions. DeFi tokens may help you make . It's really up to you, so do your research on the project you’re interested in first.</p><h2>Buying Crypto for the First Time</h2><p>After you do your own research (), you’ll only need your phone or device of choice, pen and paper, Internet, and an email. Your ID may be required too, if you choose the easiest way to buy (through regulated companies). Overall, here are some simple steps to get started:\\</p><ul><li><p><strong>Choose your first crypto:</strong> This decision must be based on what you want to use it for, and not just what’s trending. Want to send money? Any crypto will do, especially stablecoins. Curious about Dapps? Look into Ethereum or Obyte. It’s also advisable to start small. \\n </p></li><li><p><strong>Pick a trustworthy and/or regulated crypto exchange:</strong> If you only have fiat money (USD, EUR, etc.), you’ll need to visit a crypto exchange. They’re websites, mostly beginner-friendly, where you can create an account with an email and password, and start buying crypto with fiat. They may ask for your real ID, but again, that depends on the volume you want to handle. Popular exchanges include Binance, Coinbase, and Biconomy.</p></li></ul><p>As a side note: yes, you can also buy crypto directly from someone else. No need for middlemen. However, if you pick this option, be sure to select someone reliable. Crypto transactions can’t be reversed. Buying crypto physically from strangers, using cash, could be <a href=\"https://hackernoon.com/all-your-crypto-can-be-stolen-with-a-wrench-its-happened-multiple-times\">particularly dangerous</a>.</p><ul><li><strong>Make the purchase and store it safely</strong>: crypto exchanges may work as wallets, but they’re not wallets at all. While your money is there, it’s still controlled by the exchange, and if it goes under, so does your money. The best option is to select a  (under your full control), install it on your device of choice, and write down your private keys physically. Then, move most of your crypto funds to this wallet, and leave little or nothing in the exchange.</li></ul><p>The Obyte wallet has an easy option for learners: “,” available in the “Receive” menu. This button leads to a beginner-friendly website where it’s possible to  (Obyte’s native currency) and other Obyte-compatible tokens with ether (ETH), USD Coin (USDC) or Wrapped Bitcoin (WBTC). All of them can be acquired with fiat in popular crypto exchanges.</p><p>\\ In case you only have fiat and you want to carry out the process from a single place, GBYTE is listed on the crypto exchange Biconomy against Tether (USDT).** Biconomy has  to buy stablecoins like USDT with payment methods like debit and credit cards, Banxa, Apple Pay, and Alchemy Pay. Once you’ve bought some USDT, you can exchange it for GBYTE on the same platform. Afterward, remember that those GBYTEs are on the Polygon network, so, if you want to use them in Obyte, you’ll need to import them through the .</p><p>There’s another option as well: . This exchange doesn’t handle fiat, but it doesn’t ask for ID verification (KYC) either. They have the trading pairs GBYTE/BTC and GBYTE/USDT available. This is likely not the most beginner-friendly alternative, but if you’re concerned about your privacy, it may be the best path.&nbsp;</p><p><em>Featured Vector Image by storyset / </em></p>","contentLength":5316,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI in Fundraising Hits Ethical Speed Bump, New Report Finds","url":"https://hackernoon.com/ai-in-fundraising-hits-ethical-speed-bump-new-report-finds?source=rss","date":1750924506,"author":"Eli Grid","guid":180,"unread":true,"content":"<h2>Inside the Findings: Ethics Over Efficiency</h2><p>A new report jointly released by the Chartered Institute of Fundraising (CIOF) and the University of York’s Centre for Digital Innovation in Philanthropy and Fundraising (CDIPF) has spotlighted a major hesitation in the adoption of AI among UK fundraisers. The core reason? Ethical unease.</p><p>The research surveyed 78 organizations and conducted in-depth interviews with 21 fundraising professionals. While participants acknowledged that AI could streamline operations and enhance engagement, many remained wary of its risks — particularly around , transparency, and tool reliability.</p><p>Dr. Marta Herrero, the report’s lead researcher and Director at CDIPF, emphasized the gap between technical potential and emotional readiness. “AI-driven technology is capable of offering novel and compelling possibilities for charitable fundraising,” she said. “However, first we need to build trust among fundraising professionals.”</p><p>Herrero stressed the importance of fundraisers understanding both the benefits and limitations of AI. Beyond technical training, she said, the profession needs cultural readiness — confidence in using the tools responsibly and ethically.</p><p>The report was formally launched at the CIOF’s annual Fundraising Convention, under the theme <em>Shaping the Future of Fundraising with AI</em>.</p><p>Ceri Edwards, executive director of engagement at CIOF, reinforced the message: “As AI technologies become increasingly accessible, they offer unparalleled opportunities for our sector — however, we must navigate these advancements carefully.”</p><p>She added that ethical clarity and donor trust must remain at the center of AI integration efforts.</p><p>This study adds to a growing body of global concern around the unchecked use of AI in sensitive sectors. For fundraisers, whose work is built on human connection and trust, the path to AI adoption may require more than just <strong>innovation — it needs ethical</strong> alignment.</p><h2>What’s at Stake for the Nonprofit Sector</h2><p>Unlike in commercial marketing, where rapid adoption of AI can offer immediate ROI, nonprofits face a different calculation. Here, missteps come with reputational risk. A botched AI rollout that mishandles donor data or personalizes outreach poorly could backfire, harming both donations and community trust.</p><p>Imagine a donor receiving an automated message suggesting a gift based on income data they never consented to share — the loss of goodwill could outweigh any automation gain.</p><p>At the same time, fundraising teams are increasingly resource-constrained. AI offers efficiency: chatbots to triage queries, models to prioritize donor outreach, even predictive tools to forecast campaign performance. But until ethical concerns are addressed head-on, those benefits may remain out of reach.</p><p>“We want fundraisers to feel confident about using AI,” said Dr. Herrero, “feeling that they understand what it can do well, the challenges it poses, and — most importantly — that they trust in their own abilities to identify how they can use the tools responsibly for the benefit of the communities and donors they serve.”</p><p>That balance of empowerment and ethical literacy may be the missing piece in the sector’s cautious approach.</p><h3>Where It Could Go From Here</h3><p>Fundraising won’t escape AI — but it may humanize it first. Unlike sales-driven sectors, nonprofits are demanding trust by design, not as an afterthought. Expect to see hybrid models emerge, where AI supports but never replaces human judgment. The organizations that get this balance right could not only raise more, but also raise better.</p><p>Should nonprofits slow down AI adoption until ethical frameworks are stronger — or risk falling behind? Tell us what you think.</p>","contentLength":3739,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI Agents Can Now Pay Autonomously Thanks to x402 and HTTP 402","url":"https://hackernoon.com/ai-agents-can-now-pay-autonomously-thanks-to-x402-and-http-402?source=rss","date":1750924332,"author":"Stefano Amorelli","guid":179,"unread":true,"content":"<p>The specification introduces  : previously, every single HTTP request required a fresh TCP connection. Persistent connections resolve this, allowing multiple HTTP requests to flow through a single, long-lived TCP connection. No more establishing separate connections for every image, CSS file, or JavaScript snippet on a web page.</p><p>There's also <strong>chunked transfer encoding</strong> , a new way for web servers to stream content without knowing the full size beforehand. No longer does a server need to calculate the total size of dynamically generated content upfront, it's now free to deliver data incrementally, as it's produced.</p><p>But <strong>RFC 2068 quietly introduces something intriguing</strong> , a new status code:</p><pre><code>HTTP 402 Payment Required\nThis code is reserved for future use.\n</code></pre><p>This shows how the founding fathers of world wide web predicted how money would eventually become a big part of internet, <strong>even if they had no clear path on how it would actually play out</strong>.</p><p>Today, 2025, nearly three decades and multiple HTTP versions later ( in 2015,  in 2022), <strong>still sits there with the exact same note: 'reserved for future use.'</strong> Despite the fintech revolution, the rise of online payments, and an entire economy built on internet transactions, nobody had figured out what to do with it.</p><p>Last month (May 2025), <a href=\"https://www.coinbase.com/developer-platform/discover/launches/x402?utm_source=blog.amorelli.tech\">Coinbase</a> released , an open source protocol that gives  its first real job: enabling native  payments within HTTP requests.</p><p>Nowadays AI agents need to make  (machine-to-machine) payments across the web with reduced  (human-in-the-loop) interventions, but traditional payment flows dont work well in this case. They require multiple human interactions, redirects, and manual steps that simply don't work when an AI agent needs to make a transaction autonomously.</p><p> fills this gap. It proposes an automated on-chain payment flow implemented natively within the HTTP protocol, <strong>making them as seamless as any other web request</strong>.</p><p>But what does this look like in practice?</p><p> is built around four core components:</p><p>A  acts as the payment initiator, discovering what's required for access and constructing the appropriate payment payload. Put simply, this is whatever is making the HTTP request to a pay-walled resource. It could be a browser making a request for premium content, an AI agent purchasing API access, or a mobile app unlocking features. The client handles the cryptographic signing using the user's private key and automatically retries requests when payment is required.</p><p>The  enforces payment policies for its endpoints while remaining focused on its core business logic. This is the web server or API that hosts the content or service being purchased. It maintains simple pricing tables that map endpoints to costs, but delegates the payment verification logic to the facilitator.</p><p>Blockchain logic is implemented in the  component: verifying cryptographic signatures, preventing replay attacks through nonce tracking, and managing the actual on-chain settlement. It allows both clients and servers to work with on-chain payments without understanding the blockchain implementation details.</p><p>On  resides the final settlement layer, ensuring payments are immutable and transparent. It enables programmable money through smart contracts and stable-coins, <strong>but its complexity is completely hidden from the application layer by the facilitator</strong>.</p><ul><li>Primary Responsibility: Payment initiation</li><li>Key Features:EIP-712 signing, automatic retries, payment discovery</li><li>What it does: Makes requests, handles wallets, retries with payment</li></ul><ul><li>Primary Responsibility: Payment enforcement</li><li>Key Features: Pricing tables, HTTP 402 responses, middleware integration</li><li>What it does: Sets prices, checks payments, serves content</li></ul><ul><li>Primary Responsibility: Payment verification</li><li>Key Features: Signature verification, nonce tracking, gas abstraction</li><li>What it does: Verifies signatures, talks to blockchain</li></ul><ul><li>Primary Responsibility: Payment settlement</li><li>Key Features:USDC transfers, smart contracts, immutable records</li><li>What it does: Settles payments on chain</li></ul><p>This architecture demonstrates several fundamental software engineering principles. The most important is . Each component has a single, well-defined responsibility. <strong>Resource servers focus purely on business logic, facilitators handle payment complexity, and clients manage user interaction</strong>.</p><p>The system achieves  by having components interact only through standardized HTTP and REST interfaces. <strong>A resource server doesn't need to understand how blockchain transactions work, and a client doesn't need to know the server's internal implementation</strong>. This isolation means you can swap out components (for example, use a different blockchain, change facilitator providers, or modify server logic) without affecting the rest of the system.</p><p>The facilitator embodies the <strong>single responsibility principle</strong> by isolating all blockchain complexity into one specialized service. This prevents payment logic from leaking into business applications and keeps concerns properly separated.</p><p>Last but not least this architecture follows . High-level components depend on abstractions rather than concrete implementations. Servers and clients depend on HTTP interfaces, not specific blockchain APIs. This allows the same application code to work across different blockchains and payment schemes without modification.</p><p>When an AI agent or user hits an -enabled API, here's the four-step flow that happens:</p><ol><li> : The client makes a standard HTTP request to access some resource</li><li><strong>Payment required response</strong> : If no payment is attached, the server responds with  and includes payment details</li><li> : The client creates a cryptographically signed payment and retries the request</li><li> : The server validates the payment, broadcasts it to the blockchain, and grants access</li></ol><p>What makes this powerful is that it all happens at the HTTP protocol level. No redirects to third-party payment processors, no  flows, no account creation. <strong>Just standard HTTP with extra headers:</strong></p><ul><li> flows from client to server and contains the . This includes the payment details (amount, recipient, token) plus a cryptographic signature proving the client authorized the payment.</li><li> flows from server to client after successful payment and contains <strong>transaction receipt information</strong> , providing transparency about what happened on-chain.</li></ul><h2>Server-side implementation</h2><h3>Payment middleware architecture</h3><p>The core server-side implementation revolves around a payment filter (AKA middle-ware) that intercepts HTTP requests and enforces payment requirements. When integrated into your web server, this middle-ware checks incoming requests against a price table that maps endpoints to their costs.</p><p>The middle-ware follows a simple decision tree: if a request hits a protected endpoint without payment, it responds with  and detailed payment instructions. If payment is included in the  header, it verifies the payment with a facilitator service before allowing the request to proceed.</p><p>Here's the essential structure from the Java implementation:</p><pre><code>public class PaymentFilter implements Filter {\n    private final String payTo;\n    private final Map&lt;String, BigInteger&gt; priceTable; // path → amount\n    private final FacilitatorClient facilitator;\n\n    public void doFilter(ServletRequest request, ServletResponse response, \n                        FilterChain chain) throws IOException, ServletException {\n        String path = req.getRequestURI();\n        String paymentHeader = req.getHeader(\"X-PAYMENT\");\n\n        if (!priceTable.containsKey(path)) {\n            chain.doFilter(request, response);  // Free endpoint\n            return;\n        }\n\n        if (paymentHeader == null) {\n            send402Response(resp, path);  // Request payment\n            return;\n        }\n\n        // Verify payment, process request, then settle\n        VerificationResponse verification = facilitator.verify(paymentHeader, requirements);\n        if (verification.valid) {\n            chain.doFilter(request, response);\n            facilitator.settle(paymentHeader, requirements);\n        }\n    }\n}\n</code></pre><p><strong>The beauty of this approach is that it requires minimal changes to existing applications.</strong> You simply add the payment filter to your middle-ware stack and define which endpoints require payment.</p><h3> Response</h3><p>When a client hits a protected endpoint without payment, the server constructs a detailed payment requirements object. This includes the payment amount, accepted tokens (like ), the receiving wallet address, blockchain network, and an expiration time to prevent replay attacks.</p><pre><code>private void send402Response(HttpServletResponse response, String path) throws IOException {\n    response.setStatus(HttpStatus.PAYMENT_REQUIRED);\n    response.setContentType(\"application/json\");\n\n    PaymentRequirements requirements = PaymentRequirements.builder()\n        .paymentRequirement(List.of(\n            PaymentRequirement.builder()\n                .kind(new Kind(\"exact\", \"base-sepolia\"))             // Payment scheme + blockchain network\n                .receiver(payTo)                                     // Wallet address to receive payment\n                .amount(priceTable.get(path))                        // Cost for this specific endpoint\n                .asset(\"&lt;USDC_TOKEN_CONTRACT&gt;\")                      // USDC token contract\n                .expiry(Instant.now().plus(Duration.ofMinutes(5)))   // Payment window\n                .nonce(UUID.randomUUID().toString())                 // One-time use identifier\n                .build()\n        ))\n        .build();\n\n    response.getWriter().write(Json.MAPPER.writeValueAsString(requirements));\n}\n</code></pre><p>Each field in the  is described as follows:</p><ul><li>: Defines the payment scheme ( for fixed amounts) and target blockchain network ( for Base testnet). This tells the client exactly how to structure and execute the payment.</li><li>: The wallet address where payment should be sent. This is your business wallet that will receive the funds.</li><li>: The cost for accessing this specific endpoint, retrieved from your price table. For USDC, this is typically expressed in  (smallest unit).</li><li>: The smart contract address of the token to be used for payment. The example shows USDC on Base Sepolia testnet.</li><li>: A timestamp after which this payment requirement becomes invalid. This prevents old payment requests from being reused and adds security against replay attacks.</li><li>: A unique identifier (UUID) that ensures each payment requirement can only be fulfilled once, even if the same client makes multiple requests to the same endpoint.</li></ul><h2>Client-side implementation</h2><h3>Automatic payment handling</h3><p>Client libraries wrap standard HTTP clients to automatically handle 402 responses. When a client receives a payment requirement, (1) it constructs a payment payload, (2) signs it with the user's private key, and (3) retries the original request with the payment attached.</p><pre><code>public HttpResponse&lt;String&gt; makeRequest(String url, String method) throws Exception {\n    HttpRequest request = HttpRequest.newBuilder()\n        .uri(URI.create(url))\n        .method(method, HttpRequest.BodyPublishers.noBody())\n        .build();\n\n    HttpResponse&lt;String&gt; response = httpClient.send(request, \n        HttpResponse.BodyHandlers.ofString());\n\n    // Handle 402 Payment Required\n    if (response.statusCode() == 402) {\n        PaymentRequirements requirements = Json.MAPPER.readValue(\n            response.body(), PaymentRequirements.class);\n\n        // Create payment payload matching the requirements\n        PaymentPayload payment = PaymentPayload.builder()\n            .receiver(requirements.getPaymentRequirement().get(0).getReceiver())\n            .amount(requirements.getPaymentRequirement().get(0).getAmount())\n            .asset(requirements.getPaymentRequirement().get(0).getAsset())\n            .nonce(requirements.getPaymentRequirement().get(0).getNonce())\n            .expiry(requirements.getPaymentRequirement().get(0).getExpiry())\n            .build();\n\n        // Sign using EIP-712 structured data signing\n        String signature = signer.sign(payment.toSigningMap());\n\n        // Retry with payment header\n        String paymentHeader = encodePaymentHeader(payment, signature);\n        HttpRequest paidRequest = HttpRequest.newBuilder()\n            .uri(URI.create(url))\n            .method(method, HttpRequest.BodyPublishers.noBody())\n            .header(\"X-PAYMENT\", paymentHeader)\n            .build();\n\n        return httpClient.send(paidRequest, HttpResponse.BodyHandlers.ofString());\n    }\n\n    return response;\n}\n</code></pre><p>The signing process uses the  standard, which creates a structured, human-readable representation of the payment data before hashing and signing it. This ensures the payment is cryptographically secure and tied to the specific request.</p><h2>Payment verification flow</h2><p>The facilitator service is where the blockchain complexity lives, abstracting it away from both clients and servers. When a server receives a payment, it forwards the payment payload to the facilitator for verification.</p><pre><code>public class HttpFacilitatorClient implements FacilitatorClient {\n    private final HttpClient http;\n    private final String baseUrl;\n\n    @Override\n    public VerificationResponse verify(String paymentHeader, PaymentRequirements requirements) \n        throws Exception {\n\n        // Construct verification request with payment and requirements\n        VerifyRequest body = VerifyRequest.builder()\n            .paymentHeader(paymentHeader)     // The X-PAYMENT header from client\n            .requirements(requirements)       // What the server expects\n            .build();\n\n        HttpRequest request = HttpRequest.newBuilder()\n            .uri(URI.create(baseUrl + \"/verify\"))\n            .POST(HttpRequest.BodyPublishers.ofString(Json.MAPPER.writeValueAsString(body)))\n            .header(\"Content-Type\", \"application/json\")\n            .build();\n\n        String json = http.send(request, HttpResponse.BodyHandlers.ofString()).body();\n        return Json.MAPPER.readValue(json, VerificationResponse.class);\n    }\n\n    @Override\n    public SettlementResponse settle(String paymentHeader, PaymentRequirements requirements) \n        throws Exception {\n\n        // Settlement happens after successful verification\n        SettleRequest body = SettleRequest.builder()\n            .paymentHeader(paymentHeader)\n            .requirements(requirements)\n            .build();\n\n        HttpRequest request = HttpRequest.newBuilder()\n            .uri(URI.create(baseUrl + \"/settle\"))\n            .POST(HttpRequest.BodyPublishers.ofString(Json.MAPPER.writeValueAsString(body)))\n            .header(\"Content-Type\", \"application/json\")\n            .build();\n\n        String json = http.send(request, HttpResponse.BodyHandlers.ofString()).body();\n        return Json.MAPPER.readValue(json, SettlementResponse.class);\n    }\n}\n</code></pre><p>The facilitator checks several things:</p><ul><li>Does the payment amount match the requirements?</li><li>Has this payment been used before?</li><li>Is the payment still within its expiration window?</li></ul><p>If verification passes, the facilitator also handles settlement by broadcasting the transaction to the blockchain of choice. The  interface defines the contract that any facilitator client must implement:</p><pre><code>public interface FacilitatorClient {\n    VerificationResponse verify(String paymentHeader, PaymentRequirements requirements);\n    SettlementResponse settle(String paymentHeader, PaymentRequirements requirements);\n}\n</code></pre><p>Your application needs to provide a concrete implementation of this interface.</p><p>Now that we've seen the individual components (payment filters, facilitator integration, and client handling) let's look at how these pieces come together in a real application. Here's a minimal  example that demonstrates the complete flow.</p><p>First, create a  annotation:</p><pre><code>@Target(ElementType.METHOD)\n@Retention(RetentionPolicy.RUNTIME)\npublic @interface PaymentRequired {\n    String price();\n    String currency() default \"USDC\";\n    String network() default \"base-sepolia\";\n}\n</code></pre><p>Then modify the  to scan for these annotations at startup:</p><pre><code>@Component\npublic class PaymentFilter implements Filter {\n    private final Map&lt;String, BigInteger&gt; priceTable;\n    private final String payTo;\n    private final FacilitatorClient facilitator;\n\n    public PaymentFilter(ApplicationContext context, String payTo, FacilitatorClient facilitator) {\n        this.payTo = payTo;\n        this.facilitator = facilitator;\n        this.priceTable = buildPriceTableFromAnnotations(context);\n    }\n\n    private Map&lt;String, BigInteger&gt; buildPriceTableFromAnnotations(ApplicationContext context) {\n        Map&lt;String, BigInteger&gt; prices = new HashMap&lt;&gt;();\n\n        // Scan all @RestController beans for @PaymentRequired annotations\n        Map&lt;String, Object&gt; controllers = context.getBeansWithAnnotation(RestController.class);\n\n        for (Object controller : controllers.values()) {\n            Method[] methods = controller.getClass().getMethods();\n            for (Method method : methods) {\n                PaymentRequired payment = method.getAnnotation(PaymentRequired.class);\n                if (payment != null) {\n                    String path = extractPathFromMapping(method);\n                    BigInteger amount = new BigInteger(payment.price().replace(\".\", \"\"));\n                    prices.put(path, amount);\n                }\n            }\n        }\n        return prices;\n    }\n}\n</code></pre><p>Now you can annotate your controller methods directly:</p><pre><code>@RestController\npublic class WeatherController {\n\n    @GetMapping(\"/weather\")\n    @PaymentRequired(price = \"0.001\", currency = \"USDC\", network = \"base-sepolia\")\n    public WeatherData getWeather(@RequestParam String city) {\n        // Your existing business logic\n        return weatherService.getWeatherForCity(city);\n    }\n\n    @GetMapping(\"/premium-forecast\")\n    @PaymentRequired(price = \"0.01\", currency = \"USDC\", network = \"base-sepolia\")\n    public ExtendedForecast getPremiumForecast(@RequestParam String city) {\n        return weatherService.getExtendedForecast(city);\n    }\n}\n\n@Configuration\npublic class PaymentConfig {\n\n    @Bean\n    public PaymentFilter paymentFilter(ApplicationContext context) {\n        return new PaymentFilter(\n            context,\n            \"&lt;WALLET_ADDRESS&gt;\", // Your wallet address\n            new HttpFacilitatorClient(\"&lt;FACILITATOR_URL&gt;\")\n        );\n    }\n\n    @Bean\n    public FilterRegistrationBean&lt;PaymentFilter&gt; paymentFilterRegistration(PaymentFilter filter) {\n        FilterRegistrationBean&lt;PaymentFilter&gt; registration = new FilterRegistrationBean&lt;&gt;();\n        registration.setFilter(filter);\n        registration.addUrlPatterns(\"/*\");\n        registration.setOrder(1);\n        return registration;\n    }\n}\n</code></pre><p>The  annotation handles pricing configuration declaratively, while the  automatically discovers these annotations at startup and builds the price table. Your existing business logic in the controller methods remains completely unchanged. The configuration wires everything together by registering the payment filter and connecting it to a facilitator service. Once deployed, requests to  cost 0.001 USDC and  costs 0.01 USDC, with all payment handling happening transparently at the HTTP layer.</p><h2>Security and production considerations</h2><p> is simple and elegant, it hides complexity. This is a pro and a con. It makes integration easy, but it also hides an important aspect: <strong>putting AI agents in charge of money creates new attack vectors</strong>.</p><p>While  signatures and nonce management handle replay attacks, what happens when an agent gets compromised? Traditional fraud detection relies on human behavioral patterns, but <strong>AI agents don't follow human spending habits</strong>. A compromised agent could drain funds faster than any human fraudster.</p><p>The facilitator component becomes another high-value target since it's verifying signatures and managing nonces. Unlike traditional payment processors that can reverse transactions, <strong>blockchain settlements are final</strong>.</p><p>Since  is based on on-chain transactions, it inherits the operational risks of blockchain transactions. Gas fees fluctuate wildly, sometimes making micropayments economically inconvenient. Network congestion can delay transactions. What's an AI agent supposed to do when it needs real-time data but the payment is stuck in a mempool?</p><p>Another important aspect is regulation. Compliance varies across jurisdictions with different rules about automated payments, cryptocurrency usage, and data retention. An AI agent making a large volume of micro-transactions across borders might trigger AML alerts or violate local regulations without anyone realizing it.</p><p>What's interesting about  is the timing. AI agents need autonomous payment capabilities, stablecoins provide a programmable money layer, and blockchain infrastructure has matured enough to handle scalable applications. These pieces haven't aligned before. Internet now needs a new form of payments, and traditional flows weren't built for autonomous agents or micropayments.</p><p> is compelling thanks to its pragmatic approach. Instead of reinventing payments from scratch, it extends existing HTTP infrastructure. Instead of requiring new integrations, it works with standard patterns that we already understand.</p><p>The security and operational challenges are real, but they're engineering problems with possible solutions.</p><p>After nearly three decades,  might finally do what it was designed for: make paying for things on the internet as simple as requesting them.</p><p><strong>The foundation is set. Now it's time to build.</strong></p><h2>Resources and Further Reading</h2>","contentLength":21339,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Invisible Filters in Power BI? Here's the Deep Fix That Worked","url":"https://hackernoon.com/invisible-filters-in-power-bi-heres-the-deep-fix-that-worked?source=rss","date":1750924159,"author":"Grigory Koftaylov","guid":178,"unread":true,"content":"<p>Long story short, once I found that a report I had previously created showed strange data. I can’t show you real visuals as they contain data I can’t disclose, so they are just blank in the article or are mocked. Please, imagine you are expecting to see a few hundred thousand but seeing only hundreds.</p><p>\\\nAll visible slicers were not set up, but the numbers were too low. Thankfully, the Filters feature helps us understand what filters are applied to the visual:</p><p>The second filter is legitimate, so there is no problem there. But another one showed one value of the “National name” field. This filtration was applied to all visuals on the page. The is such a slicer on the page, however, it was not set up (it showed All), and the Filters pane showed this filter — so slicers have nothing to do with it. To prove this point, I removed all visuals from the list except the table — the filter was still applied.</p><p>All suggestions I found while surfing the internet led to checking hidden slicers, which I had already done. It seems to me like a bug or glitch, which appeared somehow while I was editing other pages and the data model.</p><p>One option is to rebuild the whole page from scratch or at least copy and paste all visuals onto a new page and set them up. However, there were many tricky interaction relationships between them, and this approach would require manual setup and is time-consuming. It would be a problem since there were four dozen visuals, and recreating the correct relationships would be a nightmare. Roughly 1500 clicks would be needed to change the size of visuals and their locations to be able to click on an interaction icon, and then return everything to its place. No, thanks. If there’s a chance to avoid that, I’ll take it.</p><p>Attempts to delete or rename either the value or field did not help.</p><p>So the only way left is to edit the internal files of the report.</p><p>Well, here we come to the main point of the article. There are two parts. The first part will tell you how to get to internal files and a few things about their structure, if you never edit them probably you should read it first. The second part will provide the final short solution that worked well for me, so if you have some experience you can just jump to it.</p><p>I suggest making a copy of your report to work with in case something goes wrong. If you work in the standard Windows Explorer, you might need to turn on “Show file extensions” in its settings.</p><p>Rename the file, changing .pbix to .zip, and agree with the warning.</p><p>Extract the files and go to the resulting folder.</p><p>Here you can see the files in which Power BI stores all report data. For an explanation of these files, refer to this<a href=\"https://www.fourmoo.com/2017/05/02/what-makes-up-a-power-bi-desktop-pbix-file/\">&nbsp;article</a>.</p><p>The file we are looking for is in the Report folder and is called Layout. You can use any app you prefer to navigate and edit it. Standard MS Notepad lacks advanced features, so I prefer Notepad++ for editing text files. It has syntax highlighting and different plugins. For working with JSON, I used JSONTools. If you know exactly what and where to edit, you might use just Notepad, but for the first time, it makes sense to use advanced tools.</p><p>This is how it looks in plain text view. To improve readability, use the “Pretty-print current JSON file” function of the JSONTools plugin.</p><p>If your file is well-structured but lacks syntax highlighting, you can add it by selecting Language -&gt; JSON.</p><p>Now it looks clearer, however, some of the values contain strings of JSON, so instead of a full tree, we see only one block.</p><p>To see all data in a tree view, replace some symbols. Warning! The following actions will break the initial structure of the file and make it unusable for reassembling the Power BI report. Use this only for learning and investigation.</p><ul></ul><p>It might be helpful to create a Macro in Notepad++ and save these actions for future use.</p><p>After replacing, use the “Pretty-print current JSON file” of the JSONTools plugin again.</p><p>Now it looks much better, and we can use it for exploration. For easier navigation, you can open the JSON Tree viewer from the JSONTools plugin. It looks similar to the Notepad view but shows the number of values for each key and data type.</p><p>Now we can go deeper into the structure of the Layout file.</p><p>The clause here is exactly what we have in the test report:</p><p>If a visual has a filter set up through the Filter pane, we find the clause in the Filters value as well:</p><p>This is some theory obtained from parsing the Layout file of a simple test report. It’s time to look at the Layout from the broken live report. Open the file, transform it for better exploration, and find the required filter in the data query block. Also, there is a non-empty Filter block, which filters by another field, so it’s valid.</p><p>Now we understand the structure of the file and I can try to look at the initial untransformed file. The only way to find the places we are looking for is to search by names used in the report. Fortunately, we have the value of the problematic field. There were 3 dozen such places in the file. Here you can see the selected part of the Where clause with the problematic condition:</p><p>Now we can delete the Condition section (in all clauses where they are met), or delete the whole Where section if there is only one condition. Notepad++ helps you to identify beginning and end brackets with highlights.</p><p>After deleting, save the file. If you made a copy, move it to another folder — there should be only one Layout file in the Report folder.</p><p>Now, there’s one last step which took me a lot of hours — if you skip it, your pbix report won’t open even if you made no mistakes editing the Layout file.</p><p>You should delete the SecurityBindings file from the root folder of the report.</p><p>According to the article mentioned earlier, this file contains Row-Level Security data. Keeping it before reassembling the report will prevent it from opening. Since I have no RLS in this report, it’s not a problem to delete it. At least, I haven’t found any issues in the report after doing so.</p><p>Delete the SecurityBindings file and zip the report folder: select all files and folders, and send them to a Compressed (zipped) folder. Then change the extension back to .pbix and try to open it. If done correctly, your file will successfully open with Power BI Desktop, and you will find your report is fixed.</p><p>If you get an error while opening the report, you might have made a mistake editing the files. Try to repeat all steps from scratch. You can make small changes step-by-step and check if there are errors after each step.</p>","contentLength":6546,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Tech Leaders Need First Principles Thinking Now More Than Ever","url":"https://hackernoon.com/tech-leaders-need-first-principles-thinking-now-more-than-ever?source=rss","date":1750924063,"author":"Archith","guid":177,"unread":true,"content":"<p>You're a leader, more specifically, one that works with technology, engineering, or product development—if you're reading this. You're faced with hard problems every day. As easy as it is to simply leap headfirst into the tried and true, I've learned over the years that one of the most effective mental models is to step back and apply First Principles Thinking.</p><h3><strong>What Exactly is First Principles Thinking?</strong></h3><p>First principles thinking is literally just breaking down complicated problems into their basic, underlying facts and rebuilding solutions afresh from scratch. Instead of analogizing solutions from one's own background (or worse, copying competitors), this process forces you to question assumptions, drill down, and generate true innovation.</p><h3><strong>Why Does This Matter in Tech?</strong></h3><p>First, a reality check: tech leaders are perpetually under pressure. Pressure from stakeholders, competitors, or even our own aggressive timetables. Under constant pressure, it's all too easy to fall back on generic playbooks or industry \"best practices.\"</p><p>Here's the problem: best practices are average solutions to typical challenges. They will seldom provide breakthrough outcomes.</p><p>By taking a step back and applying first principles, you'll be able to find new solutions. Like when you're scaling a platform, it's easy to rush in and just throw more infrastructure or conventional scaling techniques at the problem. But consider this, what's really the limitation here? Is it compute, is it latency, or maybe it's a suboptimal data architecture that's inherently broken?</p><h3><strong>Practical Application: Scaling Without Blindly Adding Costs</strong></h3><p>Recently, my team faced frenetic scaling problems after a product launch that led to excessive traffic. GUT reaction: give more AWS resources—everyone knows that's the easiest thing to do. However, I waited and wore first principles thinking instead:</p><ol><li><strong>Pinpoint the root constraints</strong>: We plunged into performance metrics. Was the server load? Database contention? API inefficiencies?</li><li><strong>Challenge every assumption</strong>: We had initially presumed that we needed more resources. But was our data structure efficient enough? Were our caching techniques maximized? Were certain features too resource-intensive when they did not have to be?</li><li><strong>Rebuild the solution from fundamentals</strong>: We realized that the real problem wasn't server capacity; it was how often we cached and repeatedly called expensive database queries. By revisiting our caching strategy in its most basic form, we greatly reduced costs and improved performance.</li></ol><p>A helpful technique to help with first principles thinking application is the \"Five Whys\" technique, notoriously created by Toyota:</p><ul><li>Because the servers are overloaded.</li><li><strong>Why are the servers overloaded?</strong></li><li>Because there's too much traffic from repeated database calls.</li><li><strong>Why are there repeated database calls?</strong></li><li>Because the cache refreshes too often.</li><li><strong>Why does the cache refresh often?</strong></li><li>Because it is based on a badly made update interval choice.</li><li><strong>Why was this update interval choice made?</strong></li><li>Due to an old assumption about user behavior.</li></ul><p>By repeating \"why\" several times, we found the root cause and fixed the fundamental issue rather than giving a superficial solution.</p><h3><strong>First Principles Framework for Practice</strong></h3><p>Here's a simple-to-use but effective framework that you can apply to practice first principles thinking:</p><ol><li> Clearly articulate what you're trying to solve.</li><li> Define and break down the problem elements.</li><li> Boldly challenge each element and assumption.</li><li> Use the Five Whys or other methods to drill down to the root causes.</li><li> Build new solutions from these absolute truths.</li></ol><h3>Beyond Technical Problems</h3><p>First principles aren't exclusive to technology. They're also robust in leadership contexts—hiring, organizational structure, and even communication strategy.</p><p>With a consistent drip of employee turnover, rather than showering employees with more benefits or bonuses, you wonder: Why are people actually quitting? Is it compensation, chances for growth, or perhaps lack of meaningful work?</p><p>By cutting it down to first principles, you'll be more likely to find simpler, but better answers.</p><h3>Quick Tips to Practice First Principles Thinking</h3><ul><li><strong>Attack assumptions aggressively:</strong> Assume nothing is holy.</li><li> Drill deep to an anchor truth.</li><li> If it looks too complex, you probably haven't cut it thinly enough.</li></ul><p>First principles thinking won't always be the simplest or fastest route—at first. But the clarity and imagination it provides are unmatchable. In a rapidly shifting tech world, that clarity isn't just worth its weight in gold; it's mandatory.</p><p>Remember, average strategies have average results. The next time you find yourself faced with complexity, try applying first principles—it may very well change how you lead.</p><p><em>What's your experience been with first principles thinking? Have you uncovered some unexpected epiphanies by pushing back against assumptions? Tell us your tale in the comments below ?</em></p>","contentLength":4877,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"They Promised a Bonus. Then They Vanished. The Upwork Scam No One Sees Coming","url":"https://hackernoon.com/they-promised-a-bonus-then-they-vanished-the-upwork-scam-no-one-sees-coming?source=rss","date":1750923927,"author":"Shayam Thomas Mohan Ram","guid":176,"unread":true,"content":"<p>Upwork is supposed to be a place of opportunity. But for many freelancers, it becomes a minefield of scams, manipulation, and wasted time. Below, we bring you&nbsp;<strong>real titles and stories from actual freelancers</strong>&nbsp;who got burned — so you don’t have to.</p><blockquote><p><em>“I was invited to a voice recording job. The catch? The payment would be sent as a&nbsp;bonus&nbsp;after task completion. Turns out bonus payments aren’t protected if you haven’t worked with the client before. Upwork did nothing when the client vanished.”</em></p></blockquote><p><strong>Lesson:&nbsp;Never accept jobs where payment is offered solely as a bonus. Use&nbsp;milestone&nbsp;or&nbsp;hourly contracts&nbsp;with tracked time to stay protected.</strong></p><blockquote><p><em>“The client filed a chargeback&nbsp;after&nbsp;Upwork ruled in my favor during arbitration. Upwork took the money back anyway and locked my withdrawals.”</em></p></blockquote><p><strong>Lesson:&nbsp;Even “won” disputes can go south. Learn how&nbsp;chargebacks&nbsp;work and avoid clients who seem to look for loopholes. If possible, prefer hourly contracts with work diaries.</strong></p><blockquote><p><em>“After delivering the design files, the client went silent. Then they suddenly disputed the milestone and claimed I overbilled.”</em></p></blockquote><p><strong>Lesson:&nbsp;Always send&nbsp;preview-only&nbsp;versions of your work until payment is received. Document all client approvals in messages.</strong></p><blockquote><p><em>“Got a message offering a copywriting job. They sent a Telegram handle, then a shady form with personal questions and a bonus-based payment model.”</em></p></blockquote><p><strong>✅&nbsp;Lesson:&nbsp;Any job that&nbsp;pulls you off-platform&nbsp;early is usually a scam. Stay inside Upwork’s ecosystem until trust is built — and&nbsp;&nbsp;give personal info outside contracts.</strong></p><blockquote><p><em>“Not kidding. They wanted a urine test and a psychological profile. For a part-time remote assistant gig. Absolutely unhinged.”</em></p></blockquote><p><strong>Lesson:&nbsp;You don’t owe anyone your bodily fluids. This is an extreme red flag.&nbsp;Decline and report&nbsp;such behavior immediately.</strong></p><blockquote><p><em>“I submitted my ID and did a video call, but Upwork still banned me. I lost access to all my pending payments.”</em></p></blockquote><p><strong>Lesson:&nbsp;Keep&nbsp;backups of everything: contracts, work files, and withdrawal receipts. Don’t rely 100% on a single platform — have an exit strategy.</strong></p><blockquote><p><em>“Spent a ridiculous amount boosting proposals. Got ignored or ghosted. Some jobs looked real but never had any intention of hiring.”</em></p></blockquote><p>Lesson:&nbsp;Don’t assume more Connects = more chances. Look for&nbsp;red flags: clients with zero hires, vague descriptions, or ‘too good to be true’ budgets.</p><blockquote><p><em>“Initially it was one email. Then two. Then landing pages. All under the same milestone. I’m being squeezed dry.”</em></p></blockquote><p><strong>Lesson:&nbsp;Scope creep is real. Define&nbsp;hard boundaries&nbsp;in your contract, and pause work the moment deliverables go beyond what was agreed.</strong></p><blockquote><p><em>“Client didn’t leave feedback. But my JSS dropped immediately after. Did I just get silently punished?”</em></p></blockquote><p><strong>Lesson:&nbsp;Clients can leave&nbsp;private feedback&nbsp;even if they say nothing publicly. Always aim to wrap projects with clear deliverables and satisfaction.</strong></p><blockquote><p><em>“I was about to accept the contract, then noticed the client’s account was brand new. The next day it was suspended. I could’ve been trapped.”</em></p></blockquote><p><strong>Lesson:&nbsp;Always&nbsp;check client history: hiring rate, reviews, and time on the platform. If it’s too new, it might be fake.</strong></p><p>These are not just stories — they are&nbsp;&nbsp;from real people trying to earn a living. Every freelancer should:</p><ul><li><strong>Protect deliverables until payment.</strong></li><li><strong>Avoid off-platform communication.</strong></li></ul><blockquote><p><em>💬&nbsp;“If it feels off, it probably is. You’re better off walking away than working for free.”</em></p></blockquote><p>Stay sharp out there. The freedom of freelancing is powerful — but only if you protect it.</p><p>\\\n<strong>Tired of scams, ghost clients, and wasted connects on Upwork?</strong></p><p>You’re not alone — and you don’t have to fly blind anymore.I’ve started using&nbsp;, a smart tool that scans and scores Upwork jobs&nbsp;&nbsp;you apply.</p><ul><li>Flags suspicious or scammy posts</li><li>Highlights legit, high-quality clients</li><li>Saves your connects and your sanity</li><li>Helps you spot red flags <strong>like the stories above — before you live them</strong></li></ul><p>If you’re serious about protecting your time, money, and mental health on Upwork,&nbsp;.</p>","contentLength":4021,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI Didn’t Replace Me—It Supercharged My Phpstorm Workflow","url":"https://hackernoon.com/ai-didnt-replace-meit-supercharged-my-phpstorm-workflow?source=rss","date":1750923802,"author":"Lala","guid":175,"unread":true,"content":"<h3>I was scared like anyone else that “AI will replace me.”</h3><p>But with my experience using AI tools daily, I’ve embraced the cliché: \\n <strong>AI doesn’t replace me — it speeds me up.</strong></p><p>But&nbsp;&nbsp;because I’m learning how to use it properly. Let’s start with Github Co-pilot.</p><p>As a frontend developer, my job involves building features, debugging, and constantly improving things across large codebases. Copilot has become a tool I rely on almost every day — not to do the work for me, but to help me start faster, move smarter, and catch things earlier.</p><p>Today, I’m breaking down how I actually use GitHub Copilot inside PhpStorm — where it works&nbsp;, and where you still need to lead.</p><p>What makes Copilot inside PhpStorm so useful is this:</p><blockquote><p><strong><em>It understands the file, the code, and the project context.</em></strong></p></blockquote><p>This means I can write a comment like:</p><pre><code>// Service to validate student assignment submissions\n</code></pre><p>…and Copilot will generate a solid starting point — not just random boilerplate, but something relevant to the structure of my project.</p><p>This kind of head start makes a huge difference when starting something from scratch. It saves me from staring at a blank file, remembering syntaxes and starting empty functions. Instead, I’m editing and evolving, which is much faster than writing from zero.</p><p>But here’s the thing: You need a strong mental model of what you’re building before AI can be helpful.</p><h2>How I Use GitHub Copilot Daily Let me walk you through some real-life use cases that have made the most impact:</h2><ol><li>Kickstarting new features I often create starter code for new features by prompting Copilot based on what the file or module is meant to do. It gives me a first draft, and from there, I build step-by-step toward the final version.</li></ol><p>It’s not about skipping thinking — it’s about saving time on repetitive scaffolding.</p><ol start=\"2\"><li>Reusing patterns from past work A while ago, I experimented with dnd-kit to build a custom drag-and-drop interface. When I later needed to build sortable question lists for a live feature, I pointed Copilot to the earlier implementation.</li></ol><p>It recognized the logic and followed the same pattern — helping me repurpose tested ideas in seconds.</p><p>That saved me hours of research and fiddling.</p><ol start=\"3\"><li>Code reviews — before anyone else sees my PR One of my favorite ways to use Copilot is to run a pre-review on my code. I have a simple custom prompt that I use for this.</li></ol><p>It flags inconsistencies, suggests better naming, logic issues — even potential edge cases. It also suggests how I can improve accessibility and how the code can be more maintainable.</p><p>This gives me confidence before sharing my work with the team. I treat it as my private reviewer.</p><ol start=\"4\"><li>Debugging: Smarter logging suggestions Copilot can be a game-changer to help debug code. One great trick is asking:</li></ol><p>“Where should I put console logs to help you debug this error?”</p><p>It often points me to helpful log spots. Then I run the app, collect logs, and ask Copilot what they mean.</p><p>Sometimes this saves a lot of time. Sometimes… not so much. AI can go in circles — and you need to know when to stop and rely on your instincts.</p><p>The Truth About AI-Generated Code Let me be clear:</p><p>You can’t just accept what Copilot gives you.</p><p>AI can hallucinate. It can suggest things that look right — but aren’t. If you don’t understand the micro-details of your system, it’ll slow you down.</p><p>Using Copilot well requires skill. You have to guide it, check its work, and sometimes work around its wrong turns.</p><p>But when you do — when you know how to prompt it smartly, use context, and course-correct — it makes you faster, not just lazier.</p><p>Final Thoughts I didn’t learn this overnight. It came from trying, failing, and figuring out what works over the past year.</p><p>But today, GitHub Copilot is one of the few tools I’d be reluctant to work without. Not because it’s perfect — but because it makes me better.</p><p>And that’s what good tools are supposed to do.</p>","contentLength":3919,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"James Webb Space Telescope Discovers Its First Exoplanet","url":"https://science.slashdot.org/story/25/06/25/2112219/james-webb-space-telescope-discovers-its-first-exoplanet?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1750921200,"author":"BeauHD","guid":275,"unread":true,"content":"The James Webb Space Telescope has discovered its first new exoplanet, TWA 7b -- a young, low-mass planet about 100 times the mass of Earth, making it the lightest planet ever directly imaged beyond the solar system. Space.com reports: TWA 7b was discovered in the debris rings that surround the low-mass star CE Antilae, also known as TWA 7, located around 111 light-years from Earth. CE Antilae is a very young star, estimated to be around just a few million years old. If that seems ancient, consider the sun, a \"middle-aged\" star, is around 4.6 billion years old.\n \n[...] The disk of CE Antilae is divided into three distinct rings, one of which is narrow and bounded by two empty \"lanes\" mostly devoid of matter. When imaging this ring, the JWST spotted an infrared-emitting source, which the team of astronomers determined is most likely a young exoplanet. They then used simulations that confirmed the formation of a thin ring and a \"hole\" exactly where this planet is positioned, corresponding to JWST observations. The research has been published in the journal Nature.","contentLength":1078,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Meta’s recruiting blitz claims three OpenAI researchers","url":"https://techcrunch.com/2025/06/25/metas-recruiting-blitz-claims-three-openai-researchers/","date":1750913412,"author":"Connie Loizos","guid":138,"unread":true,"content":"<article>Zuckerberg has been dangling $100+ million compensation packages in an effort to lure top talent from OpenAI, with mixed results.</article>","contentLength":129,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Swarms of Tiny Nose Robots Could Clear Infected Sinuses, Researchers Say","url":"https://hardware.slashdot.org/story/25/06/25/218250/swarms-of-tiny-nose-robots-could-clear-infected-sinuses-researchers-say?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1750908600,"author":"BeauHD","guid":274,"unread":true,"content":"An anonymous reader quotes a report from The Guardian: Swarms of tiny robots, each no larger than a speck of dust, could be deployed to cure stubborn infected sinuses before being blown out through the nose into a tissue, researchers have claimed. The micro-robots are a fraction of the width of a human hair and have been inserted successfully into animal sinuses in pre-clinical trials by researchers at universities in China and Hong Kong. Swarms are injected into the sinus cavity via a duct threaded through the nostril and guided to their target by electromagnetism, where they can be made to heat up and catalyze chemical reactions to wipe out bacterial infections. There are hopes the precisely targeted technology could eventually reduce reliance on antibiotics and other generalized medicines.\n \n[...] The latest breakthrough, based on animal rather than human trials, involves magnetic particles \"doped\" with copper atoms which clinicians insert with a catheter before guiding to their target under a magnetic field. The swarms can be heated up by reacting to light from an optical fibre that is also inserted into the body as part of the therapy. This allows the micro-robots to loosen up and penetrate viscous pus that forms a barrier to the infection site. The light source also prompts the micro-robots to disrupt bacterial cell walls and release reactive oxygen species that kill the bacteria.\n \nThe study, published in Nature Robotics, showed the robots were capable of eradicating bacteria from pig sinuses and could clear infections in live rabbits with \"no obvious tissue damage.\" The researchers have produced a model of how the technology could work on a human being, with the robot swarms being deployed in operating theatre conditions, allowing doctors to see their progress by using X-rays. Future applications could include tackling bacterial infections of the respiratory tract, stomach, intestine, bladder and urethra, they suggested. \"Our proposed micro-robotic therapeutic platform offers the advantages of non-invasiveness, minimal resistance, and drug-free intervention,\" they said.","contentLength":2114,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Indian drone startup Raphe mPhibr raises $100M as military UAV demand soars","url":"https://techcrunch.com/2025/06/25/indian-drone-startup-raphe-mphibr-raises-100m-as-military-uav-demand-soars/","date":1750903200,"author":"Jagmeet Singh","guid":137,"unread":true,"content":"<article>The startup aims to boost its R&amp;D and local production capabilities amid growing demand for drones in battlefields and for border surveillance.</article>","contentLength":143,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Meta Beats Copyright Suit From Authors Over AI Training on Books","url":"https://tech.slashdot.org/story/25/06/25/2127222/meta-beats-copyright-suit-from-authors-over-ai-training-on-books?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1750901400,"author":"msmash","guid":273,"unread":true,"content":"An anonymous reader shares a report: Meta escaped a first-of-its-kind copyright lawsuit from a group of authors who alleged the tech giant hoovered up millions of copyrighted books without permission to train its generative AI model called Llama. \n\nSan Francisco federal Judge Vince Chhabria ruled Wednesday that Meta's decision to use the books for training is protected under copyright law's fair use defense, but he cautioned that his opinion is more a reflection on the authors' failure to litigate the case effectively. \"This ruling does not stand for the proposition that Meta's use of copyrighted materials to train its language models is lawful,\" Chhabria said.","contentLength":669,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Microsoft Sued By Authors Over Use of Books in AI Training","url":"https://news.slashdot.org/story/25/06/25/2137220/microsoft-sued-by-authors-over-use-of-books-in-ai-training?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1750899000,"author":"msmash","guid":272,"unread":true,"content":"Microsoft has been hit with a lawsuit by a group of authors who claim the company used their books without permission to train its Megatron artificial intelligence model. From a report: Kai Bird, Jia Tolentino, Daniel Okrent and several others alleged that Microsoft used pirated digital versions of their books to teach its AI to respond to human prompts. Their lawsuit, filed in New York federal court on Tuesday, is one of several high-stakes cases brought by authors, news outlets and other copyright holders against tech companies including Meta Platforms, Anthropic and Microsoft-backed OpenAI over alleged misuse of their material in AI training. \n\n[...] The writers alleged in the complaint that Microsoft used a collection of nearly 200,000 pirated books to train Megatron, an algorithm that gives text responses to user prompts.","contentLength":838,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"NVIDIA Engineer Now Co-Maintainer Of \"NOVA\" Open-Source Rust GPU Driver","url":"https://www.phoronix.com/news/NOVA-Core-Co-Maintainer","date":1750898224,"author":"Michael Larabel","guid":712,"unread":true,"content":"<article>The NOVA-Core driver as the basis for a modern, Rust-written open-source NVIDIA GPU driver for the upstream Linux kernel and eventual successor to the reverse-engineered Nouveau DRM driver has a new co-maintainer...</article>","contentLength":215,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Aaron Sorkin's The Social Network Sequel Officially in Development","url":"https://entertainment.slashdot.org/story/25/06/25/2144252/aaron-sorkins-the-social-network-sequel-officially-in-development?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1750896600,"author":"msmash","guid":271,"unread":true,"content":"Aaron Sorkin is officially working on a sequel to The Social Network. From a report: Last year, the Oscar-winning writer revealed he was working on a film that would revisit the subject of Facebook, and Deadline has now reported that The Social Network Part II is in development at Sony Pictures yet isn't a \"straight sequel.\" \n\nThe original film, which traced the early days of Facebook and its creator Mark Zuckerberg, was directed by David Fincher. Sorkin is rumoured to be directing the follow-up. \"I blame Facebook for January 6,\" he said in 2024 on a special edition of The Town podcast, live from Washington DC. When asked to explain why, he responded: \"You're gonna need to buy a movie ticket.\" \n\nThe Social Network was an adaptation of Ben Mezrich's book The Accidental Billionaires, and the sequel will be based on the Wall Street Journal series The Facebook Files. The 2021 investigation examined the damage caused by the social networking site and how internal findings had been buried. Subjects included the influence on the January 6 riot and the mental health of teenage users.","contentLength":1092,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Federal judge sides with Meta in lawsuit over training AI models on copyrighted books","url":"https://techcrunch.com/2025/06/25/federal-judge-sides-with-meta-in-lawsuit-over-training-ai-models-on-copyrighted-books/","date":1750894832,"author":"Maxwell Zeff","guid":136,"unread":true,"content":"<article>A federal judge sided with Meta on Wednesday in a lawsuit brought against the company by 13 book authors, including Sarah Silverman, that alleged the company had illegally trained its AI models on their copyrighted works.</article>","contentLength":221,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Brad Feld on ‘Give First’ and the art of mentorship (at any age)","url":"https://techcrunch.com/2025/06/25/brad-feld-on-give-first-and-the-art-of-mentorship-at-any-age/","date":1750894280,"author":"Connie Loizos","guid":135,"unread":true,"content":"<article>Brad Feld has spent decades operating by a simple principle: Give without expecting anything in return. </article>","contentLength":104,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"US Senators Push For American Version of EU's Digital Markets Act","url":"https://news.slashdot.org/story/25/06/25/214209/us-senators-push-for-american-version-of-eus-digital-markets-act?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1750894200,"author":"BeauHD","guid":270,"unread":true,"content":"U.S. lawmakers have reintroduced the bipartisan Open App Markets Act, aiming to curb Apple and Google's control over mobile app stores by promoting competition, supporting third-party marketplaces and sideloading, and safeguarding developer rights. AppleInsider reports: The Open App Markets Act seeks to do a number of things, including:\n- Protect developers' rights to tell consumers about lower prices and offer competitive pricing;\n- Protect sideloading of apps;\n- Promote competition by opening the market to third-party app stores, startup apps, and alternative payment systems;\n- Make it possible for developers to offer new experiences that take advantage of consumer device features;\n- Give consumers greater control over their devices;\n- Prevent app stores from disadvantaging developers; and\n- Establish safeguards to preserve consumer privacy, security, and safety.\n \nThis isn't the first time we've seen this bill, either. In 2021, Senators Blumenthal, Klobuchar, and Blackburn had attempted to put forth the original version of the Open App Markets Act.However, the initial bill never made it to the floor for an office vote. Thanks to last-minute efforts by lobbying groups and appearances from chief executives, the bill eventually stalled out.\n \nWhile the two bills are largely similar, the revised version introduces several key differences. Notably, the new version includes new carve-outs aimed at protecting intellectual property and addressing potential national security concerns.There's also a new clause that would prohibit punitive actions against developers for enabling remote access to other apps. The clause addition harkens back to the debacle between Apple and most game streaming services -- though in 2024, Apple loosened its App Store guidelines to allow cloud gaming and emulation.\n \nThere are a few new platform-protective clauses added, too. For instance, it would significantly lower the burden of proof for either Apple or Google to block platform access to a third-party app.Additionally, it reinforces the fact that companies like Apple or Google will not need to provide support or refunds for third-party apps installed outside of first-party app marketplaces. \nThe full bill can be found here.","contentLength":2238,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Sam Altman comes out swinging at The New York Times","url":"https://techcrunch.com/2025/06/25/sam-altman-comes-out-swinging-at-the-new-york-times/","date":1750884897,"author":"Maxwell Zeff","guid":134,"unread":true,"content":"<article>From the moment OpenAI CEO Sam Altman stepped onstage, it was clear this was not going to be a normal interview.</article>","contentLength":112,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Anthropic destroyed millions of print books to build its AI models","url":"https://arstechnica.com/ai/2025/06/anthropic-destroyed-millions-of-print-books-to-build-its-ai-models/","date":1750881603,"author":"Benj Edwards","guid":343,"unread":true,"content":"<p>On Monday, court documents revealed that AI company Anthropic spent millions of dollars physically scanning print books to build <a href=\"https://arstechnica.com/ai/2025/05/anthropic-calls-new-claude-4-worlds-best-ai-coding-model/\">Claude</a>, an AI assistant similar to <a href=\"https://arstechnica.com/information-technology/2023/11/chatgpt-was-the-spark-that-lit-the-fire-under-generative-ai-one-year-ago-today/\">ChatGPT</a>. In the process, the company cut millions of print books from their bindings, scanned them into digital files, and threw away the originals solely for the purpose of training AI—details buried in a copyright ruling on fair use whose broader fair use implications we <a href=\"https://arstechnica.com/tech-policy/2025/06/key-fair-use-ruling-clarifies-when-books-can-be-used-for-ai-training/\">reported</a> yesterday.</p><p>The <a href=\"https://s3.documentcloud.org/documents/25982181/authors-v-anthropic-ruling.pdf\">32-page legal decision</a> tells the story of how, in February 2024, the company hired Tom Turvey, the former head of partnerships for the <a href=\"https://en.wikipedia.org/wiki/Google_Books\">Google Books</a> book-scanning project, and tasked him with obtaining \"all the books in the world.\" The strategic hire appears to have been designed to replicate Google's legally successful book digitization approach—the same scanning operation that survived copyright challenges and <a href=\"https://www.authorsalliance.org/2023/02/24/fair-use-week-2023-looking-back-at-google-books-eight-years-later/\">established</a> key fair use precedents.</p><p>While destructive scanning is a <a href=\"https://en.wikipedia.org/wiki/Book_scanning\">common practice</a> among some book digitizing operations, Anthropic's approach was somewhat unusual due to its documented massive scale. By contrast, the Google Books project largely used a <a href=\"https://www.npr.org/sections/library/2009/04/the_granting_of_patent_7508978.html/\">patented</a><a href=\"https://libraries.colorado.edu/2024/10/15/university-libraries-digitizes-thousands-books-google-books-project\">non-destructive</a> camera process to scan millions of books borrowed from libraries and later returned. For Anthropic, the faster speed and lower cost of the destructive process appears to have trumped any need for preserving the physical books themselves, hinting at the need for a cheap and easy solution in a highly competitive industry.</p>","contentLength":1480,"flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2025/06/manybooks-1152x648.jpg","enclosureMime":"","commentsUrl":null},{"title":"Ubuntu disables Intel GPU security mitigations, promises 20% performance boost","url":"https://arstechnica.com/security/2025/06/ubuntu-disables-intel-gpu-security-mitigations-promises-20-performance-boost/","date":1750880359,"author":"Dan Goodin","guid":342,"unread":true,"content":"<p>Ubuntu users could see up to a 20 percent boost in graphics performance on Intel-based systems under a change that will turn off security mitigations for blunting a class of attacks known as Spectre.</p><p>Spectre, you may recall, <a href=\"https://arstechnica.com/gadgets/2018/01/meltdown-and-spectre-every-modern-processor-has-unfixable-security-flaws/\">came to public notice</a> in 2018. Spectre attacks are based on the observation that performance enhancements built into modern CPUs open a <a href=\"https://en.wikipedia.org/wiki/Side-channel_attack\">side channel</a> that can leak secrets a CPU is processing. The performance enhancement, known as <a href=\"https://en.wikipedia.org/wiki/Speculative_execution\">speculative execution</a>, predicts future instructions a CPU might receive and then performs the corresponding tasks before they are even called. If the instructions never come, the CPU discards the work it performed. When the prediction is correct, the CPU has already completed the task.</p><p>By using code that forces a CPU to execute carefully selected instructions, Spectre attacks can extract confidential data that the CPU would have accessed had it carried out the ghost instructions. Over the past seven years, researchers have uncovered multiple attack variants based on the architectural flaws, which are unfixable. CPU manufacturers have responded by creating patches in both micro code and binary code that restrict speculative execution operations in certain scenarios. These restrictions, of course, usually degrade CPU performance.</p>","contentLength":1292,"flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2025/06/graphics-1152x648.jpg","enclosureMime":"","commentsUrl":null},{"title":"AVX-512's Enormous Advantage For AMD EPYC 4005 Series Performance","url":"https://www.phoronix.com/review/amd-epyc-4005-avx512","date":1750878000,"author":"Michael Larabel","guid":711,"unread":true,"content":"<article>The AMD EPYC 4005 \"Grado\"\" processors launched by AMD in May for entry-level servers offer downright amazing value, performance, and power efficiency over the Intel Xeon 6300 / Xeon E-2400 series competition. Intel's top-of-stack Xeon 6300 (Xeon 6369P) / Xeon E processors fail to compete with even the mid-tier EPYC 4005 series processors in either performance, power, or cost effectiveness. Among the many advantages to these budget-friendly EPYC processors is having AVX-512 support with a full 512-bit data path compared to the Xeon 6300 series only having AVX2. For providing more insight into the AVX-512 performance impact with the AMD EPYC 4005 series, here are some enabled/disabled comparison benchmarks and how they are positioned relative to the Xeon 6369P server processor.</article>","contentLength":786,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Proposal To Ship XLibre As X11 Server Packages On Fedora Linux Is Withdrawn","url":"https://www.phoronix.com/news/Fedora-XLibre-Proposal-Withdraw","date":1750876382,"author":"Michael Larabel","guid":710,"unread":true,"content":"<article>The controversial proposal to replace the upstream X.Org X11 server packages on Fedora Linux with XLibre is not going to happen... At least not for now. The change proposal has been withdrawn prior to being voted on by the Fedora Engineering and Steering Committee (FESCo)...</article>","contentLength":275,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Mozilla Formally Discontinues Its DeepSpeech Project","url":"https://www.phoronix.com/news/Mozilla-DeepSpeech-Discontinued","date":1750875356,"author":"Michael Larabel","guid":709,"unread":true,"content":"<article>One of the interesting projects engaged in by Mozilla that directly wasn't related to their web browser efforts was DeepSpeech, an embedded/offline speech-to-text engine. To not much surprise given the lack of activity in recent years, last week they finally and formally discontinued the open-source project...</article>","contentLength":311,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"RADV Driver Introduces Limited Support For NVIDIA Cooperative Matrix Extension","url":"https://www.phoronix.com/news/RADV-NV-Coperative-Matrix2","date":1750856400,"author":"Michael Larabel","guid":708,"unread":true,"content":"<article>The Mesa Radeon Vulkan driver \"RADV\" has merged support for the VK_NV_cooperative_matrix2 NVIDIA Vulkan extension but it's hidden by default and only partially supported with a focus on helping FidelityFX Super Resolution 4 and VKD3D-Proton...</article>","contentLength":243,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Estonia Debuts AI Chatbots for High School Classrooms","url":"https://spectrum.ieee.org/estonia-ai-leap","date":1750854816,"author":"Eliza Strickland","guid":170,"unread":true,"content":"<p>Students are meant to use AI for learning rather than cheating</p>","contentLength":62,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy82MTEwMzczNy9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTc4ODQzODg4Nn0.MPutpQxbnQXwqa4Y9YhUq7sxHIhb9YmIb8JwISXFlGM/image.png?width=600","enclosureMime":"","commentsUrl":null},{"title":"Intel Preps Linux PTC \"Throttling Control Interface\" To Run Hotter For Better Performance","url":"https://www.phoronix.com/news/Intel-PTC-Throttling-Control","date":1750853400,"author":"Michael Larabel","guid":707,"unread":true,"content":"<article>With the Linux 6.16 kernel Intel enabled the new Platform Temperature Control (PTC) interface as part of their int340x thermal driver. Now ahead of the Linux 6.17 kernel Intel PTC is being extended to support a Throttling Control Interface for those that may prefer running their system(s) hotter in order to enjoy better performance...</article>","contentLength":336,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"NIST Unveils a Verifiable Quantum Random-Number Beacon","url":"https://spectrum.ieee.org/nist-quantum-random-number-generator","date":1750852804,"author":"Edd Gent","guid":169,"unread":true,"content":"<p>CURBy uses quantum mechanics to create a more robust RNG than other options</p>","contentLength":75,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy82MTEwNDg2OC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTgwOTgzMTgyNX0.VQwAF7Dhan81zccJrO2w6rKs9KXylJNl3rbRmVmPiUA/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"Fairphone 6 Announced With Same-Day Linux Support Patches","url":"https://www.phoronix.com/news/Fairphone-6-Linux","date":1750846851,"author":"Michael Larabel","guid":706,"unread":true,"content":"<article>Dutch electronics company Fairphone today announced their Fairphone Gen 6 smartphone as the successor to the Fairphone 5. Fairphone 6 continues to be repair-friendly and was just announced this morning while already the Linux support patches have hit the Linux kernel mailing list...</article>","contentLength":283,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Intel Open-Source Software Begins Adding Notices For Generative AI Use","url":"https://www.phoronix.com/news/Intel-OSS-Gen-AI-Usage","date":1750845912,"author":"Michael Larabel","guid":705,"unread":true,"content":"<article>Intel open-source software projects are beginning to relay notices that they may have been developed with support from Intel-operated generative AI solutions...</article>","contentLength":160,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"PNG Spec Updated For HDR Images & Animated PNGs","url":"https://www.phoronix.com/news/PNG-Specification-2025","date":1750844549,"author":"Michael Larabel","guid":704,"unread":true,"content":"<article>While WebP and AVIF generate much of the interest these days from a tech perspective for modern image formats, the PNG image format was just updated with new features...</article>","contentLength":169,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Former Btrfs Lead Developer Chris Mason Announces New \"rsched\" Tool","url":"https://www.phoronix.com/news/rsched","date":1750811220,"author":"Michael Larabel","guid":703,"unread":true,"content":"<article>Open-source Linux developer Chris Mason who is known for being the original lead developer of the Btrfs file-system recently began hacking on a new tool that he announced today, rsched...</article>","contentLength":187,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Pokemon Scarlet & Violet Switch 2 Review - More To Chewtle On","url":"https://www.gamespot.com/reviews/pokemon-scarlet-violet-review-a-braviary-new-world/1900-6417994/?ftag=CAD-01-10abi2f","date":1750791360,"author":"Jake Dekker","guid":673,"unread":true,"content":"<p dir=\"ltr\">With the launch of the Nintendo Switch 2, Pokemon Scarlet and Violet have received a much-needed performance boost. The free update adds 4K visuals while docked and a rock-solid 60 frames per second for both docked and handheld play. After several hours of testing, I've found both Scarlet and Violet run and play  better.</p><p dir=\"ltr\">On the original Switch, a stormy Casseroya Lake in the northwestern part of Paldea was particularly taxing--even after a handful of updates, I dreaded going to that lake to collect items or shiny hunt. Now, on the Switch 2, it runs flawlessly regardless of where you are in the world. Additionally, the lengthy loading times have been reduced to a few seconds.</p><p dir=\"ltr\">Despite these improvements, Pokemon Scarlet and Violet still isn't the most visually appealing Pokemon game to date. The world feels bland and barren, and character models--outside of the wonderfully detailed and expressive Pokemon--are simplistic and wooden. Despite the 4k resolution, there are still plenty of low-quality textures and visual bugs can occur during battle. It's a shame given how strong the visual identity is for something like Pokemon Let's Go! Pikachu and Eevee or even Pokemon: Legends Arceus, which received a fair bit of criticism for its visuals as well.</p><a href=\"https://www.gamespot.com/reviews/pokemon-scarlet-violet-review-a-braviary-new-world/1900-6417994/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>","contentLength":1289,"flags":null,"enclosureUrl":"https://www.gamespot.com/a/uploads/screen_medium/43/434805/4057910-8965418612-pokem.jpg","enclosureMime":"","commentsUrl":null}],"tags":["tech"]}