{"id":"3MxaK2JpEReqSnmaGkKd8iyLQpHxJgRRqMaJeCefkkoBT47","title":"Hacker News - Newest: \"Crystal\"","displayTitle":"Hacker News - Newest: \"Crystal\"","url":"https://hnrss.org/newest?q=Crystal","feedLink":"https://news.ycombinator.com/newest","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":11,"items":[{"title":"Single Crystal Graphene: the 2 Dimensional super material for space elevators","url":"https://www.azom.com/article.aspx?ArticleID=16371","date":1763140288,"author":"dreadsword","guid":59,"unread":true,"content":"<p><em>In this interview, Adrian Nixon, CEO of Nixor Ltd, talks to AZoM about Space Elevators and how 2D materials will contribute to them.</em></p><h2><strong>How does a space elevator work?</strong></h2><p>The concept is straightforward. At the moment the only way of getting into space is to ride on a rocket. However, there is another way.</p><p>Imagine you are standing at the equator. A geostationary satellite has been launched into orbit right above you. From your point of view, that satellite will always be directly above you.</p><p>Now, imagine that you could drop a cable from the satellite down to the ground. You would see the cable directly in front of you. You could grip the cable, start climbing and eventually, you would climb all the way up into space. That’s it.</p><p>Even though the concept is straightforward, actually doing it is quite the opposite. It will be one of the major engineering challenges of all time, but <a href=\"https://www.azom.com/article.aspx?ArticleID=6045\">graphene</a> could help.</p><h2><strong>It sounds like science fiction! Could a space elevator really be built?</strong></h2><p>When I first heard about the space elevator I thought it was science fiction too. Then I looked into the background and I discovered there is a worldwide community of very credible engineers and rocket scientists who believe this can be done and they are actively working on the technology.</p><p>Back at the turn of this century, NASA decided to find out whether this was a realistic project.&nbsp; The <a href=\"http://www.niac.usra.edu/\" rel=\"nofolllow noopener\">NASA Institute for Advanced Concepts</a> (NIAC) funded a feasibility study into the Space Elevator, using one of their most respected scientists, Bradley C. Edwards. Dr. Edwards conducted a thorough six-month investigation and reported back with findings based on an assessment of the challenges involved and the key components of the technology:</p><p>There are four basic elements of a space elevator.</p><ol><li>The base station and anchor.</li><li>The counterweight and orbital space station.</li><li>The tether (the cable that connects the surface to space).</li><li>The climber (the elevator carriage).</li></ol><p>Dr. Edwards found that given enough money and time, everything apart from the tether could be created with the current technology. There was no material strong enough to make the tether. Carbon nanotubes were proposed as a candidate material but no continuous production process has emerged that can make them in the quantity and quality needed.</p><p>So, the whole space elevator project effectively stalled. However, a global group of highly skilled rocket scientists and engineers kept alive the idea in an organisation called the International Space Elevator Consortium (ISEC). They maintain a constant watch on developing materials science.</p><p>Since the NASA report was commissioned, a new material has been isolated - graphene. The technology of graphene is maturing and it now has the attention of ISEC as a candidate tether material.</p><h2><strong>What are the main challenges making Graphene materials for Space Elevator tethers?</strong></h2><p><em>Image Credits: Rost9/shutterstock.com</em></p><p>Graphene is a fantastic 2D material. It is 200 times stronger than steel, transparent, flexible and conducts electricity better than copper. However, graphene can only be made commercially in little bits with the current technology.</p><p>Take for example, the ‘<em>200 times stronger than steel</em>’ property. You can't make full use of that at the moment because the current commercial state is to produce graphene from graphite using the top-down method. This makes graphene as nano plates that are typically 400 nanometers long. To give an idea of how small this, look at the edge of a piece of copier paper, which is 100 microns (100,000 nanometers) thick. You could fit 250 of these graphene nanoplates across the edge of that piece of paper.</p><p>So, you can see graphene nanoplates really small. You can imagine that if you wanted to use the current commercially available graphene for a space elevator task, and lots of other applications, you're going to need something like a chain. You've got all these really strong small links, but they're not connected together so nanoplate graphene will not work.</p><p>The first solution you might consider would be to glue together the nanoplates. Research has been carried out looking at <a href=\"https://www.nixor.co.uk/new-graphene-polymer-composite-made-by-bonding-nanoplates/\" rel=\"nofollow noopener\">copolymerizing graphene nanoplatelets</a> with various polymers to make a strong composite, however, this is not strong enough to be a viable tether material.</p><p>The other way of making graphene is by the bottom-up method, which assembles graphene, atom by atom. The leading technology is called Chemical Vapour Deposition (CVD). Even though this process is really still in its infancy from an industrial point of view, it is impressive.</p><p>The CVD process usually involves heating methane and hydrogen to just below 1000 degrees centigrade over a clean metal surface, such as copper or nickel. As the hot methane approaches the surface of the metal, a reaction takes place catalyzed by the metal that removes the hydrogen from the carbon in the methane molecule. The carbon from the methane lands on the metal surface and starts to link up with other carbon atoms. The lowest energy structure is a flat sp2 hybridized carbon - in other words, graphene. Once the surface is covered, the reaction stops, leaving a one atom thick 2D covering of graphene on the metal.</p><p>You would think you would have a continuous sheet of graphene across the surface, but you don't get a perfect layer because there are some problems. One, is that the surface of the metal contains cracks at the microscopic level, (it looks a bit like crazy paving). When the graphene layer grows over that, it often picks up these discontinuities and you will get defects in the sheet.</p><p>Another problem is that graphene grows from multiple spots at the same time; a bit like snowflakes landing on a pavement. These form separate domains, which gradually increase and then butt up against one another. Again, you get discontinuities. This creates polycrystalline graphene.</p><p>Having made the graphene layer, you now have to remove it from the metal. There are two basic approaches. The first is to dissolve away the metal using an etchant solution such as a strong acid or oxidizing agent. The second is to use a strong sticky tape. The sticky tape method usually leaves a polymer residue that contaminates the graphene.</p><p>Both methods are currently a batch process, although teams in the UK, USA and Norway are working on turning this method into a continuous process. All of these methods are still in the laboratory phase at present.</p><p><em>Image Credits: 30000ad/shutterstock.com</em></p><h2>How can you make Graphene suitable for space elevator tethers?</h2><p>The tether needs to be as strong as possible, so this means the entire length of the structure needs to be made from single sheets of graphene that are defect free. Such a structure would be a single molecule at a macro scale. Until recently this was thought to be impossible</p><p>However, back in January and March 2017, I proposed a continuous process for making defect free sheet graphene in rolls.</p><p>Things then started to get really interesting, because later that year (in the summer of 2017) a team at Peking University announced they were the first to make near perfect graphene at a scale of 500mm x 50mm. They called this material single crystal graphene. A crystal in this context refers to a repeating regular pattern, rather than the sparkling brittle crystals of our everyday experience.</p><p>Single-crystal graphene is important because it is very strong. Tensile strength is a measure of the force needed to pull apart any material and is measured in Pascals (Pa). Commercially available structural steel has strength of 550 MPa (550 Million Pa). A space elevator tether needs to be made from a material with strength of at least 50GPa (50000 MPa), so steel is not strong enough. Single-crystal graphene on the other hand, has a tensile strength of 130GPa. (130000 MPa). It is the strongest material ever tested and will be strong enough to make a space elevator tether.</p><p>To answer your question, single-crystal graphene is the material that can make space elevator tethers. That material exists. It has already been made in the laboratory.</p><h2>As nothing like a space elevator has ever been made, how much can you theoretically and practically test it?</h2><p>NASA has done a great deal of the theoretical work on the elements of the space elevator. The International Space Elevator Consortium (ISEC) and others have continued this work so we know where the space elevator could be built and many of the obvious technical challenges have been thought through and addressed.</p><p>As far as single crystal graphene is concerned we are still at the early stages. We know the material has been made at a laboratory scale but samples have been isolated for further testing.</p><p>A few weeks ago, in May 2018, a team in South Korea made near perfect single-crystal graphene at the centimetre scale for testing in a laboratory. They measured the strength directly and found that the sample had a Young’s modulus of 0.9 TPa. This is very close to the predicted value of 1.0 TPa and establishes graphene as the strongest material ever tested.</p><p>If you want to find out more, I’ll be presenting about this and more at the ISEC conference in Seattle on the 17th August 2018.</p><h2>How close are we to constructing the real thing?</h2><p><em>Image Credits: chombosan/shutterstock.com</em></p><p>The space elevator is about to enter the public consciousness; in simulation anyway. Disney announced a few days ago that they are now working on a Space Elevator simulator to an orbital restaurant at Disney World’s Epcot Centre in Florida!</p><p>Arthur C. Clarke famously said the space elevator would be built fifty years after everyone stopped laughing. The laughter has already stopped. The real thing could be closer than you might think. A proof of concept project will be necessary to show that single-crystal graphene can be made by a continuous process. Then a series of follow up projects to design and make the production machines, so that the process can be optimised and scaled up properly. The ISEC team estimates it will probably take about 20 years. It will cost approximately 20 billion dollars just for the tether.</p><p>To actually build all of the other elements, it would probably cost another $80 billion. We could get it to completion for somewhere under 100 billion dollars, over a 20 to 30 year period. That figure compares with the global space industry that is worth around 360 billion dollars in 2018 alone.</p><p>You probably would discover all sorts of interesting things going forward as well, because the ROI on all this is just staggering. It might even happen in my lifetime, however there are still many hurdles to overcome.</p><p>I wouldn’t want to give anybody the impression that it's going to happen anytime soon. At the moment this is a set of ideas - they've been well thought through, but they need testing properly.&nbsp; This will be an industrial strength challenge over an extended period of time but I’m convinced this can be done.</p><h2>How will the space elevator benefit us, and what do space elevators mean for the future of space travel?</h2><p>Apart from getting us into space smoothly and safely, the operating costs are low. At the time of writing you can expect to pay around $20,000 per kilogram to take a payload into orbit, but with the space elevator, once you've paid all the setup costs, then you are down to $100 or $200 per kilogram. Even with large set up costs the business case is compelling.</p><p>It makes a lot of sense with the return on investment (ROI) over a long period of time. If you're just going to use it as a one off, then it's a very expensive onetime thing, but the idea is that once you get a space elevator built space travel becomes routine and cheap.</p><p>Dr. Edwards summed up the implications in his report for NASA: <em>“…the long-term return we (humans) would receive on the construction of a space elevator is staggering, it would literally change our world.”</em></p><p>Beginning his career as a Chartered Chemist and Member of the Royal Society of Chemistry, Adrian Nixon is now the Senior Editor at InvestorIntel and the Founder/CEO of Nixor Limited. He is also an advisory board member of the National Graphene Association and the Co-Founder/Facilitator of the Foresight Forum.</p><p>Adrian Nixon will be the keynote speaker at the 2018 International Space Elevator Conference (17th-19th August 2018); held at the Museum of Flight in Seattle, Washington.</p><div><p>\n        Disclaimer: The views expressed here are those of the interviewee and do not necessarily represent the views of AZoM.com Limited (T/A) AZoNetwork, the owner and operator of this website. This disclaimer forms part of the <a href=\"https://www.azom.com/terms\">Terms and Conditions</a> of use of this website.\n    </p></div>","contentLength":12553,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45928948"},{"title":"Tracking Down Progressively-Enhanceable APIs in Crystal's Stdlib","url":"https://willhbr.net/2025/11/07/tracking-down-progressively-enhanceable-apis/","date":1763056138,"author":"straight-shoota","guid":58,"unread":true,"content":"<p>Something that I’m a big fan of is <a href=\"https://willhbr.net/2024/02/28/optimising-for-modification/\">APIs that can be easily modified and hacked with</a>. It’s frustrating to have to write fully production-ready code when you actually want to just prototype something, and so I’m happy when there’s an API that it’s easy to use, which then progresses into a more full-featured API.</p><p>In Crystal an example of this is . If you want to get the entire contents of a file you can just do:</p><div><div><pre><code></code></pre></div></div><p>Will this cause problems if the file is huge? Probably, but it works fine for a prototype or in something less critical. Then when you want to be a grown-up and do things properly, the API doesn’t actually change that much:</p><div><div><pre><code></code></pre></div></div><p>What I didn’t know is that there are a more of these APIs hiding in the Crystal stdlib that I wasn’t aware of. I found these after I captured a profile of my <a href=\"https://codeberg.org/willhbr/status_page\">status page library</a>, it’s plenty fast enough (especially because I’m the only person ever sending requests) but I was interested to see what it spent its time doing.</p><p>I captured the sample using <a href=\"https://github.com/mstange/samply\">samply</a> which is super convenient. I built it from the main branch so I could use the  flag. This dumps the symbol info directly into the profile file, since running a local web server and having the Firefox profiler talk back to it runs into all sorts of security roadblocks, especially when it’s not actually running locally.</p><p>To get some nice juicy data, I wrote another little program that would just spam a certain URL with HTTP requests, compiled with  to make the most of my cores:</p><div><div><pre><code></code></pre></div></div><p>Unsurprisingly, after getting the profile I can confirm it spends its time dumping bytes into the response buffer, since there’s no interesting calculation on my default  page. However there were two interesting sections that were taking more time than I expected.</p><p>The first is , which replaces characters that could be interpreted as HTML tags with the corresponding HTML entity. I noticed two things, first it immediately calls into , and inside that there’s a  call. My first thought was maybe it’s implemented with a regex that’s convenient but not performant, but looking <a href=\"https://crystal-lang.org/api/1.18.2/HTML.html#escape%28string%3AString%29%3AString-class-method\">at the docs</a> and the code, that’s not the case, it uses a  to make replacements with by looking up each character in the string with its replacement in the hash.</p><p>The  revealed the real issue though,  takes a string and returns a new string with the escapes applied, and that new string has to be allocated. In my code I took that string and immediately dumped it into an :</p><div><div><pre><code></code></pre></div></div><p>Look at that, I’m using the wrong API! That’s convenient, but it would be better if  would write directly into  instead of allocating its own buffer. Well that’s what <code>HTML.escape(string : String, io : IO)</code> does, and it’s trivial to swap:</p><div><div><pre><code></code></pre></div></div><p>Re-profiled, and that section is gone from the trace. Easy.</p><p>Removing the non- API isn’t a good move here, since you’ll just encourage people to do this:</p><div><div><pre><code></code></pre></div></div><p>Since what they  right now is a , not a lecture about why not to allocate short-lived buffers.</p><p>The second thing that stood out were calls to <code>IO::Memory#increase_capacity_by</code>.  is a dynamically-sized in-memory buffer, and the default capacity (as of Crystal 1.18.2) is just 64 bytes. When a write would exceed the size of the buffer, the capacity is increased to the next power of two with , so as soon as we write our 65th byte, it’ll be increased to 128 bytes.</p><p>The response of a somewhat small status page is just under 5000 bytes,  so—assuming a bunch of small writes to the buffer—it will have to be expanded seven times. Since we know the response is going to be at least a few kilobytes (the template with no content is 1kB), setting the initial size to 4kB avoids having to do 6 reallocations.</p><p>In the end this is a non-issue, because the code is so low-traffic and already very performant. As <a href=\"https://willhbr.net/2023/07/09/limited-languages-foster-obtuse-apis/\">I’ve written before</a> I don’t like the somewhat superstitious approach of limiting language features because someone might mis-use them. Slow code can come from anywhere, and you have to actually look for it. You can see the changes I actually made to the status page library <a href=\"https://codeberg.org/willhbr/status_page/commit/d312441c2ae93d270fd6fd615db5828273a4145b\">in this commit</a>.</p><p>On the other hand, there is an opportunity for languages to enable library authors to guide their API use. Most languages have (either builtin or through a linter) a way of annotating that the return value from a function shouldn’t be ignored. In Rust this is the  tag.</p><p>What could be neat is a system for attaching metadata to objects at compile time that could be read later in the compile step. So the  method could attach a bit of information that says the string it returns could be directly written to an . Then if that object is passed to  (or  or whatever) it could check that attribute and provide a warning.</p><p>This would fit in with Crystal’s existing macro system, but I’m sure it would explode the complexity of the compiler and make compilation much slower.</p>","contentLength":4812,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45918016"},{"title":"Zeroing in on Zero-Point Motion Inside a Crystal","url":"https://physics.aps.org/articles/v18/178","date":1762809424,"author":"lc0_stein","guid":57,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45881056"},{"title":"Crystal Forge: Compliance-First NixOS Fleet Management","url":"https://crystalforge.us/","date":1762804788,"author":"UlyssesZhan","guid":56,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45880205"},{"title":"Crystal 1.18.0 Is Released","url":"https://crystal-lang.org/2025/10/14/1.18.0-released/","date":1762752328,"author":"ksec","guid":55,"unread":true,"content":"<p>We are announcing a new Crystal release 1.18.0 with several new features and bug\nfixes.</p><p>This release includes <a href=\"https://github.com/crystal-lang/crystal/pulls?q=is%3Apr+milestone%3A1.18.0\">172 changes since\n1.17.1</a>\nby 31 contributors. We thank all the contributors for all the effort put into\nimproving the language! ❤️</p><p>Below we list the most remarkable changes in the language, compiler and stdlib.\nFor more details, visit the <a href=\"https://github.com/crystal-lang/crystal/releases/tag/1.18.0\">full\nchangelog</a>.</p><p>We do not expect any breaking changes in existing code. If you notice any\nunexpected issues, please let us know in the <a href=\"https://github.com/crystal-lang/crystal/issues\">issue tracker</a> or <a href=\"https://forum.crystal-lang.org/\">forum</a>.</p><p>Execution contexts from <a href=\"https://github.com/crystal-lang/rfcs/pull/2\">RFC 0002</a> continue as a preview feature with opt-in\nwith compiler flags <code>-Dpreview_mt -Dexecution_context</code>. It might move out of\npreview in the next release.</p><p>The preview of synchronization primitives in <a href=\"https://github.com/ysbaddaden/sync/\"></a> has seen some\nimprovements as well.</p><p>Deprecation warnings are now available on types and aliases (<a href=\"https://github.com/crystal-lang/crystal/issues/15962\">#15962</a>) as well\nas individual method parameters (<a href=\"https://github.com/crystal-lang/crystal/issues/15999\">#15999</a>).\nDeprecated types only trigger warnings when they are actually  (e.g.\ncalling a class method), not when they’re just part of a type restriction, for\nexample.\nDeprecated parameters only trigger a warning when the particular parameter is\nused in a call. Calls without this parameter are unaffected.</p><div><div><pre><code></code></pre></div></div><p>The format of <a href=\"https://crystal-lang.org/api/1.18.0/Time.html#inspect(io:IO,with_nanoseconds=true):Nil-instance-method\"></a> has been adjusted slightly to align with the Internet\nExtended Date/Time Format (IXDTF) defined in <a href=\"https://datatracker.ietf.org/doc/html/rfc9557\">RFC 9557</a> (<a href=\"https://github.com/crystal-lang/crystal/issues/16039\">#16039</a>).</p><p>Changes from the previous format:</p><ul><li>Replace  location by  offset</li><li>Skip zero nanoseconds entirely even when  is true (see https://github.com/crystal-lang/crystal/pull/16039#discussion_r2250863021)</li><li>Remove whitespace between time and offset</li><li>Wrap location in square brackets to indicate an IXDTF time-zone suffix</li></ul><p>Some examples show the differences:</p><div><div><pre><code></code></pre></div></div><p>The local Windows system time zone now uses the canonical IANA name (<a href=\"https://github.com/crystal-lang/crystal/issues/15967\">#15967</a>).</p><p>The output of <a href=\"https://crystal-lang.org/api/1.18.0/JSON/Any.html#inspect(io:IO):Nil-instance-method\"></a> got a wrapper to indicate\nthe  type and differentiate from the wrapped type (<a href=\"https://github.com/crystal-lang/crystal/issues/15979\">#15979</a>).\nThe equivalent for  is still pending.</p><div><div><pre><code></code></pre></div></div><p>The private constructors of  moved into the \nhook (<a href=\"https://github.com/crystal-lang/crystal/issues/16147\">#16147</a>). They’re now defined on the including types which is more robust\nin terms of  overload ordering. This also allows referring generic\ntype variables inside converters.</p><p><a href=\"https://crystal-lang.org/api/1.18.0/Colorize.html\"></a> now uses scoped ANSI reset codes which only reset the respective\nproperty, instead of resetting  (<a href=\"https://github.com/crystal-lang/crystal/issues/16052\">#16052</a>).</p><p>We added type restrictions to many API methods. This improves the documentation.\nThis is a semi-automatic effort, assisted by a tool that automatically extracts\ntyping information from the semantic analysis of a program (<a href=\"https://github.com/crystal-lang/crystal/issues/15682\">#15682</a>).</p><p>Multi-line strings containing source code in compiler specs have had two\ndifferent formats: Some of them were using regular string literals, others used\nheredocs. The latter was usually preferred in new code additions because\nline numbers and indents are more sensible. And with an appropriate heredoc\nidentifier to denote the language, we even get nested syntax highlighting.\nIn this release we’ve converted all compiler specs to use heredocs\n(<a href=\"https://github.com/crystal-lang/crystal/issues/11291\">#11291</a>).</p><p>With the help of , we’ve enabled and applied a couple more linter rules:\n (<a href=\"https://github.com/crystal-lang/crystal/issues/16010\">#16010</a>),  (<a href=\"https://github.com/crystal-lang/crystal/issues/16011\">#16011</a>), and\n (<a href=\"https://github.com/crystal-lang/crystal/issues/16014\">#16014</a>).</p><p>The compiler can dump type information to a JSON file when the environment\nvariable  is set (<a href=\"https://github.com/crystal-lang/crystal/issues/16027\">#16027</a>).</p><p>Resolve types when guessing return type from class method overloads (<a href=\"https://github.com/crystal-lang/crystal/issues/16118\">#16118</a>).</p><p>In the following snippet, the compiler is able to infer ’s type to be , since both overloads of  have a return type of :</p><div><div><pre><code></code></pre></div></div><p>Guess instance variable types from global method calls (<a href=\"https://github.com/crystal-lang/crystal/issues/16119\">#16119</a>).</p><p>This allows the following to compile:</p><div><div><pre><code></code></pre></div></div><p>The call needs to be global; other than that, type guessing for top-level methods has the same limitations as for class methods.</p><p>Hash literals are evaluated from left to right, fixing a regression from 1.6.0 (<a href=\"https://github.com/crystal-lang/crystal/issues/16124\">#16124</a>).</p><p>Temporary variables are now grouped by file name in order to increase the chance\nof reusing previous macro expansions (<a href=\"https://github.com/crystal-lang/crystal/issues/16122\">#16122</a>).</p><ul><li>Fully exit the process on  from REPL (<a href=\"https://github.com/crystal-lang/crystal/issues/16171\">#16171</a>)</li><li>Fixed interpreter hanging on the signal pipe (<a href=\"https://github.com/crystal-lang/crystal/issues/16167\">#16167</a>)</li></ul><ul><li>Support for LLVM 21.1 and 22.0 (<a href=\"https://github.com/crystal-lang/crystal/issues/16062\">#16062</a>)</li><li>Update Unicode to 17.0.0 (<a href=\"https://github.com/crystal-lang/crystal/issues/16160\">#16160</a>)</li></ul><div><p>We have been able to do all of this thanks to the continued support of\n <a href=\"https://www.84codes.com/\">84codes</a> and every other <a href=\"https://crystal-lang.org/sponsors\">sponsor</a>.  To\n maintain and increase the development pace, donations and sponsorships are\n essential.  <a href=\"https://opencollective.com/crystal-lang\">OpenCollective</a> is\n available for that.</p><p>Reach out to <a href=\"mailto:crystal@manas.tech\">crystal@manas.tech</a> if you’d like to\n become a direct sponsor or find other ways to support Crystal. We thank you in\n advance!</p><a href=\"https://crystal-lang.org/sponsors#contribute\">Contribute</a></div>","contentLength":4293,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45872727"},{"title":"Through the Crystal Ball of VC Florian Graillot","url":"https://insurtechamsterdam.com/public/blog/insurance-innovation","date":1762074742,"author":"Venesha","guid":54,"unread":true,"content":"<h6><i>Today, we sit down with Florian Graillot, a leading voice in the insurtech ecosystem and Founder of AstoryaVC, a specialist venture capital fund dedicated to transforming the insurance industry. \n\nFlorian shares his perspective on how Insurtech has evolved — from early digital distribution models to today’s AI-driven, B2B, and embedded solutions. He discusses the changing expectations for startups and how collaboration between incumbents and innovators is shaping the next phase of insurance transformation.</i></h6><h2>Looking back at the first wave of Insurtech, what stands out most—the successes, the failures, or the lessons that shaped where the industry is today?</h2><p>That’s a very fair question as the hashtag InsurTech recently turned 10 ! Based on all investments announced across Europe in insurance technology, I’d say there are several trends to keep in mind.</p><p>The first one is that most startups from that initial wave of InsurTech were addressing the ‘distribution’ part of the value chain. Since inception, over half of all rounds announced were in that section. Most players were even distributing directly to end customers (B2C or B2SME) while another significant part of funding went to full-stack players (startups operating under an insurance license).</p><p>Since the second half of 2022, things have changed.</p><p>Investors are currently fueling a broader range of startups, either embracing different distribution models (e.g. ‘embedded insurance’) or addressing other sections of the value chain. I think about the ‘product’ part where more startups are leveraging technology to build resilience and tackle emerging risks (including climate or cyber for instance). And a growing number of players have embraced a B2B positioning, meaning they are developing technology for incumbents.</p><p>Ultimately, several leaders have emerged as the VC market has pivoted from “growth at all costs” to “profitable growth”. Several startups have indeed reached profitability while they have reached great milestones. There are several players on the market with over 500,000 customers - even close to 1m ! -, generating hundreds of millions of Gross Written Premium per year. In the UK, I think about Marshmallow selling car insurance in the UK ; I France I would refer to Alan selling health insurance, Acheel a multi-product full-stack InsurTech or Descartes Underwriting doing parametric weather (and cyber) insurance ; in Germany, Getsafe is selling many B2C insurance products.</p><p>Long story short, the first wave of insurance innovation is very biased towards two single business models (D2C and full-stack) while several players have clearly emerged, and insurance innovation is more business diverse than ever, getting closer to the insurance core engine.</p><h2>As incumbents increasingly integrate AI-driven underwriting and claims automation, do you see space for pure-play Insurtech disruptors, or is the future more about partnerships and embedded models?</h2><p>AI is a buzzword. But it’s also a reality. Since the beginning of this year, a third of all deals announced in InsurTech Europe were AI-first players ! There are two trends currently structuring the market. Several players are doing “AI in insurance” and building a product or use-case while teaming up together with their insurance customers &amp; partners. Other players are focusing on a single use-case. In the first scenario, we see shorter sales cycles but I’m wondering how to demonstrate a clear RoI with unclear use-case scenarios (up-front). In the second category, sales cycles are similar to those enjoyed in Enterprise software but the RoI can easily be demonstrated as the value proposition is clearly detailed upfront. Let’s see if both categories remain on the market or if one takes the lead in the near future. Anyway, incumbents do initiate many AI projects and there is a real diversity in terms of business models. Almost all of the value chain is under threat. Though, claim management is the clear leader. Underwriting and product design are a growing trend though less players are active on these sections of the value chain (so far).</p><h2>From your vantage point, what are the most pressing risks Insurtechs should be tackling today—regulatory, technological, or macroeconomic? And how do new challenges like electric vehicles, cyber threats, climate change, and digital assets shift that risk landscape?</h2><p>I see three major challenges for insurers in the near future. The first one is how to keep growing while inflation is going down (assuming it led to a massive price surge in the last few years, which drove revenues growth). The second challenge is around operational efficiency. Many players are even raising it publicly. And technology could definitely help. Many B2B InsurTech are already offering their services to incumbents ! Last but not least, new risks are emerging and threatening existing business lines or unlocking new ones. I think about climate, cyber, the switch to electric vehicles, financial fraud &amp; sams, health wellbeing &amp; longevity.</p><h2>Home insurance has become unprofitable in some markets due to climate risk. How can technology help insurers keep coverage affordable while remaining sustainable as businesses?</h2><p>In the US for instance, several players have indeed left local markets. This is not sustainable. Neither in an economic standpoint - revenues are down for these players - nor societally speaking - how to live in a non-insured World ?! In addition, in Europe for instance, several players faced a tough financial year when natural catastrophes pilled while they had a great financial year when the climate was smoother. Such a dependence on climate &amp; natural events, is not sustainable either for incumbents. This is probably why we are spotting so many players exploring how technology (data, algorithms) could help better understand, assess and price these risks. I’m even wondering if, in several locations, climate insurance might become a must have on top of - or instead of - home insurance. And beyond pure insurance it might be a matter of expanding the risk value chain with prevention, risk assessment and resilience.</p><h2>2021 was the peak for VC funding in Insurtech, followed by a steep drop mirroring Fintech and VC globally. How has this climate changed the way startups should position themselves? And what separates those able to raise late-stage capital from those that stall after early traction?</h2><p>You’re right, the VC market has pivoted from “growth at all costs” to “profitable growth”. Startups need to show figures earlier in their journey and should demonstrate their capacity to make money. This may sound obvious but it’s challenging in the insurance industry. First, you need to sell insurance in a profitable way meaning that premium generated should cover claims with a margin ! Then you need to distribute these products - or a tech you have developed - in a profitable way, meaning you should earn more than what it costs you to find customers. Ultimately, a company could consider being profitable if other expenses enable it.</p><p>Whatever the positioning (selling technology to incumbent or selling insurance products to end customers) startups now need to keep that in mind and not necessarily reached profitability in the short term - investors are here to finance the first customers - but demonstrate they have a resilient business model !</p><h2>Are you seeing a shift in how Insurtech VCs evaluate customer acquisition models—particularly in the SME space where conversion cycles are longer and more costly?</h2><p>I would refer to the famous CAC/LTV ratio in the VC industry. This compares potential revenues (LTV) with how much it costs to sign these customers (CAC). And, as mentioned above, both startups selling insurance or technology should think this way and demonstrate their resilience in that background. The SME space might sound particularly challenging as it combines downfalls: small customers - compared to Enterprise customers - but still professional players, meaning a long sales cycle (compared to B2C). But startups selling insurance to SME - or operating in the SME insurance space - have long been a model in the InsurTech space : regularly there are new entrants, and at a later stage, +Simple is now under Private Equity ownership !</p><h2>Where do you see the greatest impact of Insurtechs on insurers: driving revenue growth, reducing operating costs, or lowering claims expenses? Which of these areas still holds the most untapped potential?</h2><p>Things have evolved over the years. In the D2C space, InsurTech 1.0 claimed it would replace incumbents. If several players have reached significant milestones, things are more balanced and we see more partnerships between corporates and startups.</p><p>In the B2B space, things have always been more balanced. A lot has been explored in claim management - targeting operational efficiency, but fraud is a regular use-case too (which has an impact on claim expenses. And the more the ecosystem matures, the more startups get close to the insurance core engine (risk assessment &amp; pricing). This might have an impact on the loss ratio.</p><p>In addition, tech-enabled MGA are leveraging technology (data, algorithms, …) to better address vertical niches. These players may be growth opportunities for insurers they are working with.</p><p>Overall, tech startups have various impacts on the insurance business. Which makes sense as every section of the value chain and every business line is under innovation threat. There is nowhere in the market where startups are not exploring how to improve - or revamp - how insurance is done !</p><h2>Europe’s Insurtech scene is often described as dominated by France, Germany, and the UK. Which other regions or markets across the continent are underestimated right now?</h2><p>Actually the InsurTech ecosystem is vibrant across Europe. It’s true the UK and France are clear leaders - in terms of rounds announced - while Germany is slightly below what it should be (based on the FinTech comparable for instance). But beyond these three largest ecosystems, many others are worth it. And that’s something we advise to board members we meet: you should keep an eye on what is happening beyond your domestic market, wherever you are based in Europe. Spain has long been very active, Italy is gaining momentum recently, the Nordics enjoy regular InsurTech players, while Benelux has already famous names on its ground (think of Qover in Belgium, Friss in the Netherlands or Ibisa Insurance in Luxembourg). Eastern Europe is very active too, with very strong teams. And you may remember that Quantee - from Poland - got acquired by Guidewire in the first half of 2025 !</p><h2>If insurers truly have less useful customer data than tech platforms or Big Tech, is there a future where those platforms dominate insurance distribution? And what’s the single biggest mindset shift incumbents need to make to benefit from this second wave of innovation rather than be left behind?</h2><p>I really enjoy that topic. On one hand, I remember the early days of InsurTech when the market spoke about “the Uber of insurance”. Then, Google or Amazon gave it a try to insurance and resumed their initiatives. These failed attempts seemed like tech giants could not enter insurance. In the meantime, several have done great in Financial Services (e.g. banking). And beyond these few players - the tech giants - there are plenty of vertical platforms which have significant customer bases in their niche. These players are highly relevant to push insurance to their customers. And actually many already offer insurance solutions. This is enabled by InsurTech players operating in the “embedded insurance” field. They have developed technology enabling any third party to become an insurance distributor. Which scale could these players reach? This is another question. Let’s have a look at eCommerce figures: it accounts for ~30% of all retail spendings. Online insurance distribution might reach such a market share in the future. Embedded insurance is one way to do it, alongside direct distribution. Let’s see where it lands. At least, I doubt insurance could be the only industry worldwide to remain fully offline…</p><h2>Looking ahead, what’s the single biggest mindset shift incumbents need to make if they want to benefit from this second wave of insurance innovation rather than be left behind?</h2><p>I would refer to the “make or buy” dilemma.</p><p>This is a real pattern I’ve spotted while investing in InsurTech for 10 years (first at AXA Ventures, then at astoryaVC). Incumbents tend to make things first. Whatever the tech trend (note this applies well to the current AI wave). For many reasons - starting with the challenge to attract, and most of all to keep, tech talents - incumbents often fail in their internal initiatives. Ultimately, they come back to the market and partner / buy an external solution. This means there is one way to take the lead and stay 24 to 36 months ahead of your competitors: go directly to external solutions.</p><p>Of course, there is no one-size-fits-all rule. It’s a matter of choosing the right path: “make” where you do have a competitive advantage ; “buy” elsewhere. Too often, the market tends to “make” on every topic. This should be more balanced. Fortunately, the market is big enough to see several incumbents “buy”, building a competitive advantage by teaming up together with a startup on a specific use-case !</p>","contentLength":13464,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45788934"},{"title":"Inside an Isotemp OCXO107-10 Oven Controlled Crystal Oscillator","url":"https://tomverbeure.github.io/2025/10/26/Inside-an-Isotemp-OCXO107-10.html","date":1761600946,"author":"zdw","guid":53,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45726597"},{"title":"Inside an Isotemp OCXO107-10 Oven Controlled Crystal Oscillator","url":"https://tomverbeure.github.io/2025/10/26/Inside-an-Isotemp-OCXO107-10.html","date":1761560244,"author":"thomasjb","guid":52,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45719250"},{"title":"A Closer Look at Piezoelectric Crystal","url":"https://www.samaterials.com/content/a-closer-look-at-stressed-piezo-crystals.html","date":1761149536,"author":"pillars","guid":51,"unread":true,"content":"<div>\n                        Last updated on {{lastDate}}                    </div><h2></h2><p align=\"center\"><strong></strong></p><h2></h2><p align=\"center\"><strong></strong></p><h2></h2><p align=\"center\"><strong></strong></p><h2></h2><p align=\"center\"><strong></strong></p><h3></h3><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><h3></h3><h3></h3><h2></h2><p align=\"center\"><strong></strong></p><p align=\"center\"><strong></strong></p><h3></h3><p align=\"center\"><strong></strong></p><p>²</p><p align=\"center\"><strong></strong></p><h3></h3><p align=\"center\"><strong></strong></p><h3></h3><p align=\"center\"><strong></strong></p>","contentLength":75,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45671336"},{"title":"From Raw Crystal to Crystal Oscillator – Crystals Go to War in 1943","url":"https://www.youtube.com/watch?v=duZlWWwxIPQ","date":1760979902,"author":"akshatjiwan","guid":50,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45646299"},{"title":"Crystal 1.18.0 Is Released","url":"https://crystal-lang.org/2025/10/14/1.18.0-released/","date":1760538644,"author":"sdogruyol","guid":49,"unread":true,"content":"<p>We are announcing a new Crystal release 1.18.0 with several new features and bug\nfixes.</p><p>This release includes <a href=\"https://github.com/crystal-lang/crystal/pulls?q=is%3Apr+milestone%3A1.18.0\">172 changes since\n1.17.1</a>\nby 31 contributors. We thank all the contributors for all the effort put into\nimproving the language! ❤️</p><p>Below we list the most remarkable changes in the language, compiler and stdlib.\nFor more details, visit the <a href=\"https://github.com/crystal-lang/crystal/releases/tag/1.18.0\">full\nchangelog</a>.</p><p>We do not expect any breaking changes in existing code. If you notice any\nunexpected issues, please let us know in the <a href=\"https://github.com/crystal-lang/crystal/issues\">issue tracker</a> or <a href=\"https://forum.crystal-lang.org/\">forum</a>.</p><p>Execution contexts from <a href=\"https://github.com/crystal-lang/rfcs/pull/2\">RFC 0002</a> continue as a preview feature with opt-in\nwith compiler flags <code>-Dpreview_mt -Dexecution_context</code>. It might move out of\npreview in the next release.</p><p>The preview of synchronization primitives in <a href=\"https://github.com/ysbaddaden/sync/\"></a> has seen some\nimprovements as well.</p><p>Deprecation warnings are now available on types and aliases (<a href=\"https://github.com/crystal-lang/crystal/issues/15962\">#15962</a>) as well\nas individual method parameters (<a href=\"https://github.com/crystal-lang/crystal/issues/15999\">#15999</a>).\nDeprecated types only trigger warnings when they are actually  (e.g.\ncalling a class method), not when they’re just part of a type restriction, for\nexample.\nDeprecated parameters only trigger a warning when the particular parameter is\nused in a call. Calls without this parameter are unaffected.</p><div><div><pre><code></code></pre></div></div><p>The format of <a href=\"https://crystal-lang.org/api/1.18.0/Time.html#inspect(io:IO,with_nanoseconds=true):Nil-instance-method\"></a> has been adjusted slightly to align with the Internet\nExtended Date/Time Format (IXDTF) defined in <a href=\"https://datatracker.ietf.org/doc/html/rfc9557\">RFC 9557</a> (<a href=\"https://github.com/crystal-lang/crystal/issues/16039\">#16039</a>).</p><p>Changes from the previous format:</p><ul><li>Replace  location by  offset</li><li>Skip zero nanoseconds entirely even when  is true (see https://github.com/crystal-lang/crystal/pull/16039#discussion_r2250863021)</li><li>Remove whitespace between time and offset</li><li>Wrap location in square brackets to indicate an IXDTF time-zone suffix</li></ul><p>Some examples show the differences:</p><div><div><pre><code></code></pre></div></div><p>The local Windows system time zone now uses the canonical IANA name (<a href=\"https://github.com/crystal-lang/crystal/issues/15967\">#15967</a>).</p><p>The output of <a href=\"https://crystal-lang.org/api/1.18.0/JSON/Any.html#inspect(io:IO):Nil-instance-method\"></a> got a wrapper to indicate\nthe  type and differentiate from the wrapped type (<a href=\"https://github.com/crystal-lang/crystal/issues/15979\">#15979</a>).\nThe equivalent for  is still pending.</p><div><div><pre><code></code></pre></div></div><p>The private constructors of  moved into the \nhook (<a href=\"https://github.com/crystal-lang/crystal/issues/16147\">#16147</a>). They’re now defined on the including types which is more robust\nin terms of  overload ordering. This also allows referring generic\ntype variables inside converters.</p><p><a href=\"https://crystal-lang.org/api/1.18.0/Colorize.html\"></a> now uses scoped ANSI reset codes which only reset the respective\nproperty, instead of resetting  (<a href=\"https://github.com/crystal-lang/crystal/issues/16052\">#16052</a>).</p><p>We added type restrictions to many API methods. This improves the documentation.\nThis is a semi-automatic effort, assisted by a tool that automatically extracts\ntyping information from the semantic analysis of a program (<a href=\"https://github.com/crystal-lang/crystal/issues/15682\">#15682</a>).</p><p>Multi-line strings containing source code in compiler specs have had two\ndifferent formats: Some of them were using regular string literals, others used\nheredocs. The latter was usually preferred in new code additions because\nline numbers and indents are more sensible. And with an appropriate heredoc\nidentifier to denote the language, we even get nested syntax highlighting.\nIn this release we’ve converted all compiler specs to use heredocs\n(<a href=\"https://github.com/crystal-lang/crystal/issues/11291\">#11291</a>).</p><p>With the help of , we’ve enabled and applied a couple more linter rules:\n (<a href=\"https://github.com/crystal-lang/crystal/issues/16010\">#16010</a>),  (<a href=\"https://github.com/crystal-lang/crystal/issues/16011\">#16011</a>), and\n (<a href=\"https://github.com/crystal-lang/crystal/issues/16014\">#16014</a>).</p><p>The compiler can dump type information to a JSON file when the environment\nvariable  is set (<a href=\"https://github.com/crystal-lang/crystal/issues/16027\">#16027</a>).</p><p>Resolve types when guessing return type from class method overloads (<a href=\"https://github.com/crystal-lang/crystal/issues/16118\">#16118</a>).</p><p>In the following snippet, the compiler is able to infer ’s type to be , since both overloads of  have a return type of :</p><div><div><pre><code></code></pre></div></div><p>Guess instance variable types from global method calls (<a href=\"https://github.com/crystal-lang/crystal/issues/16119\">#16119</a>).</p><p>This allows the following to compile:</p><div><div><pre><code></code></pre></div></div><p>The call needs to be global; other than that, type guessing for top-level methods has the same limitations as for class methods.</p><p>Hash literals are evaluated from left to right, fixing a regression from 1.6.0 (<a href=\"https://github.com/crystal-lang/crystal/issues/16124\">#16124</a>).</p><p>Temporary variables are now grouped by file name in order to increase the chance\nof reusing previous macro expansions (<a href=\"https://github.com/crystal-lang/crystal/issues/16122\">#16122</a>).</p><ul><li>Fully exit the process on  from REPL (<a href=\"https://github.com/crystal-lang/crystal/issues/16171\">#16171</a>)</li><li>Fixed interpreter hanging on the signal pipe (<a href=\"https://github.com/crystal-lang/crystal/issues/16167\">#16167</a>)</li></ul><ul><li>Support for LLVM 21.1 and 22.0 (<a href=\"https://github.com/crystal-lang/crystal/issues/16062\">#16062</a>)</li><li>Update Unicode to 17.0.0 (<a href=\"https://github.com/crystal-lang/crystal/issues/16160\">#16160</a>)</li></ul><div><p>We have been able to do all of this thanks to the continued support of\n <a href=\"https://www.84codes.com/\">84codes</a> and every other <a href=\"https://crystal-lang.org/sponsors\">sponsor</a>.  To\n maintain and increase the development pace, donations and sponsorships are\n essential.  <a href=\"https://opencollective.com/crystal-lang\">OpenCollective</a> is\n available for that.</p><p>Reach out to <a href=\"mailto:crystal@manas.tech\">crystal@manas.tech</a> if you’d like to\n become a direct sponsor or find other ways to support Crystal. We thank you in\n advance!</p><a href=\"https://crystal-lang.org/sponsors#contribute\">Contribute</a></div>","contentLength":4293,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45593192"}],"tags":["HN","hn"]}