{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Indian court rules trans women are women and ‘legally entitled to recognition’","url":"https://www.thepinknews.com/2025/06/26/india-trans-women-high-court-decision/","date":1750950601,"author":"/u/FlyingScript","guid":643,"unread":true,"content":"<p>A court in India has decreed that trans women are women.</p><p>In a landmark ruling for the country, after rejecting claims that womanhood was preserved only for those who can bear children, the High Court of Andhra Pradesh ruled that trans women were “legally entitled” to recognition as women.</p><p>Presiding over the case, justice Venkata Jyothirmai Pratapa decided that tying the definition of women to pregnancy was “legally unsustainable” and contradicted India’s constitution, which emphasises equality before the law.</p><p>Quoting a Supreme Court decision from 2014, which legally recognised the rights of “third gender” individuals, Pratapa said that prohibiting trans women’s right to identify as women “amounted to discrimination”.</p><p>The case was brought to the high court in 2022 after transgender woman Pokala Shabana looked to use a section of the Indian penal code to seek protection from her in-laws, whom, she said, had been <a href=\"https://www.thepinknews.com/2023/08/29/india-trans-women-arrested/\">abusive</a> towards her.</p><p>Her husband’s parents petitioned the court to deny her use of Section 498A, which protects women from cruelty by a husband or relatives, arguing that it only applied to cisgender women. They claimed that trans women don’t meet the legal definition of women under Indian law because they cannot get pregnant and said Shabana’s allegations of harassment lacked evidence.</p><p>However, the judge said that articles 14, 15 and 21 of the constitution, which guarantee a variety of discrimination protections, including the right to life and personal liberty, meant trans women’s rights to be recognised as women superseded the law.</p><p>“A trans woman, born male and later transitioning to female, is legally entitled to recognition as a woman,” he wrote in his ruling. “Denying such protection by questioning their womanhood amounts to discrimination.”</p><p>Trans activist and artist Kalki Subramaniam told <a href=\"https://www.washingtonblade.com/2025/06/25/indian-court-rules-a-transgender-woman-is-a-woman/\">the Washington Blade</a> that she was relieved and delighted to see the court “upholding our basic human right to be identified as what we want.” She went on to say: “For [the] transgender community, especially trans women, this verdict means a lot.”</p><p>The Indian government has been under mounting pressure to <a href=\"https://www.thepinknews.com/2023/10/17/india-supreme-court-same-sex-marriage/\">modernise its laws</a> and policies on LGBTQ+ rights. Same-sex marriage is still illegal, despite growing support for its legalisation.</p><p>Prime minister Narendra Modi’s government have previously labelled same-sex marriage an “<a href=\"https://www.thepinknews.com/2023/04/18/india-same-sex-marriage-supreme-court-government/\">elitist</a>” viewpoint that “seriously affects the interests of every citizen”.</p><p>An affidavit establishing the government’s views on same-sex unions, in 2023, proclaimed that marriage was valid only between “biological males and females [and that] this definition [was] socially, culturally and legally ingrained into the very idea and concept of marriage and ought not to be disturbed or diluted by judicial interpretation”.</p><p>Let us know in the comments below, and remember to keep the conversation respectful.&nbsp;&nbsp;</p>","contentLength":2916,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ll2ljj/indian_court_rules_trans_women_are_women_and/"},{"title":"Cocaine use and production hits record high","url":"https://www.rte.ie/news/world/2025/0626/1520402-cocaine-un-report/","date":1750937737,"author":"/u/JONFER---","guid":648,"unread":true,"content":"<p>Cocaine production, seizures and use all hit record highs in 2023, the UN drug agency said, with the illicit drug's market the world's fastest-growing.</p><p>Illegal production jumped to 3,708 tonnes, nearly 34% more than in 2022, and more than four times higher than ten years earlier, when it was at a low, the Vienna-based UN Office on Drugs and Crime (UNODC) said in its annual report.</p><p>The current surge is mainly due to an increase in the size of the area under illicit coca bush cultivation in Colombia and updated yield data, it added.</p><p>Global cocaine seizures, too, recorded a high of 2,275 tonnes, marking a 68% rise in the four years to 2023.</p><p>The number of cocaine users also grew to 25 million in 2023, up from 17 million, ten years earlier.</p><p>\"Cocaine has become fashionable for the more affluent society,\" UNODC chief researcher Angela Me said, noting a \"vicious cycle\" of increased use and production.</p><p>While Colombia remains the key producer, cocaine traffickers are breaking into new markets across Asia and Africa, according to the report, with organised crime groups from the Western Balkans increasing their influence.</p><p>\"North America, Western and Central Europe and South America continue to constitute the largest markets for cocaine, on the basis of the number of people who used drugs in the past year and on data derived from wastewater analysis.</p><p>\"A new era of global instability has intensified challenges in addressing the world drug problem, empowering organised crime groups and pushing drug use to historically high levels,\" UNODC noted.</p><p>In 2023, the percent of the people aged between 15 and 64 estimated to have used a drug was 6%, compared to 5.2% of the population in 2013.</p><p>Cannabis remains the most widely used drug.</p><p>Seizures of amphetamine-type stimulants reached a record high in 2023, making up almost half of all global seizures of synthetic drugs, followed by synthetic opioids, including fentanyl, UNODC said.</p><p>The leading drugs there were methamphetamine and amphetamine.</p><p>The fall of ruler Bashar al-Assad in Syria last December has \"created uncertainty around the future of the captagon trade\", UNODC added.</p><p>Earlier this month, Syria said authorities had seized all production facilities of the illicit stimulant, which became Syria's largest export under the Assad regime.</p><p>\"The latest seizure data from 2024 and 2025 confirm that captagon is continuing to flow - primarily to countries of the Arabian peninsula - possibly indicating the release of previously-accumulated stockpiles or continued production in different locations,\" UNODC said.</p>","contentLength":2558,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1lkxucx/cocaine_use_and_production_hits_record_high/"},{"title":"Putin’s henchmen now deeply ingrained at highest level of Slovakian government","url":"https://kyivinsider.com/putins-henchmen-now-deeply-ingrained-at-highest-level-of-slovakian-government/","date":1750929843,"author":"/u/manwhodream21","guid":642,"unread":true,"content":"<p>In April 2024, Ľuboš Blaha, the vice-chairman of Slovakia’s SMER party and deputy speaker of the National Council, <a href=\"https://www.facebook.com/share/v/1BBH1D5yMU/?mibextid=wwXIfr\">traveled to Moscow</a> for a publicized visit with Slutsky. Their meeting, along with others involving Russian intelligence chief Sergey Naryshkin and Communist Party leader Gennady Zyuganov, signaled more than symbolic alignment. Outside Russia’s Foreign Intelligence Service headquarters, Blaha declared, “<i>Slovaks and Russians are brothers</i>,” and described NATO as an aggressive force at fault for the war in Ukraine.</p><p>Blaha’s language mirrored standard Kremlin narratives, but his platform gave them an unusual level of legitimacy within a European Union member state. In Moscow, he posed for photos, praised Russian strength, and publicly called for “Slovak-Russian friendship,” even as Russian forces continued their invasion of Ukraine and targeted civilian infrastructure.</p><p>But it is not only public posturing that alarms observers. The VSquare report points to deeper concerns within the Slovak political system. One of Prime Minister Robert Fico’s key advisors, David Lindtner, is reportedly acting as an informal liaison between senior Slovak officials and Moscow-aligned actors. Lindtner, who has no public mandate in foreign affairs, has been described by national security sources as part of a “silent corridor” through which the Kremlin maintains influence over parts of the Slovak state.</p><p>Slutsky, a longtime figure in Kremlin diplomacy, has increasingly positioned himself as a bridge to fringe European figures willing to echo Russia’s preferred narratives. From German AfD leaders to French extremists, and now to Slovak officials, his pattern is clear: elevate allies who reject Western consensus and spread disinformation under the guise of diplomacy.</p><p>What makes the Slovak case especially dangerous, according to VSquare, is the normalization of these contacts. Unlike past far-right alliances with Moscow that existed outside power structures, SMER and its partners currently govern Slovakia. That means access to state intelligence, foreign policy briefings, and European decision-making channels.</p><p>The strategy is subtle but effective: turn EU member states into vectors for Kremlin narratives, and weaponize internal politics to splinter European resolve.</p><p>With Blaha amplifying Russian propaganda at home and Fico’s advisors engaging in opaque diplomacy abroad, Slovakia risks becoming a Trojan horse inside the European Union.</p><p>The VSquare report ends with a warning—this is not just about Slovakia. It is a case study in how Russian intelligence co-opts democratic institutions using ideology, relationships, and deniable influence. And unless it is confronted with transparency and resolve, it will not stop at Bratislava.</p>","contentLength":2776,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1lkvnki/putins_henchmen_now_deeply_ingrained_at_highest/"},{"title":"Trump's surprising exchange with Ukrainian reporter: 'Very upsetting'","url":"https://www.9news.com.au/world/donald-trump-ukraine-journalist-nato-press-conference-video/a72c63c4-ee3c-4ec9-a447-468510314b4a","date":1750925571,"author":"/u/javelin3000","guid":646,"unread":true,"content":"<div><div><a href=\"https://www.9news.com.au/world/donald-trump-update-nato-leaders-agree-to-hike-military-spending-and-restate-ironclad-commitment-to-collective-defence/e4d408f9-aec3-4a3b-915a-2cd95c1e7443\" target=\"_blank\" rel=\"nofollow\" title=\"NATO press conference.\"></a></div></div><div><div><strong><em></em></strong><a href=\"https://apps.apple.com/au/app/9news/id1010533727\" target=\"_blank\"></a><a href=\"https://play.google.com/store/apps/details?id=nineNewsAlerts.nine.com&amp;hl=en_AU&amp;pli=1\" target=\"_blank\"></a></div></div>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1lkul5k/trumps_surprising_exchange_with_ukrainian/"},{"title":"North Korea to open beach resort as Kim Jong Un bets on tourism","url":"https://www.bbc.com/news/articles/cy0w59r54w9o","date":1750921799,"author":"/u/Loki-L","guid":647,"unread":true,"content":"<div data-component=\"text-block\"><p>North Korea is opening a beach resort that its leader Kim Jong Un hopes will boost tourism in the secretive communist regime, state media reports.</p><p>Wonsan Kalma on the east coast will open to domestic tourists on 1 July, six years after it was due to be completed. It is unclear when it will welcome foreigners. </p><p>Kim grew up in luxury in Wonsan, where many of the country's elite have private villas, and has been trying to transform the town, which once hosted a missile testing site.</p><p>State media KCNA claims the resort can accomodate up to 20,000 visitors, occupying a 4km (2.5 mile) stretch of beach, with hotels, restaurants, shopping malls and a water park - none of which can be verified.</p></div><div data-component=\"text-block\"><p>Heavily sanctioned for decades for its nuclear weapons programme, North Korea is among the poorest countries in the world. It pours most of its resources into its military, monuments and landmarks - often in Pyongyang - that embellish the image and cult of the Kim family that has run the country since 1948.</p><p>Some observers say this is an easy way for Pyongyang to earn money. While foreign tourists are allowed in, tour groups largely tend to come from China and Russia,  countries with whom Pyongyang has long maintained friendly relations. </p><p>\"I was hoping this might signal a broader reopening to international tourism, but unfortunately, that doesn't seem to be the case for now,\" Rowan Beard, co-founder of Young Pioneer Tours, tells the BBC.</p><p>Tourism from overseas took a hit during the Covid pandemic, though, with the country closing its borders in early 2020. It did not scale back restrictions until the middle of 2023 and welcomed Russian visitors a year later.</p><p>It opened to more Western visitors in February, when tourists from the UK, France, Germany and Australia drove across the border from China. It <a target=\"_self\" href=\"https://www.bbc.com/news/articles/cjry1yz9qevo\">abruptly halted</a><a target=\"_self\" href=\"https://www.bbc.com/news/articles/cjry1yz9qevo\">tourism weeks later</a> without saying why.</p></div><div data-component=\"text-block\"><p>Some tour agencies are sceptical of Wonsan's appeal to foreigners. It is \"unlikely to be a major draw for most Western tourists\", Mr Beard says. </p><p>\"Key sites like Pyongyang, the DMZ, and other brutalist or communist landmarks will continue to be the main highlights for international visitors once broader tourism resumes.\"</p><p>However, Elliott Davies, director of Uri Tours, says North Korea holds a \"niche appeal\" for travellers drawn to unconventional destinations.</p><p>\"It's intriguing to experience something as familiar as a beach resort that's been shaped within the unique cultural context of North Korea.\"</p><p>KCNA described the Wonsan development as a \"great, auspicious event of the whole country\" and called it a \"prelude to the new era\" in tourism.</p><p>It was initially scheduled to open in October 2019, but ran into construction delays before the pandemic struck.</p><p>Kim attended a ceremony to celebrate its completion on 24 June, accompanied by his daughter, Kim Ju Ae, and wife Ri Sol Ju. It marked Ri's first public appearance since a New Year's Day event. </p><p>Russian ambassador Alexander Matsegora and embassy staff also attended.</p><p>Some tour operators expect the resort to be opened to Russian tourists, who are currently the only foreign nationals allowed into some parts of the country. </p><p>On Thursday, the two countries also reopened a direct passenger train route between their capitals after a five-year suspension because of the pandemic.</p></div>","contentLength":3284,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1lktn4w/north_korea_to_open_beach_resort_as_kim_jong_un/"},{"title":"Explosions Rock Moscow as 50 Drones Target Russian Regions, Vnukovo Flights Diverted","url":"https://www.kyivpost.com/post/55212","date":1750920818,"author":"/u/lustraze","guid":650,"unread":true,"content":"<p>Explosions were heard early Thursday morning, June 26, in <a href=\"https://www.kyivpost.com/topic/moscow\">Moscow</a> and the surrounding region, as Russian authorities reported a large-scale <a href=\"https://www.kyivpost.com/topic/drones\">drone</a> attack.</p><p>According to the Russian Telegram channel <a href=\"https://t.me/breakingmash/65508\">Mash</a>, blasts were heard in several areas, including Didovsk in the Istrinsky district, Zelenograd, and Moskovskiy in New Moscow.</p><p>“In just five minutes, at least five explosions were heard in the sky,” the channel reported.</p><p>Moscow Mayor Sergei Sobyanin said that air defenses had shot down two drones approaching the city.</p><p>In response, operations at Moscow’s Vnukovo Airport were temporarily restricted under the “Carpet” plan – a protocol activated during airborne threats. Five flights were rerouted to Sheremetyevo Airport, Mash added.</p><p>Later in the morning, <a href=\"https://t.me/mod_russia/54159\">Russia’s Defense Ministry</a> said its air defense systems had intercepted and destroyed 50 Ukrainian aircraft-type drones in total:</p><ul><li>11 over the Rostov region</li></ul><ul><li>6 over the Bryansk region</li></ul><ul><li>3 over the Belgorod region</li></ul><ul><li>3 over the Moscow region (including the two targeting Moscow)</li></ul><ul><li>2 over the occupied Crimea</li></ul><ul><li>1 each over Mordovia and the Kaluga region</li></ul><p>According to the Ukrainian <a href=\"https://t.me/kpszsu/37063\">Air Force</a>, from 10:00 p.m. on June 25 until the morning of June 26, Russian forces launched an attack on Ukraine using 41 Shahed strike drones and various types of simulator UAVs. The main targets were frontline areas in the Donetsk and Kharkiv regions.</p><p>“As of 08:00, air defenses had neutralized 24 enemy Shahed UAVs and other drones across the east, south, and north of the country. Eight were shot down with firepower, and 16 were suppressed or lost due to electronic warfare,” the report stated.</p><p>Hits of Russian attack drones were recorded in seven different locations.</p><p>Andriy Kovalenko, head of the National Security and Defense Council’s Center for Countering Disinformation, said the explosion struck the Atlant-Aero plant, which he described as an important part of Russia’s military-industrial complex.</p><p>According to Kovalenko, the plant manufactures key components for Orion combat drones, as well as electronic warfare systems and control technologies used in FPV strike drones and loitering munitions.</p><p>The attack came during a wave of Ukrainian drone strikes overnight, with Russian officials reporting drone activity across several regions, including Rostov, which borders Ukraine.</p><p>Russia’s Defense Ministry claimed its air defenses intercepted 22 drones over multiple areas, including the occupied Crimean Peninsula, and at least 7 over the Rostov region.</p><p>Rostov Governor Yuri Slyusar confirmed that the strike caused damage in Taganrog. He reported that two residential buildings, a sports complex, and a school had been affected. In the nearby city of Azov, a grain storage facility and an industrial site were also reportedly hit.</p><p>Drone warfare has become increasingly central in the conflict since Russia’s full-scale invasion in February 2022. Ukraine has concentrated its efforts on targeting Russian military infrastructure, while Moscow continues to carry out widespread drone, missile, and rocket attacks on Ukrainian civilian infrastructure, often using Iranian-made Shahed drones in combination with ballistic and cruise missiles.</p>","contentLength":3182,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1lktdyc/explosions_rock_moscow_as_50_drones_target/"},{"title":"Just three years to limit global warming to 1.5C, top scientists warn","url":"https://uk.news.yahoo.com/just-three-years-limit-global-135032248.html?guccounter=1","date":1750891192,"author":"/u/Mr--Clean--Ass-Naked","guid":649,"unread":true,"content":"<p><strong>EARTH could breach the 1.5C global warming limit in as little as three years, top scientists have warned.</strong></p><p>More than 60 of the world’s leading climate scientists said in a new report that countries are continuing to burn record amounts of fossil fuels while felling carbon-rich forests – leaving the international goal in peril, the BBC reports.</p><p>The report said that the global “carbon budget” – the amount of CO2 that can be emitted to give a 50% chance of keeping warming limited to 1.5C – had shrunk.</p><p>In 2020, scientists estimated that humanity could emit 500 billion more tonnes of CO2 for a 50% chance of breaching the limit.</p><p>This has now plunged to 130 billion. If emissions remain at their current rate – around 40 billion per year – that gives roughly three years before the “carbon budget” is spent.</p><p>The Paris Agreement, signed in 2015 by nearly 200 countries, set a target of limiting warming to 1.5C above temperatures set in the late 1800s before global industrialisation.</p><p>The current rate of global warming is 0.27C per decade, which is much faster than at any point in the Earth’s history.</p><p>If this keeps up, the planet will breach the 1.5C target by 2030.</p><p>Professor Piers Forster, lead author of the report and director of the Priestley Centre for Climate Futures at the University of Leeds, told the BBC: “Things are all moving in the wrong direction.</p><p>“We're seeing some unprecedented changes and we're also seeing the heating of the Earth and sea-level rise accelerating as well.”</p><p>There are hopes that CO2 can be sucked out of the atmosphere in a bid to reverse global warming, however scientists caution against seeing this as a solution.</p><p>Joeri Rogelj, professor of climate science and policy at Imperial College London, said: “For larger exceedance [of 1.5C], it becomes less likely that removals [of CO2] will perfectly reverse the warming caused by today's emissions.\"</p><p>The report found that the Earth’s “energy imbalance” – the rate at which extra heat accumulates in the climate system – is increasing.</p><p>Over the last decade or so, this rate of heating is more than doubled since the 1970s and 1980s and is 25% than in the 2000s and 2010s.</p><p>Dr Matthew Palmer of the UK <a href=\"https://www.thenational.scot/topics/met-office/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Met Office;elm:context_link;itc:0;sec:content-canvas\">Met Office</a> said this was a “very worrying number” over a&nbsp; short period of time.</p><p>Much of this extra heat – around 90% – is absorbed by the oceans, wrecking havoc on marine life and raising sea levels because ice melts.</p><p>While the warnings from the report are stark, its authors said that the rate of emissions increases appears to be slowing as new clean tech is being used.</p>","contentLength":2592,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1lkju0o/just_three_years_to_limit_global_warming_to_15c/"},{"title":"Europeans still aren't buying Teslas with sales drop in Europe for fifth month in a row","url":"https://abcnews.go.com/Business/wireStory/europeans-angry-musk-buying-cars-tesla-sales-drop-123203026?cid=social_twitter_abcn","date":1750890317,"author":"/u/IlustriousCoffee","guid":651,"unread":true,"content":"<p>Europeans still aren't buying Teslas with figures out Wednesday showing sales plunged for a fifth month in a row in May, a blow to investors who had hoped anger toward Elon Musk would have faded by now.</p><p>Tesla sales fell 28% last month in 30 European countries even as the overall market for electric vehicles expanded sharply, according to the European Automobile Manufacturers’ Association. The poor showing comes after Tesla's billionaire CEO had promised a <a data-testid=\"prism-linkbase\" href=\"https://apnews.com/article/tesla-elon-musk-ceo-doge-trump-qatar-76e38b748142268260a79bd72071f7f8\">“major rebound”</a> was coming last month, adding to a recent buying frenzy among investors.</p><p>They were selling on Wednesday, pushing the prices down more than 4% in early afternoon trading.</p><p>Musk had said Tesla was sure to get a boost once the company was done retooling its factories to produce a new version of its biggest seller, the Model Y. But that was finished months ago, and the new models are widely available. Investors are now hoping that a cheaper Tesla expected to be out later year will help reverse the sales decline. </p><p>Overall, battery electric vehicle sales rose 25% in Europe compared to a year earlier. The market for EVs was particularly strong in Germany, where Musk has <a data-testid=\"prism-linkbase\" href=\"https://apnews.com/article/tesla-musk-trump-doge-evs-protests-boycott-5f7bcec268d5e40b94c2d9db35198bbf\">angered potential buyers</a> by publicly supporting the far-right, anti-immigrant Alternative for Germany party in elections. Overall EV sales there leapt 45%.</p><p>China’s SAIC Motor was the big winner for the month with its European sales of EVs and other kinds of cars jumping 38%. That has allowed the company to leapfrog Tesla, which a year ago was selling more cars in the region.</p><p>SAIC sold 18,716 vehicles last month versus Tesla’s 8,729.</p><p>The sales drop for Tesla comes at a crucial time for the company as it <a data-testid=\"prism-linkbase\" href=\"https://apnews.com/article/tesla-selfdriving-robotaxis-musk-waymo-austin-autonomous-d50749e288dc50ceff44b8e6a4b64961\">launches a test run</a> of its driverless ‘robotaxis’ service in Austin, Texas. Musk says that if goes well, he expects to introduce the service in several other cities in quick succession and have as many as a million of the automated cabs on roads by the end of the year.</p><p>Reviews so far have been mostly good, but the service is limited to a dozen or so cars and some passengers have circulated videos of problems during their rides, including one showing a robotaxi <a data-testid=\"prism-linkbase\" href=\"https://apnews.com/article/musk-austin-robotaxis-incidents-tesla-autonomous-selfdriving-0e32a7613a6c41c20ce258dbc5ec2cba\">heading down a lane for opposing traffic</a>. </p><p>Federal traffic safety regulators said Tuesday they were looking into the videos.</p>","contentLength":2249,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1lkjhk3/europeans_still_arent_buying_teslas_with_sales/"},{"title":"CIA says intelligence indicates Iran's nuclear program severely damaged","url":"https://www.reuters.com/world/middle-east/cia-says-intelligence-indicates-irans-nuclear-program-severely-damaged-2025-06-25/","date":1750884708,"author":"/u/DravidVanol","guid":645,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1lkh6tx/cia_says_intelligence_indicates_irans_nuclear/"},{"title":"Ukraine Unveils Its Own “KAB” Glide Bombs—Finally Hits Back at Russian Tactics","url":"https://united24media.com/latest-news/ukraine-unveils-its-own-kab-glide-bombs-finally-hits-back-at-russian-tactics-9407","date":1750876186,"author":"/u/jackytheblade","guid":644,"unread":true,"content":"<p>Ukrainian engineers have developed a&nbsp;domestically produced glide bomb system that converts standard aerial bombs into long-range guided munitions, similar to&nbsp;Russia’s universal planning and correction module kit (UMPK). </p><p>According to&nbsp; on&nbsp;June 25, the system—nicknamed the Ukrainian KAB—is already undergoing test flights and achieving ranges up&nbsp;to&nbsp;60&nbsp;kilometers, with plans to&nbsp;extend it&nbsp;to&nbsp;80&nbsp;kilometers.</p><p>The project is&nbsp;being <a href=\"https://defence-ua.com/weapon_and_tech/ukrajinskij_kab_analog_umpk_vzhe_viprobovujetsja_ta_litaje_ale_potribni_groshi_na_prishvidshennja_rozrobki_video-19301.html\" rel=\"external noopener nofollow\" target=\"_blank\">led</a> by&nbsp;the Ukrainian design bureau “Medoid,” which confirmed the system has been successfully dropped from a&nbsp;Su-24 frontline bomber in&nbsp;level flight. </p><p>Developers intentionally replicated the exterior design of&nbsp;the Russian UMPK to&nbsp;reduce development time but note that the internal components differ, particularly in&nbsp;aiming for greater precision.</p><p>The glide kit, designed for use with 500&nbsp;kg&nbsp;bombs, includes domestically manufactured guidance and wing modules. According to&nbsp;Medoid’s representative, Oleg Vostrykh, the navigation system is&nbsp;Ukrainian-built, although tests are also being conducted with a&nbsp;navigation unit from a&nbsp;leading French manufacturer to&nbsp;improve resistance to&nbsp;electronic warfare. Some components, however, still need to&nbsp;be&nbsp;sourced from abroad.</p><p>At&nbsp;this stage, the system is&nbsp;capable of&nbsp;striking targets at&nbsp;60&nbsp;kilometers, matching operational requirements set jointly by&nbsp;the Ministry of&nbsp;Defense and the design bureau. The team is&nbsp;now working to&nbsp;increase the effective range to&nbsp;80&nbsp;kilometers. </p><p>Under optimal conditions, such as&nbsp;a&nbsp;release altitude of&nbsp;10&nbsp;kilometers, the theoretical maximum range could reach 100&nbsp;kilometers, depending on&nbsp;tactical&nbsp;use.</p><p>The current test phase involves a&nbsp;series of&nbsp;trial drops, with initial results confirming the effectiveness of&nbsp;the release and glide systems. Further tests are required to&nbsp;complete the certification process through the Ministry of&nbsp;Defense. </p><p>However, Vostrykh emphasized that funding remains the primary obstacle to&nbsp;accelerating development and entering mass production.</p><p>The design bureau has launched a&nbsp;fundraising campaign through its own Foundation for Advanced Technologies, estimating the cost of&nbsp;one unit at&nbsp;approximately 1.2 million hryvnias, or&nbsp;about $25,000. </p><p>According to&nbsp;Medoid, Ukrainian forces require at&nbsp;least 100&nbsp;guided bombs of&nbsp;this type per day, a&nbsp;demand that is&nbsp;not fully met by&nbsp;Western-supplied systems such as&nbsp;JDAM-ER, AASM Hammer, or&nbsp;GBU-39/B SDB. In&nbsp;comparison, even the current prototype is&nbsp;already more cost-effective than foreign alternatives.</p><p>Earlier, <a href=\"https://united24media.com/latest-news/ukraines-new-lima-electronic-warfare-system-reportedly-outsmarts-russian-and-western-alternatives-9251\" target=\"_self\">reported</a> that Ukraine’s new Lima electronic warfare system has outperformed both Russian and Western counterparts in&nbsp;jamming guided aerial bombs used in&nbsp;Russian attacks.</p>","contentLength":2705,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1lkdj7m/ukraine_unveils_its_own_kab_glide_bombsfinally/"}],"tags":["news","reddit"]}