{"id":"4RDcb1QCVpCZpB54ijAYcT1W2","title":"Recent Discussions","displayTitle":"Recent Discussions","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Inquiry About Contributing to Korean Crystal Documentation","url":"https://forum.crystal-lang.org/t/inquiry-about-contributing-to-korean-crystal-documentation/8333","date":1754873613,"author":"hahwul","guid":37,"unread":true,"content":"<p>Could anyone provide information about the correct repository linked to the kr domain or point me to the right resources for contributing to the Korean translation?</p><p>Additionally, based on the URL, it appears that the repository might be a personal one. I think it would be better to manage it under an organization account, similar to <a href=\"https://github.com/crystal-french\" rel=\"noopener nofollow ugc\">https://github.com/crystal-french</a>, for better collaboration and maintenance. Any thoughts on this? Thank you!</p>","contentLength":443,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Should 'embedded Crystal' be Crystal?","url":"https://forum.crystal-lang.org/t/should-embedded-crystal-be-crystal/8330","date":1754752868,"author":"Barney","guid":36,"unread":true,"content":"<p>I recently noticed that  files are read as  by <a href=\"https://github.com/github-linguist/linguist\" rel=\"noopener nofollow ugc\">github’s linguist</a>, and subsequently by <a href=\"https://github.com/go-enry/go-enry\" rel=\"noopener nofollow ugc\">Go-Enry</a>, which is based on linguist.</p><p>This results in pure crystal projects with config files using embedded crystal listing HTML on code forges.</p><p>I opened <a href=\"https://github.com/github-linguist/linguist/issues/7521\" rel=\"noopener nofollow ugc\">an issue</a> to change  recognition to crystal, but I’m curious what you think.</p>","contentLength":317,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Field study of fiber-local storage","url":"https://forum.crystal-lang.org/t/field-study-of-fiber-local-storage/8325","date":1754732797,"author":"straight-shoota","guid":35,"unread":true,"content":"<p>We’re planning to add a stdlib API for fiber-local storage, which is a critical component for concurrent applications.</p><p>With the need for such a feature and the absence of an official API, Crystal libraries have adopted several custom implementations in order to get things working. But they’re often subpar (in general; they might be fine for the specific use case).</p><p>The goal is to implement a solid and efficient standard API to replace all currently used makeshift alternatives.</p><p>In order to understand  Crystal libraries use fiber local storage, I digged through publicly available sources and I’m going to list my findings here. It’s actually quite a large amount of shards using some form of fiber-local storage.</p><p>I’ve looked for some specific patterns which are commonly associated with fiber-local storage implementations. It’s likely that I missed some more unique implementations. Please add missing use cases in a comment!\nI appreciate any comments on the exploration and classification. Do you think it makes sense?</p><p>This study is intended to inform an RFC about fiber-local storage API for Crystal’s standard library.</p><p>All implementations I found use one of two base mechanism. Of course, each individual implementation may add different amounts of convenience wrapper around.</p><pre data-code-wrap=\"ruby\"><code>class Fiber\n  property my_fls : String?\nend\n\nFiber.current.my_fls = \"foo\"\n</code></pre><ul><li>Monkey patching additional properties into  is not ideal. There’s no direct danger besides name clashes with other libraries which do the same. But it’s also not a clean solution.</li><li>This is equivalent to a class variable, so there’s no direct  mapping.</li></ul>\n\nList of implementations <a href=\"https://forum.crystal-lang.org/t/field-study-of-fiber-local-storage/8325/1\">(click for more details)</a><h3><a name=\"p-32268-hash-mapping-fiber-instances-to-values-3\" href=\"https://forum.crystal-lang.org#p-32268-hash-mapping-fiber-instances-to-values-3\"></a>Hash mapping  instances to values</h3><pre data-code-wrap=\"ruby\"><code>fibers = Hash(Fiber, String).new.compare_by_identity\n\nMyFLS.fibers[Fiber.current] = \"foo\"\n</code></pre><ul><li>The hash can be a class or instance property. The latter allows  mappings which is necessary for some use cases (such as connection pools).</li><li>Some hashes use  instead of the  instance as the key. I’m not sure what’s the point of that. Maybe this predates ?</li></ul>\nList of implementations <a href=\"https://forum.crystal-lang.org/t/field-study-of-fiber-local-storage/8325/1\">(click for more details)</a><h3><a name=\"p-32268-extra-thread-local-storage-4\" href=\"https://forum.crystal-lang.org#p-32268-extra-thread-local-storage-4\"></a>Extra: Thread Local Storage</h3><p>The different use cases can be classified into several categories:</p><p>I think there are two different modes of how fiber local variables are used:</p><ul><li>A fixed property assigned to a fiber. It has exactly one value per fiber (or none through lazy initialization) and that value is unique per fiber. It must not be inherited by child fibers (structured concurrency).\nExample: Pool checkouts, transactions, recursion detection</li><li>A scoped property which may change over time. Assignments are usually scoped to a specific range of execution, and may be inherited by child fibers (structured concurrency)\nExample: observability contexts, configuration</li></ul><p>A challenge for the stdlib API is how to suit the needs for both of these modes.</p><p>It’s also important to clarify what are  appropriate use case for fiber-local storage.\nI think it is primarily intended for matters of code structure (such as a DB transaction is checked out to one specific strain of execution, i.e. a fiber).</p><p><small>12 posts - 5 participants</small></p>","contentLength":3109,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ambiguous use of `Time::Span` for duration and monotonic clock","url":"https://forum.crystal-lang.org/t/ambiguous-use-of-time-span-for-duration-and-monotonic-clock/8324","date":1754672967,"author":"straight-shoota","guid":34,"unread":true,"content":"<p>In the discussion of <a href=\"https://github.com/crystal-lang/rfcs/pull/14#discussion_r2252194890\">RFC0014</a> it became apparent that the <a href=\"https://crystal-lang.org/api/1.17.1/Time/Span.html\"></a> type can lead to confusion. Its primary purpose is to represent a duration of time. But we also use it for a reading of the monotonic clock (<a href=\"https://crystal-lang.org/api/1.17.1/Time.html#monotonic:Time::Span-class-method\"></a>). This makes some sense because the monotonic clock is just the time elapsed since some arbitrary point in time.</p><p>But this double use leads to problems when specifying some kind of timeout or delay: A duration represents a relative distance from the current instant. A monotonic clock reading represents an absolute instant. Either semantic is valid. And the type system makes it impossible to tell them apart.</p><p>The first proposal for a monotonic clock was actually for  (<a href=\"https://github.com/crystal-lang/crystal/pull/3827\">#3826</a>), but somehow - after intricate discussions about involving  and whether monotonic readings are even necessary on their own - we ended up piggy-bagging  on  (<a href=\"https://github.com/crystal-lang/crystal/pull/5108\">#5108</a>). I believe it was mostly for the sake of simplicity?</p><p>Maybe it’s time to rethink that? Having a separate type to represent a monotonic clock reading would be very helpful for use cases such as : A  argument represents a relative duration, a  (working title) argument represents an absolute instant.</p><p>The only affected stdlib API would be . It would be relatively easy to deprecate that and replace it with, for example , or .</p>","contentLength":1262,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Extension Methods in Crystal","url":"https://forum.crystal-lang.org/t/extension-methods-in-crystal/8323","date":1754656254,"author":"Haddock","guid":33,"unread":true,"content":"<p>I’m new to Crystal and from what I’ve seen so far Crystal does not have them like Ruby.</p><p>Java does not have them, either. This has resulted in Java in tons of static helper methods being created in separate utility classes, which is quite annoying as it breaks OO thinking and you have to know by heard about all those static utility methods and where the are located.</p><p>So “foo(bar(a))” could also be written as “a.bar().foo()“</p><p>My question is whether that would be an idea for Crystal as well. Maybe it would not be that hard to tweak the Crystal compiler to implement a similar solution. I don’t know - just a question ;-).</p><p><small>12 posts - 8 participants</small></p>","contentLength":658,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ld: warning: object file was built for newer macOS version than being linked","url":"https://forum.crystal-lang.org/t/ld-warning-object-file-was-built-for-newer-macos-version-than-being-linked/8319","date":1754605676,"author":"michaels","guid":32,"unread":true,"content":"<p>Sorry, I wanted to reply to the other <a href=\"https://forum.crystal-lang.org/t/question-about-make-std-spec/6288/3\">post</a>, but being a new user I was limited to 3 replies on that topic, so I’ve raised a new one to reply.</p><p>In that other post I was reporting why when doing ‘crystal run ..’ I would see so many of the following warnings:</p><p>ld: warning: object file (…o0.o) was built for newer macOS version (15.0) than being linked (11.0)</p><p>it was suggested by <a href=\"https://forum.crystal-lang.org/u/ysbaddaden\">@ysbaddaden</a> that I might need to set the env var $MACOSX_DEPLOYMENT_TARGET and I did set it to “15.5”, and reran, and found that the warnings were suppressed, which is great. However as a new crystal user, I think this is not very intuitive and wonder about the need to see those messages. Why would it be necessary to set this var? Is it possible to invert the situation so those are suppressed by default and enable a var or flag to show those? Thanks.</p>","contentLength":838,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["community"]}