{"id":"Pufd3b1W2k6wTiLsAaYmfbmYhpt2oECwmzhkA1Gmy5385NLty9yVj866","title":"Crystal Forum - Latest topics","displayTitle":"Forum","url":"https://forum.crystal-lang.org/latest.rss","feedLink":"https://forum.crystal-lang.org/latest","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":30,"items":[{"title":"Inquiry About Contributing to Korean Crystal Documentation","url":"https://forum.crystal-lang.org/t/inquiry-about-contributing-to-korean-crystal-documentation/8333","date":1754873613,"author":"hahwul","guid":37,"unread":true,"content":"<p>Could anyone provide information about the correct repository linked to the kr domain or point me to the right resources for contributing to the Korean translation?</p><p>Additionally, based on the URL, it appears that the repository might be a personal one. I think it would be better to manage it under an organization account, similar to <a href=\"https://github.com/crystal-french\" rel=\"noopener nofollow ugc\">https://github.com/crystal-french</a>, for better collaboration and maintenance. Any thoughts on this? Thank you!</p>","contentLength":443,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Should 'embedded Crystal' be Crystal?","url":"https://forum.crystal-lang.org/t/should-embedded-crystal-be-crystal/8330","date":1754752868,"author":"Barney","guid":36,"unread":true,"content":"<p>I recently noticed that  files are read as  by <a href=\"https://github.com/github-linguist/linguist\" rel=\"noopener nofollow ugc\">github’s linguist</a>, and subsequently by <a href=\"https://github.com/go-enry/go-enry\" rel=\"noopener nofollow ugc\">Go-Enry</a>, which is based on linguist.</p><p>This results in pure crystal projects with config files using embedded crystal listing HTML on code forges.</p><p>I opened <a href=\"https://github.com/github-linguist/linguist/issues/7521\" rel=\"noopener nofollow ugc\">an issue</a> to change  recognition to crystal, but I’m curious what you think.</p>","contentLength":317,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Field study of fiber-local storage","url":"https://forum.crystal-lang.org/t/field-study-of-fiber-local-storage/8325","date":1754732797,"author":"straight-shoota","guid":35,"unread":true,"content":"<p>We’re planning to add a stdlib API for fiber-local storage, which is a critical component for concurrent applications.</p><p>With the need for such a feature and the absence of an official API, Crystal libraries have adopted several custom implementations in order to get things working. But they’re often subpar (in general; they might be fine for the specific use case).</p><p>The goal is to implement a solid and efficient standard API to replace all currently used makeshift alternatives.</p><p>In order to understand  Crystal libraries use fiber local storage, I digged through publicly available sources and I’m going to list my findings here. It’s actually quite a large amount of shards using some form of fiber-local storage.</p><p>I’ve looked for some specific patterns which are commonly associated with fiber-local storage implementations. It’s likely that I missed some more unique implementations. Please add missing use cases in a comment!\nI appreciate any comments on the exploration and classification. Do you think it makes sense?</p><p>This study is intended to inform an RFC about fiber-local storage API for Crystal’s standard library.</p><p>All implementations I found use one of two base mechanism. Of course, each individual implementation may add different amounts of convenience wrapper around.</p><pre data-code-wrap=\"ruby\"><code>class Fiber\n  property my_fls : String?\nend\n\nFiber.current.my_fls = \"foo\"\n</code></pre><ul><li>Monkey patching additional properties into  is not ideal. There’s no direct danger besides name clashes with other libraries which do the same. But it’s also not a clean solution.</li><li>This is equivalent to a class variable, so there’s no direct  mapping.</li></ul>\n\nList of implementations <a href=\"https://forum.crystal-lang.org/t/field-study-of-fiber-local-storage/8325/1\">(click for more details)</a><h3><a name=\"p-32268-hash-mapping-fiber-instances-to-values-3\" href=\"https://forum.crystal-lang.org#p-32268-hash-mapping-fiber-instances-to-values-3\"></a>Hash mapping  instances to values</h3><pre data-code-wrap=\"ruby\"><code>fibers = Hash(Fiber, String).new.compare_by_identity\n\nMyFLS.fibers[Fiber.current] = \"foo\"\n</code></pre><ul><li>The hash can be a class or instance property. The latter allows  mappings which is necessary for some use cases (such as connection pools).</li><li>Some hashes use  instead of the  instance as the key. I’m not sure what’s the point of that. Maybe this predates ?</li></ul>\nList of implementations <a href=\"https://forum.crystal-lang.org/t/field-study-of-fiber-local-storage/8325/1\">(click for more details)</a><h3><a name=\"p-32268-extra-thread-local-storage-4\" href=\"https://forum.crystal-lang.org#p-32268-extra-thread-local-storage-4\"></a>Extra: Thread Local Storage</h3><p>The different use cases can be classified into several categories:</p><p>I think there are two different modes of how fiber local variables are used:</p><ul><li>A fixed property assigned to a fiber. It has exactly one value per fiber (or none through lazy initialization) and that value is unique per fiber. It must not be inherited by child fibers (structured concurrency).\nExample: Pool checkouts, transactions, recursion detection</li><li>A scoped property which may change over time. Assignments are usually scoped to a specific range of execution, and may be inherited by child fibers (structured concurrency)\nExample: observability contexts, configuration</li></ul><p>A challenge for the stdlib API is how to suit the needs for both of these modes.</p><p>It’s also important to clarify what are  appropriate use case for fiber-local storage.\nI think it is primarily intended for matters of code structure (such as a DB transaction is checked out to one specific strain of execution, i.e. a fiber).</p><p><small>12 posts - 5 participants</small></p>","contentLength":3109,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ambiguous use of `Time::Span` for duration and monotonic clock","url":"https://forum.crystal-lang.org/t/ambiguous-use-of-time-span-for-duration-and-monotonic-clock/8324","date":1754672967,"author":"straight-shoota","guid":34,"unread":true,"content":"<p>In the discussion of <a href=\"https://github.com/crystal-lang/rfcs/pull/14#discussion_r2252194890\">RFC0014</a> it became apparent that the <a href=\"https://crystal-lang.org/api/1.17.1/Time/Span.html\"></a> type can lead to confusion. Its primary purpose is to represent a duration of time. But we also use it for a reading of the monotonic clock (<a href=\"https://crystal-lang.org/api/1.17.1/Time.html#monotonic:Time::Span-class-method\"></a>). This makes some sense because the monotonic clock is just the time elapsed since some arbitrary point in time.</p><p>But this double use leads to problems when specifying some kind of timeout or delay: A duration represents a relative distance from the current instant. A monotonic clock reading represents an absolute instant. Either semantic is valid. And the type system makes it impossible to tell them apart.</p><p>The first proposal for a monotonic clock was actually for  (<a href=\"https://github.com/crystal-lang/crystal/pull/3827\">#3826</a>), but somehow - after intricate discussions about involving  and whether monotonic readings are even necessary on their own - we ended up piggy-bagging  on  (<a href=\"https://github.com/crystal-lang/crystal/pull/5108\">#5108</a>). I believe it was mostly for the sake of simplicity?</p><p>Maybe it’s time to rethink that? Having a separate type to represent a monotonic clock reading would be very helpful for use cases such as : A  argument represents a relative duration, a  (working title) argument represents an absolute instant.</p><p>The only affected stdlib API would be . It would be relatively easy to deprecate that and replace it with, for example , or .</p>","contentLength":1262,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Extension Methods in Crystal","url":"https://forum.crystal-lang.org/t/extension-methods-in-crystal/8323","date":1754656254,"author":"Haddock","guid":33,"unread":true,"content":"<p>I’m new to Crystal and from what I’ve seen so far Crystal does not have them like Ruby.</p><p>Java does not have them, either. This has resulted in Java in tons of static helper methods being created in separate utility classes, which is quite annoying as it breaks OO thinking and you have to know by heard about all those static utility methods and where the are located.</p><p>So “foo(bar(a))” could also be written as “a.bar().foo()“</p><p>My question is whether that would be an idea for Crystal as well. Maybe it would not be that hard to tweak the Crystal compiler to implement a similar solution. I don’t know - just a question ;-).</p><p><small>12 posts - 8 participants</small></p>","contentLength":658,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ld: warning: object file was built for newer macOS version than being linked","url":"https://forum.crystal-lang.org/t/ld-warning-object-file-was-built-for-newer-macos-version-than-being-linked/8319","date":1754605676,"author":"michaels","guid":32,"unread":true,"content":"<p>Sorry, I wanted to reply to the other <a href=\"https://forum.crystal-lang.org/t/question-about-make-std-spec/6288/3\">post</a>, but being a new user I was limited to 3 replies on that topic, so I’ve raised a new one to reply.</p><p>In that other post I was reporting why when doing ‘crystal run ..’ I would see so many of the following warnings:</p><p>ld: warning: object file (…o0.o) was built for newer macOS version (15.0) than being linked (11.0)</p><p>it was suggested by <a href=\"https://forum.crystal-lang.org/u/ysbaddaden\">@ysbaddaden</a> that I might need to set the env var $MACOSX_DEPLOYMENT_TARGET and I did set it to “15.5”, and reran, and found that the warnings were suppressed, which is great. However as a new crystal user, I think this is not very intuitive and wonder about the need to see those messages. Why would it be necessary to set this var? Is it possible to invert the situation so those are suppressed by default and enable a var or flag to show those? Thanks.</p>","contentLength":838,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Is there a way to tell apart if I'm running a script from Ruby vs Crystal?","url":"https://forum.crystal-lang.org/t/is-there-a-way-to-tell-apart-if-im-running-a-script-from-ruby-vs-crystal/8317","date":1754490510,"author":"Fryguy","guid":31,"unread":true,"content":"<p>Sometimes when I’m trying to compare the languages, particularly for new features or changes, I’ll write a script that should work in both languages. However, sometimes I need a conditional that says “If run from Ruby do X, else if run from Crystal do Y”.  Is there something in the language that can help me with this?</p><p>I instinctively reached for , but that seems to have been removed from the language in favor of , but then of course  doesn’t exist in Ruby.</p>","contentLength":469,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Https://marioarias.hashnode.dev/a-response-to-the-luajit-is-wicked-fast-video","url":"https://forum.crystal-lang.org/t/https-marioarias-hashnode-dev-a-response-to-the-luajit-is-wicked-fast-video/8312","date":1754332308,"author":"MarioAriasC","guid":30,"unread":true,"content":"<p>A short blogpost about luajit, C and Crystal</p><p><small>12 posts - 4 participants</small></p>","contentLength":69,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Checking to see if a connection is writeable with epol","url":"https://forum.crystal-lang.org/t/checking-to-see-if-a-connection-is-writeable-with-epol/8311","date":1754325475,"author":"bmmcginty","guid":29,"unread":true,"content":"<p>I’ve got a connection generated by a C library (LibPQ).\nIt returns an FD (which is either a socket or pipe).<p>\nI need to see if that fd is writable via the event loop, and then call a function in the C library to let it process data from/to the connection.</p>\nWith libevent, the below script works, but with epol it fails. I wonder if there’s something I need to be calling to “clear” the writeable status?<p>\nAlso, I know this method is kind of internal, so I’m open to other suggestions.</p></p><pre data-code-wrap=\"crystal\"><code>require \"socket\"\n\nspawn do\n  while 1\n    puts \"ping\"\n    sleep 5.seconds\n  end\nend\n\nputs Crystal::EventLoop.current.class.name\nio = TCPSocket.new(\"localhost\", 80)\nCrystal::EventLoop.current.wait_writable(io)\nputs \"waited\"\nCrystal::EventLoop.current.wait_writable(io)\nputs \"waited 2\"\nsleep\n</code></pre><pre data-code-wrap=\"shell\"><code>$ CRYSTAL_OPTS=-Devloop=libevent crystal build a.cr &amp;&amp; ./a\nCrystal::EventLoop::LibEvent\nping\nwaited\nwaited 2\nping\n^C\n$ CRYSTAL_OPTS= crystal build a.cr &amp;&amp; ./a\nCrystal::EventLoop::Epoll\nping\nping\n^C\n</code></pre>","contentLength":978,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Marten 0.6 has been officially released!","url":"https://forum.crystal-lang.org/t/marten-0-6-has-been-officially-released/8309","date":1754245927,"author":"ellmetha","guid":28,"unread":true,"content":"<p>I am pleased to announce that <a href=\"https://martenframework.com/docs/the-marten-project/release-notes/0.6\" rel=\"noopener nofollow ugc\">Marten </a> has been officially released! <img src=\"https://emoji.discourse-cdn.com/google_classic/rocket.png?v=14\" title=\":rocket:\" alt=\":rocket:\" loading=\"lazy\" width=\"20\" height=\"20\"><img src=\"https://emoji.discourse-cdn.com/google_classic/tada.png?v=14\" title=\":tada:\" alt=\":tada:\" loading=\"lazy\" width=\"20\" height=\"20\"></p><p><a href=\"https://martenframework.com\" rel=\"noopener nofollow ugc\">Marten</a> is a Crystal web framework that makes building web applications easy, productive, and fun. The latest  release of the framework brings significant enhancements, including the ability to define localized routes, support for annotations, array fields for schemas, and support for image fiels for models and schemas. These features make building apps with Marten smoother and more flexible. For a detailed overview of all new features and changes, check out the <a href=\"https://martenframework.com/docs/the-marten-project/release-notes/0.6\" rel=\"noopener nofollow ugc\">full changelog</a>.</p><p><strong>Main new features and highlights</strong></p><ul><li><a href=\"https://martenframework.com/docs/i18n/localized-routes\" rel=\"noopener nofollow ugc\"></a> - Marten now provides the ability to define localized routes through the use of two mechanisms: automatically adding locale prefixes to routes and activating the appropriate locale based on the prefix, and translating the routes themselves. These mechanisms can be used independently or in combination in order to easily localize your application’s URLs.</li><li><a href=\"https://martenframework.com/docs/models-and-databases/queries#annotating-query-sets-with-aggregated-data\" rel=\"noopener nofollow ugc\"></a> - Marten now lets you annotate query sets with aggregated data. This is useful when you need to “retain” aggregated values for each record in a query set (possibly for further filtering or for making use of the aggregated values when dealing with individual records). This can be achieved by using the <a href=\"https://martenframework.com/docs/models-and-databases/reference/query-set#annotate\" rel=\"noopener nofollow ugc\"></a> method.</li><li> - Marten now lets you define <a href=\"https://martenframework.com/docs/schemas/reference/fields#array\" rel=\"noopener nofollow ugc\"></a> schema fields that allow validating lists of values, with each value subject to the validation rules of an array member field (such as , , or any other existing <a href=\"https://martenframework.com/docs/schemas/reference/fields\" rel=\"noopener nofollow ugc\">schema field type</a>).</li><li><strong>Image fields for models and schemas</strong> - It is now possible to define  fields in <a href=\"https://martenframework.com/docs/models-and-databases/reference/fields#image\" rel=\"noopener nofollow ugc\">models</a> and <a href=\"https://martenframework.com/docs/schemas/reference/fields#image\" rel=\"noopener nofollow ugc\">schemas</a>, which allow you to store or validate files that are indeed images.</li><li>Plus many other enhancements and quality-of-life improvements — including smaller features, refinements, and fixes that make building with Marten even more enjoyable. Check out the <a href=\"https://martenframework.com/docs/next/the-marten-project/release-notes/0.6#minor-features\" rel=\"noopener nofollow ugc\">full changelog</a> for all the details.</li></ul><p>The Marten framework is still in its early stages, and the core team is actively seeking feedback from users interested in experimenting with it or integrating it into their projects. If you encounter any bugs or have ideas to contribute, please open an issue or start a discussion in the <a href=\"https://github.com/martenframework/marten/issues/new/choose\" rel=\"noopener nofollow ugc\">project’s issue tracker on GitHub</a> or join us on <a href=\"https://martenframework.com/chat\" rel=\"noopener nofollow ugc\">Discord</a>. Your input and contributions are greatly appreciated!</p><p>If you are new to Marten, here are a few ideas on how you can get started:</p>","contentLength":2321,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Initializing an Array of 1M+ elements at compile time","url":"https://forum.crystal-lang.org/t/initializing-an-array-of-1m-elements-at-compile-time/8304","date":1754000812,"author":"jzakiya","guid":27,"unread":true,"content":"<p>I have a method inside a loop that performs a numeric computation, that uses a constant array of 1M+ elements.  Currently, it generates this array every time it’s called.</p><p>How can I generate the array at compile time so I can use it without generating the 1M+ elements at run time?</p>","contentLength":281,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Have I hit compiler bugs?","url":"https://forum.crystal-lang.org/t/have-i-hit-compiler-bugs/8303","date":1753984596,"author":"u89012","guid":26,"unread":true,"content":"<pre><code>crystal version\nCrystal 1.17.0 (2025-07-16)\n\nLLVM: 20.1.8\nDefault target: aarch64-apple-darwin24.1.0\n</code></pre><p>I’m seeing some weird behaviors and wanted to check with you all to see if these are known issues or have I run into a new compiler bug(s)?</p><p>I’ve got a fairly large codebase and I’m seeing two issues:</p><ol><li>Compiler freezes sometimes for minutes with  (the longest I’ve seen when trying to understand this was ~9m), aborting and rerunning it completes the compilation in meaningful time (about ~2m). And no, it’s not downloading deps as I see the <code>Dependencies are satisfied</code> message.</li><li>This one I’m not sure how to explain without sounding crazy – I want to believe my code is fairly straightforward for the most part since the code where I’m seeing this issue is a webapp backend doing routine backend stuff – fetching from db and sending an http response and such – the issue here is the compiler seems to happily chug along even when it sees undefined methods, what’s even puzzling is it complains with one set of args but not another, so if I had a two consecutive lines</li></ol><pre><code>this_method_does_not_exist(123) #compile error as expected\nthis_method_does_not_exist(“user_id=$1”, 123) #commenting above does not cause compiler error on this line\n</code></pre><p>it only complains on the first but not the second! See below for compiler error on the first missing one just to confirm.</p><p>I’m unable to share the full code at the moment but will see if I can duplicate it with a smaller example. Meanwhile I was hoping if someone has seen this before.</p><p><small>43 posts - 10 participants</small></p>","contentLength":1565,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Trying to build for armv7","url":"https://forum.crystal-lang.org/t/trying-to-build-for-armv7/8283","date":1753369635,"author":"ralsina","guid":25,"unread":true,"content":"<p>Lately there are a number of <a href=\"https://www.luckfox.com/index.php?route=product/product&amp;product_id=476\" rel=\"noopener nofollow ugc\">REALLY cheap development boards</a> that I would like to use for some hardware development projects. However they are 32 bit armv7l architecture.</p><p>The platforms page says it’s a tier 2 platform, so “it should work but CI doesn’t run”</p><p>Is there any guide on how to try building the compiler in that platform or to build  compiler that targets that platform?</p>","contentLength":385,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Unexpected arithmetic behavior","url":"https://forum.crystal-lang.org/t/unexpected-arithmetic-behavior/8276","date":1753218902,"author":"jzakiya","guid":24,"unread":true,"content":"<p>This is unexpected behavior.</p><pre><code>n = 77\nputs n|1 - 1    # =&gt; 77\nputs (n|1) - 1  # =&gt; 76\n</code></pre><pre><code>n = 80\nputs n|1 - 1    # =&gt; 80\nputs (n|1) - 1  # =&gt; 80\n</code></pre><p>It seems  is parsed as </p><p><small>31 posts - 8 participants</small></p>","contentLength":186,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Crystal 1.17.1 is released!","url":"https://forum.crystal-lang.org/t/crystal-1-17-1-is-released/8273","date":1753181240,"author":"Crys","guid":23,"unread":true,"content":"<p>We are announcing a new Crystal release 1.17.1 with a regression bug fix.</p>","contentLength":73,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How further/quicker can I make this solution for a fun hackathon?","url":"https://forum.crystal-lang.org/t/how-further-quicker-can-i-make-this-solution-for-a-fun-hackathon/8272","date":1753116261,"author":"lukas8219","guid":22,"unread":true,"content":"<p>Hey <img src=\"https://emoji.discourse-cdn.com/google_classic/waving_hand.png?v=14\" title=\":waving_hand:\" alt=\":waving_hand:\" loading=\"lazy\" width=\"20\" height=\"20\">  I am new-comer into the language which came to my knowledge while contributing to LavinMQ.</p><p>The first opportunity for me to understand the language more deeply is the <a href=\"https://github.com/zanfranceschi/rinha-de-backend-2025\" rel=\"noopener nofollow ugc\">Brazilian Brawl</a> - an annual country-wide hackathon 4fun with backend challenges. This year the challenge is to write an API that can integrate with another API by which may or may-not be failing.</p><p>It’s a great exercise for overall engineering and it’s all allowed.</p><p>I am asking wether anyone want’s to nerd about much I can push forward for performance using Crystal.</p><ul><li>Total amount of requests + processed $$ should be consistent with your backend + the processors.</li></ul><p>My current solution and performance-points:</p><ul><li>Read API + Worker to integrate/call external APIs.</li><li>The  stores in-memory SkipList to run RANGE queries with SUM</li><li>NGINX load balances writes and ponts READS into the worker.</li></ul><h2><a name=\"p-32057-what-i-wanted-to-ask-and-discuss-1\" href=\"https://forum.crystal-lang.org#p-32057-what-i-wanted-to-ask-and-discuss-1\"></a>What I wanted to ask and discuss:</h2><ul><li>How fast can I make the p99?</li><li>Is there any clear performance issues with my code regarding Crystal best practices?</li></ul>","contentLength":993,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Unable to return BigDecimal in resultsets","url":"https://forum.crystal-lang.org/t/unable-to-return-bigdecimal-in-resultsets/8260","date":1752927253,"author":"u89012","guid":21,"unread":true,"content":"<p>Can someone please help me understand why trying to return a  in the named tuple resultset seems to fail (with can’t infer block type error) but returning a nilable BigDecimal works just fine? Please see the example code and the error message below:</p><pre><code>require \"db\"\nrequire \"pg\"\nrequire \"big\"\nrequire \"big/number\"\nrequire \"big/json\"\n\ndb = DB.open(\"postgres://foo:bar@localhost:5432/quux\")\ndb.query_one \"select 1::numeric as n\", as: {n: BigDecimal} #fails to compile with BigDecimal\ndb.query_one \"select 1::numeric as n\", as: {n: BigDecimal?} #compiles ok with BigDecimal?\n</code></pre><pre><code>In src/main.cr:878:4\n\n 878 | db.query_one \"select 1::numeric as n\", as: {n: BigDecimal}\n          ^--------\nError: instantiating 'DB::Database#query_one(String, as: NamedTuple(n: BigDecimal.class))'\n\n\nIn lib/db/src/db/query_methods.cr:112:7\n\n 112 | query_one(query, *args_, args: args) do |rs|\n       ^--------\nError: can't infer block return type, try to cast the block body with `as`. See: https://crystal-lang.org/reference/syntax_and_semantics/as.html#usage-for-when-the-compiler-cant-infer-the-type-of-a-block\n</code></pre>","contentLength":1085,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Crystal 1.17.0 is released!","url":"https://forum.crystal-lang.org/t/crystal-1-17-0-is-released/8244","date":1752696888,"author":"Crys","guid":20,"unread":true,"content":"<p>We are announcing a new Crystal release 1.17.0 with several new features and bug\nfixes.</p>","contentLength":87,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Memory usage of HTTP one-shot vs maintaining a persistent connection","url":"https://forum.crystal-lang.org/t/memory-usage-of-http-one-shot-vs-maintaining-a-persistent-connection/8237","date":1752609485,"author":"jgaskins","guid":19,"unread":true,"content":"<p>I deployed <a href=\"https://zomglol.wtf/@joco_ks_weather\" rel=\"noopener nofollow ugc\">a Mastodon bot</a> a couple weeks ago that polls a US National Weather Service RSS feed for an airport in my county and posts to Mastodon when it updates. I was using the  “one-shot” methods that spin up an HTTP connection, send the request, then terminate the connection.</p><p>I expected this bot to use very little RAM (less than 10MB) because it’s  very little:</p><ol><li>Makes an HTTP request to get the RSS feed</li><li>Iterates over each feed item (there’s only one)</li><li>If it hasn’t been posted yet (tracked by a key in Redis or a record in SQLite), make an HTTP request to the Mastodon API</li></ol><p>What surprised me was that RAM consumption grew over time.</p><p>The first two lines show linear memory growth. I restarted the app and it happened again. Then I tried a few more experiments:</p><ul><li>Replace SQLite with Redis</li><li>Replace the RSS feed parser with using stdlib  directly</li><li>Remove all XML parsing and just use regexes (yes, <a href=\"https://stackoverflow.com/a/1732454\" rel=\"noopener nofollow ugc\">I know</a>, don’t worry about it)</li><li>Compile the app using  for the specific aarch64 CPUs I’m using on GCP</li><li>Cap memory usage to 20MB so it’ll just restart when it exceeds it</li><li>Use a persistent HTTP connection</li></ul><p>The first 4 didn’t do anything useful. Capping memory usage actually caused an additional problem — it caused the app to crash  persisting that it was posting to Mastodon but  actually posting.</p><p>The punchline is in the image above, but after almost 24 hours using a persistent HTTP connection (<a href=\"https://github.com/jgaskins/http_client\" rel=\"noopener nofollow ugc\">with a connection pool</a>) for both the RSS feed and the Mastodon API, memory usage has tapered at about 5MB. This is the only thing that kept RAM stable at single-digit MB.</p><p>That makes me wonder if there’s something in OpenSSL (either in the version of OpenSSL itself that’s included in <a href=\"https://hub.docker.com/r/84codes/crystal/tags\" rel=\"noopener nofollow ugc\">the 84codes Alpine-based container images</a> or in the Crystal bindings for it) that’s causing it to leak memory. I’ve only ever seen this kind of memory growth in <a href=\"https://github.com/toddsundsted/ktistec\" rel=\"noopener nofollow ugc\">Ktistec</a>, which is why I thought it might be something in SQLite but it happening when running one-shot HTTP requests would also track.</p><p>Regardless of the reason, if you want to minimize memory consumption in an app that talks to other HTTP services, reusing HTTP connections will do that.</p>","contentLength":2132,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"OpenSSL::Digest store and resume","url":"https://forum.crystal-lang.org/t/openssl-digest-store-and-resume/8236","date":1752597712,"author":"dup2","guid":18,"unread":true,"content":"<p>I’m trying to implement a “resumable” SHA256 digest which can be persisted and later resumed when new data arrives, the use case is a distributed uploader where the data arrives in chunks.</p><p>For this, I’m trying to store a LibCrypto::EVP_MD_CTX_Struct somewhere (disk, redis) and then later resuming with a new Digest::SHA256 instance (or an extension of it as the initializer with a ctx is protected).</p><p>Any pointers for this? Is this even possible? (I failed so far..)</p>","contentLength":472,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Bind macro for use in web dev","url":"https://forum.crystal-lang.org/t/bind-macro-for-use-in-web-dev/8229","date":1752493677,"author":"u89012","guid":17,"unread":true,"content":"<p>I’ve the following macros (which works fine) which I’d like to enhance so it can be used to bind to form args as well – I’ve tried a bunch of variations but can’t seem to get it right, LLMs haven’t been helpful either (as they seem to produce code that iterates over the  which refuses to compile), can someone please help?</p><pre><code>macro bind(type)\n  {{type}}.from_json(context.request.body.not_nil!)\nend\n\nmacro bind(**args)\n  NamedTuple({{args.double_splat}}).from_json(context.request.body.not_nil!)\nend\n</code></pre><p>Which can be used like so:</p><pre><code>alias User = NamedTuple(email: String, password: String, remember_me: Bool?)\n#...\npayload = bind(User) #works fine for predefined types\n\n# using the second version with **args\npayload = bind(email: String, password: String, remember_me: Bool?) #works fine for one off captures too\n</code></pre><p>Assuming  exists (which merges ,  and ) how would one go about extending the above two macros so it handles both JSON and form params? I understand binding to form params can be tricky for nested structures but I’m hoping to get to a bare minimum version that can be useful.</p>","contentLength":1092,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"High level LLM libraries?","url":"https://forum.crystal-lang.org/t/high-level-llm-libraries/8221","date":1752230594,"author":"Brunette69","guid":16,"unread":true,"content":"<p>I am working on a local RAG system.\nAre there any bindings or libraries to work with smaller LLM’s directly on CPU at least. For embedding text, comparing (rerank) and summarization/gen.</p><p>I tried many things.\nOllama rest api, no rerank, built upon llama.cpp.<p>\nTried llama.cpp llama-server, embeding/pooling doesn’t work.</p>\nTried openvino, hit a wall with pipeline setup. Needs python scripts etc.<p>\nTried onnx, some onnx attempt by kojix also on crystal. But again I hit a wall again at tokenizing.</p>\nAs I see tokenizer support is crucial.</p><p>Now soome very low level libraries for ML seem to be available, but\nare there any higher level libraries available in crystal?</p><p>Features:\nLoading/unloading a model, send text to embed, get 1 embeded vector (mean, last, cls..), rerank and generate.<p>\nEither as bindings to C/C++ or as a separate REST API fast small http server.</p></p><p>Any info, directions, experience of yours (especially positive) would be very welcome.\nThank you in advance.</p>","contentLength":965,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"For 2.0: Make Default Values i64 vs i32","url":"https://forum.crystal-lang.org/t/for-2-0-make-default-values-i64-vs-i32/8216","date":1752082751,"author":"jzakiya","guid":15,"unread":true,"content":"<p>It’s been about 2 decades since 64-bit systems became the dominant platform for general computing systems. Additionally, default system memory has risen from 1-2 GB to 16-32GB, with many systems providing available memory of 128GB.</p><p>Currently, if you do:   its explicit definition is .\nI propose making values default to , thus  defaults to be .</p><p>\nI primarily do numerical applications. I sometimes run into runtime arithmetic overflows because somewhere in the code is an implicit  value I have to track down and change to an  while doing a series of arithmetic operations.  This will possibly make the use of  values easier to see and use in code.</p><p>This should also apply to  for , , and  , to provide better access to memory beyond  lengths|addresses.</p><p>Again, since most hardware is  oriented, it’s actually more efficient|faster to use the native size structure of the hardware as much as possible to optimize compiler efficiency and output.</p><p>Other languages have already (at least in part) made  values|operations their default configurations to take better advantage of hardware.</p><p>\nSince 2.0, by default, will introduce breaking changes, this should not be too distruptive.  Old code should work with no|little change, as values &lt;  would operate as before.  Now, to limit sizes of values &lt;   would require explicit type declarations, as currently necessary for values &lt; and &gt; .</p>","contentLength":1375,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Get enum underlying type in compile time","url":"https://forum.crystal-lang.org/t/get-enum-underlying-type-in-compile-time/8215","date":1752062962,"author":"mentalblood","guid":14,"unread":true,"content":"<p>Is it possible to get enum underlying type in compile type (i.e. in macro)? Stuck with this trying to support enum types in storage schema providing correct storage type like UInt8/UInt16 so to reduce storage usage but also support large enums if needed</p>","contentLength":253,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Sqlite3_compress: Custom compression functions in crystal-sqlite3","url":"https://forum.crystal-lang.org/t/sqlite3-compress-custom-compression-functions-in-crystal-sqlite3/8213","date":1752038295,"author":"plambert","guid":13,"unread":true,"content":"<p>I’ve also just released sqlite3_compress, which implements gzip, deflate, and zlib compression in SQLite user defined functions.</p><p>It might serve as an example of how to implement custom functions. Or it might serve as an example of how  to do it… let me know what you think, either way!</p><p>For example: <code>db.exec \"INSERT INTO my_table (url, html_gzip) VALUES (?, COMPRESS_GZIP(?))\", url, html</code></p>","contentLength":388,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Sqlite3_uri: Support URI objects in sqlite3 bindings","url":"https://forum.crystal-lang.org/t/sqlite3-uri-support-uri-objects-in-sqlite3-bindings/8212","date":1752012068,"author":"plambert","guid":12,"unread":true,"content":"<p>I might make a pull request to add it to crystal-sqlite3; however, if I do, it’d be a separate  as I think such things need to be conscious decisions by the programmer, and because folks might already have their own implementations.</p><p>Regardless, hopefully it also serves as an example of how to do this for any class or struct.</p><p>Comments, issues, pull requests, and cash donations are welcome!</p>","contentLength":391,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"SHAInet v3.0.1 Released!","url":"https://forum.crystal-lang.org/t/shainet-v3-0-1-released/8209","date":1751999147,"author":"bararchy","guid":11,"unread":true,"content":"<p>It has been quite a while since a release of <a href=\"https://github.com/NeuraLegion/shainet\" rel=\"noopener nofollow ugc\">SHAInet</a> happened.</p><p>\nSHAInet is a full neural network and deep learning framework made in pure crystal, it can train actual LLMs and can use CUDA for fast operations.</p><p>The latest changes bring forth:</p><ol><li>GPU support for CUDA and CUDBLAS</li><li>LLM network support with an example training on the BabyLM Challagne.</li><li>Support for GPT2\\GPT3 features.</li><li>Transformer layers with sinusoidal positional encoding</li><li>BPE tokenizer and vocabulary training</li><li>Cross-entropy loss for language modeling</li><li>CUDA acceleration (with cuDNN)</li><li>Streaming datasets in JSONL</li><li>Autograd, AdamW optimizer</li><li>GPU-friendly mini-batch training</li></ol><p>\nIf you want to understand neural network more deeply but don’t want to use python or getting into huge eco-systems like PyTorch or TensorFlow.<p>\nMaybe you want to train a small model at home? or maybe you want to run some model from hugging face and run it inside crystal code?</p></p><p><strong>Why are you wasting your time on this project for the last 8 years?</strong>\nI hold a dream about Crystal being a mainstream language or at least a more popular one, SHAInet was aimed at bringing easy to use real world deep learning into the world of Crystal, and now that the new tech moved from computer vision and simple networks into the realm of LLMs I thought that it wasn’t fair to keep us without a library that can work in that regard.<p>\nAlso, I just love Crystal what can I say ;)</p></p>","contentLength":1375,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Crystal Compass","url":"https://forum.crystal-lang.org/t/crystal-compass/8208","date":1751987349,"author":"Crys","guid":10,"unread":true,"content":"<p><a href=\"https://manas.tech/\">Manas.Tech</a>, the company behind Crystal, launches a new service: .</p>","contentLength":65,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Yes, another project: KV, a remote KVM solution","url":"https://forum.crystal-lang.org/t/yes-another-project-kv-a-remote-kvm-solution/8207","date":1751896169,"author":"ralsina","guid":9,"unread":true,"content":"<p>I know, I know, I start too many things, but this one is nice!</p><p>What is KV? A remote KVM.</p><p>If you are familiar with <a href=\"https://pikvm.org/\" rel=\"noopener nofollow ugc\">PiKVM</a><a href=\"https://jetkvm.com/\" rel=\"noopener nofollow ugc\">JetKVM</a> or other similar things, they are gadgets that connect to a server and basically put them in the matrix:</p><ul><li>They capture the HDMI output</li><li>They provide keyboard and mouse and mass storage via USB</li></ul><p>And then … they create a webpage where you can see the video and send keyboard and mouse input to the server. This is different from VNC or RDP in that it’s all hardware to the server, so you can remotely access the server BIOS or even install the OS to it.</p><p>I got frustrated trying to figure out why no existing solution could run with my perfectly nice hardware I had in a drawer (a Radxa zero, some cables and a $5 USB dongle to capture video), so I sat down for a day and wrote it <img src=\"https://emoji.discourse-cdn.com/google_classic/slight_smile.png?v=14\" title=\":slight_smile:\" alt=\":slight_smile:\" loading=\"lazy\" width=\"20\" height=\"20\"> this would not have been possible without Crystal, so thanks folks!</p>","contentLength":867,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Process: keep the colored output","url":"https://forum.crystal-lang.org/t/process-keep-the-colored-output/8203","date":1751652639,"author":"Fulgurance","guid":8,"unread":true,"content":"<p>Hi guys, I have a question. When I use Process.run, can it be possible to keep the command output color ?</p><p>For example, if I run this, the ouput is only black and white. But normally ls have a colored output:</p><pre data-code-wrap=\"crystal\"><code>Process.run(\"ls\", shell: true, output: Process::Redirect::Inherit)\n</code></pre>","contentLength":273,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["community"]}